{"publisher": "Bandai Namco Games", "genres": ["Action", "Fighting", "3D"], "rating": "T", "title": "J-Stars Victory Vs+", "release_date": "Jun 30, 2015", "avg_score": "61", "summary": "J-STARS Victory Vs+ invites fans and gamers to play with their favorite manga/anime characters and progress in the JUMP World through different environments recalling NARUTO, DRAGON BALL Z, ONE PIECE and other memorable moments.", "reviews": [["Eurogamer Italy", "Critic", "80", "J-STARS Victory VS+ is not perfect, but is the ultimate anime crossover and a must have for anyone who loves manga and Japanese animation."], ["IGN Italia", "Critic", "80", "Its structure lacks of frills and it may appear to simple, but J-Stars Victory VS. + is a joy to play and can count on an excellent roster of fighters."], ["Dealspwn", "Critic", "80", "J-Stars Victory VS+ is a crossover for the ages and a delightfully mad brawler in its own right. A few shortcomings are overshadowed by the attention to detail, great cast, riotous combat and the big silly grin it will leave on your face."], ["4Players.de", "Critic", "78", "The more characters you know or recognize the more fun you will have with this tremendous roster of animanga star power. But fortunately J-Stars has more to offer, e.g. a solid fighting system and astonishingly diverse characters. The arenas and campaign mode lack variety, though."], ["Critical Hit", "Critic", "75", "With some polish and refinement; it could be a great series. I really hope that this isn’t its final form."], ["IGN Spain", "Critic", "75", "Unlike almost everything, but far from perfect. Otakus should have it, the other players may have more complete options, but not so original in its genre."], ["Multiplayer.it", "Critic", "75", "As a fighting game, J-Stars Victory VR+ is quite limited, but with more than fifty characters taken from the most important manga and anime series, will definitely make Shonen Jump fans happy."], ["Vandal", "Critic", "75", "It's a great tribute to a good amount of anime and manga characters, but when it comes to gameplay some ideas are better than others. Still, as a game, it is really fun, and particularly enjoyable if you like the franchises it is based on."], ["Hobby Consolas", "Critic", "75", "Specially designed for the otaku fandom. It feels chaotic the first time you play it and its graphics are clearly outdated, but it delivers some flashy and spectacular moments. Tip: play it with friends."], ["3DJuegos", "Critic", "75", "A dream come true for manganime fans. The most popular franchises and characters from the Shonen Jump magazine are included."], ["Digital Chumps", "Critic", "74", "J-Stars Victory Vs+ brings together some good fighting moments with popular Bandai Namco licenses, while offering up somewhat addictive, yet sporadic, gameplay flow. Improvements in environment variety, CPU artificial intelligence and visuals could help to make this a more memorable brawler in the future, as it falls short in these categories as it stands."], ["LaPS4", "Critic", "73", "Interesting game that pulls together 32 different franchises of Shonen Jump into a fighting game, with a story mode, an online mode and an arcade mode, only for the western version. We miss some characters and more stages. However, you can't miss this if you're a fan of manga and/or anime."], ["Playstation Official Magazine UK", "Critic", "70", "When it goes the way you want, though, Victory VS is a bold, enjoyable mess. [Sept 2015, p.94]"], ["ZTGD", "Critic", "70", "J-Stars Victory Vs+ accomplishes what it sets out to do. It is pure fan-service for fans of anime, most importantly the series it includes."], ["Atomix", "Critic", "70", "It's good to see the localization of games like J-Stars Victory in order to attend the loyal manga and anime fans. This game is good in references and fan service but regular on the gameplay mechanics with some troubles with combat and camera. At the end of the day some fans will be able to enjoy the whole experience."], ["Attack of the Fanboy", "Critic", "70", "J-Stars Victory VS+ is built specifically for fans of the numerous franchises represented within with an enjoyable story mode, but outsiders will likely find nothing of interest here."], ["Push Square", "Critic", "70", "A solid character roster coupled with some eye-catching combat is what this beat-'em-up is all about – even if it could afford to take some more risks, given the wealth of source material on offer."], ["Game Over Online", "Critic", "65", "Unfortunately, J-Stars Victory VS+ isn’t quite good enough to warrant a buy for most people. If you are a big fan of the anime/manga franchises contained within it, check it out."], ["CGMagazine", "Critic", "65", ".J-Stars is another case of a Japanese game that preaches convincingly to its chosen choir."], ["Worth Playing", "Critic", "65", "J-Stars Victory Versus+ has a lot of heart, but that heart doesn't guarantee good gameplay."], ["GameCrate", "Critic", "65", "J-Stars Victory Vs. + mostly gets the job done when it comes to delivering a manic anime-based brawler for fans that have been waiting for the next Jump Superstars. But more could've easily been done with it, especially with the presentation and the fighting system."], ["PlayStation LifeStyle", "Critic", "65", "If you want a game with decent combat, it might be a good idea to check J-Stars out. However, if graphics are important to you, you might want to take a pass on this one."], ["God is a Geek", "Critic", "65", "The flaws will probably dampen your enjoyment too much – and, to be fair, there are more accomplished fighting games out there."], ["Impulsegamer", "Critic", "62", "For me, J-Stars Victory VS + started out strong but petered out in the end as its shallow fighting mechanics became apparent, but even with these limitations, the varied (At least visually) roster and breakneck online multiplayer makes the game worth a look for fighting fans in the market for something a little different."], ["Play UK", "Critic", "60", "There's a good game hidden in here somewhere, but believe us when we say it's been buried pretty well and we're pretty sure that it's not going to surface any time soon. [Issue#260, p.72]"], ["LevelUp", "Critic", "60", "J-Stars Victory VS+ is a love letter to manga and anime fans, specifically those who enjoy Weekly Shonen Jump. True fans of the genre will find the story mode entertaining as well as the references to many renown franchises, while outsiders are left with nothing of interest at all."], ["TheSixthAxis", "Critic", "60", "Manga die-hards are bound to get a real kick out of J-Stars Victory VS+. The level of fan service here is on point and there’s a solid fighting game to back it up. That said, after just a few hours it begins to lose steam, becoming less and less appealing as something you’d want to play for long sessions."], ["GamesVillage.it", "Critic", "60", "Spike Chunsoft tried to create something unique with its J-Stars Victory VS Plus, and we appreciate the effort, but the truth is that we can easily file this game under the \"nice try\" category. Beautiful to see, not fun to play."], ["GameCritics", "Critic", "55", "J-Stars Victory VS+ doesn't look all that hot, offers inconsistent controls and camera, and features wildly unbalanced characters. While it was admittedly awesome to see Vegeta from Dragon Ball power up in a manner 100% authentic to how he is on screen, there's just nothing here for those who aren't already sold on the characters and franchises."], ["JeuxActu", "Critic", "55", "If you are a fan of most Japanese manga ip's, forget about J-Stars Victory VS+ which is mainly a cashpump with licensing but that's it. The technical side is a mess and the gameplay is far from average. Only recommended to the most hardcore of otakus."], ["games(TM)", "Critic", "50", "Very young and very undemanding fans of shōnen manga may get a fleeting kick out of J-Stars Victory VS+, but there’s too much cheaper (and superior) competition currently available across all platforms to warrant a half-hearted recommendation."], ["Hardcore Gamer", "Critic", "50", "J-Stars Victory VS+ fumbles what should have been a glorious, celebratory experience. It’s combat is banal, its design is overcomplicated and its presentation is completely halfhearted."], ["IGN", "Critic", "50", "Despite a great cast of characters, J-Stars Victory Vs.+ fails to leverage their charm on or off the battlefield."], ["Digitally Downloaded", "Critic", "50", "J-Stars Victory VS is very playable. But, when you consider that the entire purpose of this game's existence is to act as fan service, the fact that it fails to offer the kind of fan service that would have had fans clamouring for it is incredibly disappointing."], ["Destructoid", "Critic", "50", "Ultimately, J-Stars Victory VS+ only succeeds as numbers on paper, the game itself being largely disappointing."], ["Arcade Sushi", "Critic", "45", "In many ways, J-Stars Victory Vs+ is reminiscent of Dragon Ball Xenoverse, with its simple brawling, flashy anime characters, and even flashier special attacks. But while DBX was, at times, more fun and impressive, it was also much glitchier and more exasperating. J-Stars Victory Vs+ is more middle-of-the-road bad— it's never especially frustrating, but it's also never especially exciting."], ["Twinfinite", "Critic", "40", "J-Stars Victory Vs+ is a game that has the look, but just couldn’t follow through on the execution."], ["Metro GameCentral", "Critic", "40", "Manga and anime fans will no doubt get some pleasure out of the game’s endless array of cameos, but viewed on its merits as a fighting game this is a clear defeat."], ["Gameblog.fr", "Critic", "40", "Many of the most famous shonen manga characters reunited in a very disappointing crossover. Technically weak and with a poor gameplay, J-Stars Victory Vs+ only appears as a fan service experience. Nothing more."], ["CD-Action", "Critic", "35", "If you’re not arguing with your friends over whether Naruto would beat Goku and you’re not praying for the fourth season of “Jojo’s Bizarre Adventure” there’s absolutely no reason for you to care about this really weak fighting game. [09/2015, p.63]"], ["ippo16", "User", "8", "i liked the characters, they have vastly differences in some cases, also the scenarios are variable, and you are force to change the character to have better chance to win, the specials attacks do not work all the time and are difficult to execute, sometimes the union from two characters are complementary for their fights."], ["Crappy", "User", "8", "Have you ever wanted to have Monkey D. Luffy beat up Naruto Uzumaki only for Chitoge Kiriaki to come slap Luffy in his face just before Bobobo-bo Bo-bobo deals the final hit? Damn-why-not even throw in Son Goku with a Kamehameha just to bring everything to an explosive end. If this sounds like your kind of thing then welcome to the world of J-Stars Victory VS+ and is easily the best way to build your dream Jump team."], ["Razgriz41", "User", "6", "I want to start by saying that I'm an anime fan and have seen at least a few episodes of most of the animes represented in this game. Now I'm not much of a fighting game fan and I only bought this game because it was anime related and on sale for like $12 on PSN. How could I go wrong?"], ["C3realkillah", "User", "9", "Great game for manga fans. Many different characters to play as satisfyingly fun combat different than most fighting games. Offers a ton of content but will have go be played extensively if you want to unlock everything. It's a very fun addicting arena battle game, if you're a fan of shonen Jump manga like naruto, bleach or dbz or if you just want a fun unique fighting game different than the arcade fighters out there you will find a lot to like about j stars victory."], ["duperghoul", "User", "9", "Played it for a total of 5 hours, and still don't have even half of every character! This game is bound to keep you busy. The arcade mode is hard, and the adventure mode is OK, but everything else is smooth. No characters are clones, and I don't see what other reviews are complaining about it being simple. There's a character that can heal himself, but if you keep missing attacks he'll get weaker. The 2 v 2 open arena battles don't seen crowded, but the versus split screen is too small, but I got used to it."], ["GrumpyDan", "User", "8", "J-Stars Victory VS + is a larger than life, over the top, arena-battling, special move extravaganza that has finally reached us in the West after being out for over a year in Japan. The previous version was released on the PlayStation 3 and the Vita, while this will be the first to grace the PS4. The release also coincides with the 45th anniversary of the “Shonen JUMP” magazine and the 20th anniversary of the “V JUMP” magazine. For those uninitiated among us, the JUMP magazine brought us Jojo’s Bizarre Adventure, Dragonball Z, Naruto and Bleach. For those of us who love any of these series and characters, you’ve probably already got this penciled in to be added to your collection. After spending a reasonable amount of time with the likes of Yusuke and Gon and Yuffy, let’s just say at this point I’m still to be convinced of its magnificence."], ["JPlayer", "User", "8", "The good:"], ["Ryuku21", "User", "8", "This is a solid anime fans dream fighting game. The story mode is fun to play through but not necessary to be played if just wanting to unlock all the characters which you will have to purchase through the in-game money which can be gained by either doing free battles or online battles."], ["Aelvir", "User", "4", "I hate this game more than ever now. Not much of an update for an American release. No new characters. I always wanted to main Hiei. I always liked Hiei in Yuyu-Hakusho!: Badass character, Badass fighting style, Badass vocie, can't get any better than Gai-shishioh. But what disappoints me the most is: Hiei's moveset was sloppily-made and CLEARLY rushed. His is the only moveset where his ground Squarechain makes him float in the air. And in the original Jstars this square chain would constantly knocked in a couple hits before breezing through the enemy and flying way past them, making the attack useless. his square~triangle, square,square~triangle and Dash square are ALL the same move. a horizontal slash to the left. same reaction hit, identical damage, his dash square just covers some more range on his left and right sides. His neutral circle attack (Ja Ou Ensatsu-ken) was only used ONCE in the show and never used again. why it was added is beyond me. And above all else his special (Ja Ou Ensatsu: Kokuryuu-ha) is the most useless piece of garbage. It has the most fakest juggling and it weak as hell and takes up so much time that you can't do a second special in one victory burst. You can absorb the dragon but to me is also useless consider the so-called enhancements aren't that much from when he takes off his bandages from his R1+X. On the other hand though, Himura Kenshin's moveset is flawless. The onyl character I'm remotely decent with is Vegeta and his normal attacks are as bland as can be. And Namco has yet to add DLC or patches. This game's only redeemign factor is having Kenshin in it. Nothing more nothing less. IT's also insulting that Namco-bandai chose to localize this and not Extreme vs full boost which definitely deserves a localization MORE than this game."], ["TheCourteJester", "User", "5", "The game, over all, is okay. A WONDERFUL idea! Horribly executed! They have so many Shonen characters inthere, but only a few of them are legit playable. For the female gamer who sometimes wishes to play as a female, your choice is Medaka or Hancock. Sure you see Chitoge on the box, but she and many others (like Allen Walker!) are only support characters. In my opinion, another should be made, but with more characters to be playable."], ["BigMatchu", "User", "10", "This game is for shonen jump anime fans only because only us,  the fans can look past the game's faults and appreciate it for the masterpiece that it is. There are loads of things to do and the game is super fun."], ["WhyThis", "User", "4", "I don't know what's going on. In fact, I played one or two matches and had to stop because I was so genuinely confused on what was happening. All I know is a bunch of grown men were screaming at me in Japanese, send help."], ["DDP", "User", "9", "This game is good fun and an honest fighting game for anime fans. If you are not a big fan you would waste your money, and maybe your money would be better invested in a naruto game or Dragon ball one, as this one is a mash up of Shonen mangas and anime.  Strongly suggest it to all Toriko's fans"], ["FilemonBR", "User", "7", "Jogo para fãs de animes da shonen jump, nao é recomendável para outras pessoas, ele é um jogo fanservice, contem erros, e gráficos ultrapassados mesmo no playstation 4"]], "platforms": ["PlayStation 4", "PlayStation 3", "PlayStation Vita"], "image_url": "http://static.metacritic.com/images/products/games/9/ed23737e9e0d1d9397327896befacccd.jpg"}
{"publisher": "Final Form Games, LLC", "genres": ["Scrolling", "Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "rating": "E10+", "title": "Jamestown+", "release_date": "Mar 17, 2015", "avg_score": "83", "summary": "Jamestown: Legend Of The Lost Colony is a neo-classical top-down shooter for up to 4 players, set on 17th-century British Colonial Mars. It features all the intensity, depth, and lovingly handcrafted pixels of a classic arcade shooter, with a modern twist: deeply-integrated cooperative gameplay.", "reviews": [["PSNStores", "Critic", "90", "In all, it’s a must-buy if you have at least one other person to play it with on a consistent basis."], ["Game Rant", "Critic", "90", "Whether played alone or with friends through local co-op, it’s hard to resist the urge to take to the skies for one more jaunt through Mars’ danger-filled atmosphere."], ["Gaming Nexus", "Critic", "88", "This is a great looking game that will remind players of the genre's heyday in the 1990s. And with dozens of items to unlock and a wide variety of weapons to shoot, Jamestown+ will keep shoot-em-up fans happy for many hours to come."], ["PlayStation LifeStyle", "Critic", "80", "If anything, it’s a fun little distraction calling back to the classic games of yesteryear. Fans of bullet hell certainly won’t be disappointed."], ["Twinfinite", "Critic", "80", "It is more than a well crafted homage though; it is a game that links the past to the present in grand fashion and is definitely something you should pick up to pass the time."], ["Push Square", "Critic", "70", "Jamestown+ has a great foundation in that it's an extremely addictive and equally challenging shmup, whether you're playing alone or with friends."], ["Crunchewy", "User", "8", "The only disappointment here is that the coop is local-only, but this is a really fun and approachable bullet-hell game with plenty of content. I never played the original so I can't comment on how it improves upon it. There is also a $1.99 DLC pack that adds 4 more ships with unique weapons and 4 additional trophies (one for each ship). Day one DLC, but at least it's cheap and the game is inexpensive too."], ["VickTorrie", "User", "9", "I never played the original on PC so everything in Jamestown+ is a brand new experience. This game is well worth its price and I will be played for months to come."], ["JamesReicosky", "User", "7", "Jamestown+ is a solid update to the original, but not one that's likely to bring in many new fans. If you loved the original's solid mechanics and surprising depth or never tried it, it's worth a shot. If you weren't a superfan, though, there's not much reason to come back."], ["YetiYeti", "User", "10", "Bin über Resogun auf das Spiel gestoßen. Ist wesentlich schwieriger, macht aber genau so süchtig.  Man muss ein bisschen üben um weiterzukommen. Leider nur lokal koop."]], "platforms": ["PlayStation 4", "PC"], "image_url": "http://static.metacritic.com/images/products/games/6/4d610e70f1b4709cf69c446347623585.jpg"}
{"publisher": "Necrophone", "genres": ["Adventure", "3D", "First-Person"], "rating": "T", "title": "Jazzpunk: Director's Cut", "release_date": "Sep 20, 2016", "avg_score": "79", "summary": "Jazzpunk is a stylized first-person adventure comedy. As the mysterious Agent Polyblank, you'll explore a variety of retro-futuristic locations, and perform all manner of gadget-driven capers. The tone of the game is cartoon cyberpunk; dense technology-infused locales, dripping with a fresh coat of colour and humour.", "reviews": [["Playstation Official Magazine Australia", "Critic", "80", "As any standup will tell you, the key to a successful joke is the execution – and Jazzpunk tees up its titters masterfully.  [December 2016, p80]"], ["PlayStation Country", "Critic", "80", "Jazzpunk is an absurd, quick-fire joke machine that holds its end of the bargain for the two-hour duration. Its sense of style remains strong and consistent throughout. There’s a lack of replay value beyond finding any gags you’ve overlooked but I can’t help but admire how different and funny this is. It’s brilliantly executed and carries a jaunty, playful tone that keeps things moving. If you’ve already ventured into the robot universe then the underwhelming multiplayer doesn’t feel like an enticing addition but we would definitely recommend newcomers checking this out. You will probably not play anything else like it."], ["Playstation Official Magazine UK", "Critic", "80", "An absurd, slapstick adventure that puts laughs above all else. Jazzpunk's a smartly penned palate-cleanser that shines all the more brightly due to the lack of decent comedy competition on PS4. [Nov 2016, p.92]"], ["Push Square", "Critic", "80", "Jazzpunk: Director's Cut is a wild ride from start to finish. If you mesh with this style of humour, it's a barrel of laughs, and the game is just downright fun to play. Your experience will only last a few hours, but that just makes sure Jazzpunk never loses steam and is always hurtling forward at a million miles an hour."], ["Gaming Age", "Critic", "75", "Jazzpunk clearly and proudly isn't a game for everyone, but for anyone who shares its developers' collective mindset, it's likely that there'll be a lot more hits than misses, and that by the end of those three hours, you'll be desperate for more."], ["Nel", "User", "6", "Jazzpunk is a really short story game, with minimal gameplay. The game takes you through several levels in which you will need to do different small task to advance. Control are good, and story is mediocre."], ["seriimac", "User", "9", "It is awesome game"], ["EwanD20", "User", "8", "Jazzpunk: Director's Cut"], ["memus", "User", "6", "It was a weird experience. At the core it's a very basic adventure game (like a 3D cardboard version of Monkey Island). It mixes Japan, spy movies, androids & pop-culture references into absurd mix. It tries to be funny, but I didn't laugh really. Some gags were gunny though: especially the one with throwing pizza & a pair of sai weapons at a turtle."]], "platforms": ["PlayStation 4", "PC"], "image_url": "http://static.metacritic.com/images/products/games/7/4832e07c05f9ff5c31627519e6bef412.jpg"}
{"publisher": "Owlchemy Labs", "genres": ["Action", "General", "Simulation", "Virtual", "Career"], "rating": "E10+", "title": "Job Simulator", "release_date": "Oct 13, 2016", "avg_score": "71", "summary": "The year is 2050. Robots cook, clean, service, and organize the world with precision and speed. Human occupations are now memories of the past; long gone are the nine-to-five jobs that ran the old world. Humans raised in our perfect automated society must not forget their ancient ancestors and history. This is why JobBot was born. JobBot created Job Simulator to teach humans what it is 'to job'. All praise to JobBot, for he is the keeper of human history. [Playstation.com]", "reviews": [["Stevivor", "Critic", "90", "Job Simulator has been one of the best and most lasting experiences with the PSVR."], ["We Got This Covered", "Critic", "90", "Job Simulator manages to make the most inane tasks fun with satisfying gameplay and witty dialogue. It's easily one of the highlights of PlayStation VR's launch and should be played by every owner who has the space to do so."], ["Digital Chumps", "Critic", "82", "Competent virtual reality creates a profound shift in the way games immerse players. Past the novelty, however, comes the demand to have a material effect on the virtual world. Being a witness is fine, but becoming a participant is better. Job Simulator, perhaps more than any other PlayStation VR launch title, neither dwells in abstracts nor resides in stasis. Its cartoony confines are genuine, and player agency, however modest, feels authentic."], ["GamingTrend", "Critic", "80", "When you create sandbox worlds, it’s very easy to leave the player to “make their own fun”, but here the mixture of intuitive controls, player agency, and tongue-in-cheek humor makes Job Simulator a must-have. While it’s a little on the short side, Job Simulator is the easiest VR title to recommend. If you have a VR headset, this game needs to be in your library."], ["ZTGD", "Critic", "80", "Job Simulator has a personality of its own, and that’s what sells the experience. Its lighthearted, extremely silly premise works wonders with its presentation and core gameplay. It’s just not something super deep, and that seems to be a fairly common issue with most of the VR games I’ve experienced so far. Yet at the same time, this was one that gave me the most chuckles and it’s one that’s just as much fun playing as it is watching someone else do these menial tasks."], ["PSX-Sense.nl", "Critic", "80", "An amazing, intuitive introduction to virtual reality that will amuse you to no end - even if the amount of job scenarios is ultimately rather unimpressive."], ["Playstation Universe", "Critic", "80", "A brief delight with satisfying gameplay and irreverent charm, Job Simulator is an early standout on PlayStation VR."], ["Destructoid", "Critic", "75", "While Job Simulator may not be my personal favorite virtual reality game, it is one of the easier titles to recommend given its intuitive design, effective comedy stylings, and broad appeal."], ["IGN", "Critic", "75", "Job Simulator's simple tasks are made fun by its absurdist sense of humor and goofy props. It'll test the limits of the PlayStation VR's motion tracking abilities by enticing you to reach for every object and device you can see, which sometimes makes things a little frustrating. But the rewards for experimentation make it well worth doing."], ["Playstation Official Magazine UK", "Critic", "70", "A genius idea guaranteed to amuse, Job Simulator offers incredible short term thrills. Alas, unfulfilled potential means you'll hand in your notice quicker than is ideal. [Dec 2016, p.95]"], ["Gameblog.fr", "Critic", "70", "Despite its lack of content, Job Simulator is one of the most exciting and fun PlayStation VR experiences."], ["Gamer.no", "Critic", "70", "Job Simulator is great, colorful and charming fun, turning even the most ordinary task into a creative and interesting VR experience. It does however grow to be slightly monotonous after a while with each job, and there are some problems here that weren't as apparent on the HTC Vive."], ["Hardcore Gamer", "Critic", "70", "Job Simulator is not best played on PSVR, but Owlchemy Labs still did an incredible job translating the game to PS4. They managed to retain the core of the experience which means folks are still set to have fun playing. It’s just a shame that the technology currently paired with PSVR (Move controller and single camera) do not allow for the complete fidelity of play required to truly make Job Simulator an amazing virtual reality experience."], ["Hobby Consolas", "Critic", "70", "It might not be a groundbreaking game, but it really achieves what it wants: entertain and even amuse with some simple mechanics."], ["Multiplayer.it", "Critic", "70", "Probably the most funny and easy experience in VR that you can show to all the non-players you know."], ["XGN", "Critic", "70", "Job Simulator is a really fun game that shows off 4 typical human jobs in a year 2050 setting. Fulfilling assignments is satisfying however the game is guiding you way too much to keep it interesting. But the humor keeps you attached and going."], ["Push Square", "Critic", "70", "The silly simulation gag has long outstayed its welcome, but Job Simulator's biting writing and intuitive gameplay means that the punchline plays one last time. Owlchemy Labs' launch title won't keep you occupied like real labour, but if work was always this entertaining then we'd never pull a sickie ever again."], ["Everyeye.it", "Critic", "65", "Instead of a real game, Job Simulator is a collection of interactive three-dimensional spaces, probably designed to represent a \"first contact\" with the world of virtual reality."], ["JeuxActu", "Critic", "55", "Job Simulator is a good VR experience, but not a real game sadly. Very fun for a few minutes, the game get very boring after a short time with it's limited content and no real objective."], ["games(TM)", "Critic", "50", "We found this version to be glitchy and often a little frustrating. [Issue#180, p.47]"], ["GameOver.gr", "Critic", "50", "The premise is there and the concept is weirdly intriguing. But in the end, this is an overpriced game with short length, various PS Move tracking issues and frigidly bad humor that is just not enough to satisfy you for more than a few hours."], ["ignore78", "User", "7", "great game! But the tracking of the headset is making the world move by its self when you standing still. The camera tracking is not good enough. but other than that, its really fun to play."], ["EmirKhorasani", "User", "10", "This sandbox is amazing. There's so much to do. There's so much fun to be had. Take the time to enjoy the world created, scour every desk drawer and every crevasse, and you will enjoy this game so thoroughly you'll be left wanting more."], ["Sinder583", "User", "8", "Fun game, But i think the price point is a little high at 39.99. lest to me it felt like the game was over fast and now just a sandbox game to mess around it. but it was a great short moment."], ["SgtPepperr", "User", "8", "One of my top 5 games on PS VR right now. It is a fun game that can offer 3-4 hours of game play if you get the very easy platinum trophy that it has. for 30 dollars that's not ideal, but compared to other VR games available right now it is decent. If this game was 10 dollars cheaper it would be a much better value. I also had  tracking issues with the move controllers once in a while and even once or twice with the VR headset, but nothing that made me sick or made the game a pain to play."], ["crazymurdock", "User", "8", "Gives about 3 hours of fun.  Once it's done, there isn't an awful lot of replay value, but it's great to show people the sense of presence you can get in VR.  5 years from now, this game will be totally irrelevant.  For now, it is definitely an experience worth having.  Tracking on hands can be a bit rubbish some times though, but that's the Move controller's fault."], ["yghtim", "User", "9", "The best first time experience for players new to hand motion. Simple yet fun with lots of possibility's. Its only a few hours but you can still enjoy the game after you have played through all of the different jobs. This is one of the best vr games for motion controls out there yet in my opinion."], ["Liquidjoker", "User", "7", "Fun game a bit pricey not much to say other than that \"Get to work\".  People having trouble with tracking have issues with their camera placement. Get yourself a 2\" Velcro strip and place 2x2\" inch squares anywhere you want to set up your camera."], ["Mac2311", "User", "8", "Great game and a lot of fun. It's great for when people come over and want to try out my VR headset, anyone can pick it up and play. The only real complaint I have is content vs price. There should be more considering the price of it, you can run through all the content in just a few hours."], ["KINGtrevor", "User", "8", "I loved this game. Its vibrant colors and easy to just pick up and play."], ["Tunk", "User", "5", "Nettes Setting, aber ziemlich langweiliges Spiel, das schnell zu echter Arbeit wird. Anstatt ein richtiges Spiel daraus zu machen, wie es z.B. in  in diversen Kochspielen funktioniert, muss man hier eine Sache nach der anderen abarbeiten."]], "platforms": ["PlayStation 4", "PC"], "image_url": "http://static.metacritic.com/images/products/games/5/0b493f5d914b84a3c161de6ba7fddbdd.jpg"}
{"publisher": "505 Games", "genres": ["Action", "Adventure", "General"], "rating": "T", "title": "Joe Dever's Lone Wolf Console Edition", "release_date": "Mar 16, 2016", "avg_score": "79", "summary": "Lone Wolf is back in video game form with a brand-new story and a deep combat system. Acclaimed author Joe Dever played an active role in the development of the game and his new narrative follows on from his classic 1980’s gamebook, shedding a new light on Lone Wolf’s world, Magnamund. The Console Edition includes all 4 acts of the story. Are you ready to write your own destiny?", "reviews": [["GameCritics", "Critic", "80", "There's a great experience to be had here... Just make sure to take the proper steps needed to avoid the mid-game difficulty spike."], ["Everyeye.it", "Critic", "80", "On Ps4, Joe Dever's Lone Wolf hasn't essentially changed from its PC version: story and style are just as solid as before. The graphics reveal the mobile origins of the game; furthermore, the game becomes less spontaneous by using a pad. However, Joe Dever's Lone Wolf sticks to its essence and still can intrigue many of those who are looking for a peculiar RPG."], ["Digitally Downloaded", "Critic", "80", "Good stuff. Coupling a downbeat, grim pulp fantasy narrative with enough alternative routes that you'll want to play this a couple of times, and throwing in a combat system that fits on the PlayStation 4 like the most comfortable glove you've ever owned, Lone Wolf finds itself comfortably at home on console, and this more than makes up for my disappointment with the iPad original release."], ["Playstation Universe", "Critic", "80", "An enchanting, choose your own path style gamebook adventure, Joe Dever’s Lone Wolf does a commendable job of capturing the spirit of the series it’s based on while imbuing the proceedings with substantial amounts of longevity and a masterful degree of presentation."], ["Vandal", "Critic", "77", "This is an original concept and, as long as you're happy spending a lot of time reading, we think it deserves a try. We've enjoyed what Joe Dever's Lone Wolf has to offer, but considering its uncommon nature, make sure you understand what the game is about before buying it."], ["stellarnomad", "User", "8", "For those of you who fondly remember the Fighting Fantasy style of gamebooks or spent time rolling characters in Dungeons and Dragons, then this release may just stir up fond feelings of nostalgia."]], "platforms": ["PlayStation 4", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/5/fc35f019144470b5cfe30b439e8d31f6.jpg"}
{"publisher": "Bandai Namco Games", "genres": ["Action", "Fighting", "3D"], "rating": "T", "title": "JoJo's Bizarre Adventure: Eyes of Heaven", "release_date": "Jun 28, 2016", "avg_score": "61", "summary": "Featuring a new two-on-two battle system, larger arenas, more characters, all the DLC previously released in Japan, and a new scenario from Hirohiko Araki’s epic series, get ready to experience the House of Joestar like never before.", "reviews": [["God is a Geek", "Critic", "85", "JoJo’s Bizarre Adventure: Eyes in Heaven features fun combat and a crazy story you’ll find hard not to get sucked into."], ["Gaming Age", "Critic", "83", "All in all, JoJo's Bizarre Adventure: Eyes of Heaven is a unique fighter, but many players might have a hard time getting into everything to enjoy it. It does have a few minor problems that may alienate some players, while serious fans of the series will jump right in and love every second."], ["Gamers' Temple", "Critic", "78", "An original story taking place after the events of All Star Battle gives all JoJo fans a new experience to enjoy."], ["GameCritics", "Critic", "75", "While I’m not familiar with the manga this game is based on and can’t speak to its fidelity as an adaptation, when taken on its own terms it’s a robust and satisfying arena brawler with almost too much story."], ["IGN Spain", "Critic", "75", "Fun and frantic but not as deep or as beautiful as we'd like it to be. Besides that, this game has been designed as a love letter to JoJos fans, anyone else will feel a little lost."], ["Atomix", "Critic", "75", "It tries to innovate, but it's a game aimed for the hardcore fans of the franchise."], ["Worth Playing", "Critic", "70", "In the end, JoJo's Bizarre Adventure: Eyes of Heaven can be divisive. The new fighting system is fine, but the lack of depth in moves, a few cumbersome commands, and bad camera make it less fun to work with than the previous title."], ["TheSixthAxis", "Critic", "70", "If you like the manga or anime though, this is a fun time."], ["SpazioGames", "Critic", "70", "JoJo's Bizarre Adventure: Eyes of Heaven differs significantly from All Star Battle. The introduction of the third dimension and the implementation of battles focused on 2v2, make the experience less complex than the previous one. Despite this, the game contains a complete and incredibly varied roster, as well as a very long-lived story mode, supervised by the same author of the manga."], ["Attack of the Fanboy", "Critic", "70", "JoJo’s Bizarre Adventure: Eyes of Heaven builds on the foundation laid by its predecessor with a completely original story by the series’ author that showcases just why fans love this series."], ["Brash Games", "Critic", "70", "It’s not without its rough edges or its share of strange design choices, but for the most part, JoJo’s Bizarre Adventure: Eyes of Heaven is a hugely enjoyable brawler that makes the most of its striking source material thanks to its great writing, beautiful cel-shaded visuals and wealth of fan-friendly content."], ["Multiplayer.it", "Critic", "69", "Eyes of Heaven tries perhaps too hard to translate the bizarre dynamics of the original work into a chaotic brawler which is kinda fun but also very frustrating to play. With no training mode or competitive/cooperative local play, you are stuck to a long story mode with tons of goodies to unlock."], ["Everyeye.it", "Critic", "66", "Quotation forthcoming."], ["Gaming Nexus", "Critic", "65", "Eyes of Heaven offers a wacky story with plenty of varying dialogue that will bring in even the most casual Jojo's Bizarre Adventure, but the gameplay is average at best that doesn't offer much substance other than making sure the button mashes connect before the opponent's does. Fans of the anime will appreciate this game, but the casual gamer will not get much out of this title."], ["LevelUp", "Critic", "65", "JoJo's Bizarre Adventure: Eyes of Heaven is a game with an overall good presentation. The graphics and music set the tone for something spectacular and formidable. Sadly though, uninspired gameplay mechanics and a very stupid artificial intelligence turn the whole experience dull. Playing with other users may help, but that does not fix the minor flaws that prevent this from being a good JoJo's game."], ["GameSpot", "Critic", "60", "Those unfamiliar with Jojo are likely to be bewildered playing Eyes of Heaven; the game pulls no punches in declaring its priorities with its thick layer of fanservice, pleasing only those who've read far into the series' three decade long run. It's an unfortunate misgiving to newcomers, but for fans, it's unequivocal bliss."], ["GameGrin", "Critic", "60", "Collecting all my favourite characters in one game and letting me mix and match them in combat is great fun, but doesn’t last - especially when I chose to stop playing the story mode halfway through due to not wanting to spoil the experience of reading the manga. The combat too is not one of CyberConnect2’s greatest offerings, with the fighting feeling far too loose and disconnected - completely the opposite of their last JoJo game, All Star Battle."], ["Digitally Downloaded", "Critic", "60", "JoJo’s Bizarre Adventure: Eyes of Heaven isn’t going to send a ripple through the video game community, but it was never intended to. As a simple little love letter to fans, it succeeds despite taking its faults and the lofty requisites to truly treasure it."], ["GameSpew", "Critic", "60", "All in all, fans of the long running series should certainly check JoJo’s Bizarre Adventure: Eyes of Heaven out as they’ll certainly find it to be a rewarding experience despite its flaws, but those looking for a more involved brawler with a wealth of features should look elsewhere."], ["High-Def Digest", "Critic", "60", "An absolutely terrific love letter to 'JoJo' that’s marred by being an extremely mediocre game. For fans of the franchise, there's enough love and care poured into this that it at least warrants a look, but for everyone else, the basic gameplay just isn't enough to make this a worthwhile package."], ["COGconnected", "Critic", "60", "Between the fighting that isn’t quite realized and the story that feels like something that could have been found on DeviantArt, I have a hard time recommending JoJo’s Bizarre Adventure: Eyes of Heaven."], ["XGN", "Critic", "60", "This is a game which is only really enjoyable for the fans. Other people will have a hard time getting the point. The game is overloaded with characters, levels and modes, but on the other hand the battles are buggy and chaotic."], ["Gameblog.fr", "Critic", "60", "Fans of the manga will be pleased with this fantastic story mode, but all the others will see the big flaws of the game: no local multiplayer mode and a disastrous online multiplayer mode."], ["Game Revolution", "Critic", "60", "Doesn’t mean I think it’s worth a full price tag purchase, but fans of the Joestars should find enjoyment in it. Everybody else, consult and test with your Bizarre Adventure-loving friend before dropping any coin on Eyes of Heaven."], ["The Games Machine", "Critic", "60", "Bandai Namco and CyberConnect2 tried really hard to create something new. Despite the good fan service, JoJo’s Bizarre Adventure: Eyes of Heaven doesn't manage to emerge from the many anime tie-ins released in these past few years. Good for a fun evening with friends, bound to be forgotten as soon as the last guest leaves the house."], ["Eurogamer Italy", "Critic", "60", "Eyes of Heaven offers lots of contents, but it isn't particularly convincing in terms of gameplay."], ["Vandal", "Critic", "60", "It's not an actual sequel of the previous title, so it's hard to compare. Still, we don't like the new formula as much as we liked the previous one, so we can only recommend this game to Jojo's fans."], ["PSX-Sense.nl", "Critic", "50", "The amount of fan service is both admirable and astonishing, but the lack of local multiplayer modes is hard to forgive. On top of that, the graphics suck and the game doesn't do anything others haven't already done before it. Conclusion: a major disappointment."], ["Push Square", "Critic", "50", "Fun for a few bouts now and then, this is a brawler that doesn't quite do the original work justice - even if its nicely crafted story mode will keep fans entertained for at least a few hours."], ["We Got This Covered", "Critic", "50", "Fans of the source material will find plenty of like as JoJo's Bizarre Adventure: Eyes of Heaven is a love letter to the series. The story mode starts off on the wrong foot, but quickly becomes a compelling experience for fans and newcomers."], ["CGMagazine", "Critic", "50", "JoJo’s Bizarre Adventure: Eyes of Heaven is a joyless, uninspired adaptation of one of manga’s most joyful, inspired titles, and one of the flattest gaming experiences of the year."], ["ZTGD", "Critic", "45", "There’s a lot of new interest and goodwill rolling JJBA’s way in the last few years and I truly wish that this was competent fighter that I could point to get the gamer crowd interested in this legendary manga/anime series. However, the shallow, uninteresting combat, boring story mode and the lack of a local multiplayer mode makes this one hard to recommend, even to the most diehard of fans."], ["Destructoid", "Critic", "45", "Simply put, we’re still looking for that definitive JoJo's game, because JoJo’s Bizarre Adventure: Eyes of Heaven isn’t it."], ["Gamer.nl", "Critic", "30", "This game is shallow and very out-dated. The source material makes it so easy to make a solid fighting game, but yet Eyes of Heaven is quite the opposite. Don't buy this game, just go for the old JoJo on PlayStation."], ["Slant Magazine", "Critic", "30", "The dialogue, merely filler between bouts, is more entertaining than the combat that's meant to be the game's focus."], ["joshcbrln", "User", "7", "It's JoJo and that's all I really wanted from it.I'm not sure how deep the combat is yet, if at all, but it's a fun brawler.Any game where you can play as a coffee flavored gum chewing dog cant be all that bad right?"], ["Metaditto", "User", "8", "Before I get into this review, let me get this out of the way. I love JoJo and will try my hardest to keep my opinion unbiased. I've been hyped for this game ever since I heard about it a few months back. The general scores for it's Japanese release were extremely positive and that only made me thirstier to play this game. When I first got it, I was surprised to see how many spoilers there were for the end of Stardust Crusaders right at the beginning of the game's story mode. I highly recommend that you catch up before you buy this. The game itself is really fun and has a fairly large roster spanning from Johnathan to Pet Shop. Speaking of Pet Shop, he is the most unbalanced character in the game. You can sit back and shoot projectiles from the air while your enemies have little to no chance of hitting you. I also was quite frustrated when I heard that there wasn't a local multiplayer mode added to this game. Another problem with this game is the online servers at this time. They were so laggy that it made the game unplayable."], ["blakfayt", "User", "8", "Eyes of Heaven is a game I've been waiting for since it was announced. I got the demo the day it was released and found myself replaying the very limited fights it gave over and over again. Put simply, this game is for fans of Jojo's Bizarre Adventure and no one else. More so than a Naruto game, Jojo's Bizarre Adventure has so many characters, so many jokes and references, that if you haven't read the manga or watched the anime, you just will not care."], ["RadioactiveSkin", "User", "4", "Eyes of Heaven was something I was very much looking forward to, especially since it has something that was grossly absent from All-Star Battle; Speedwagon. However, this game has a lot of problems. The style, while nice, seems pretty rough. The characters' lips don't really sync up with the audio, and don't even really move in a way that would match the words at all. The actually quality of the graphics is rather disappointing, and while the shadows are really nice and give it a great stylized look, the overall look seemed better on All-Star Battle. However, the main issue, and the one that is making me give it a 4, is that there is NO LOCAL MULTIPLAYER. No Co-Op or even Versus! What kind of fighting game doesn't have any sort of offline multiplayer? I've never played any sort of fighting game that doesn't support this, and the fact that the developers felt that they could omit a staple of the genre sorely upset me. Maybe the next version will allow a more sociable experience, but for now, back to All-Star Battle."], ["Bitrip", "User", "10", "The Bad: The netcode is horrendous so online multiplayer is pretty much useless and there is no local co-op to compensate. Some of the character names are changed from the anime. Only a little more than half of the entire roster can be used in story mode."], ["ALMSOUD94", "User", "6", "JoJo's Eyes of Heaven It's a open Arena fighter, It Has a lot fan service, and Fun art style, but the fighting mechanics are kinda button masher, AI Partner Aren't reliable There's no 2 Co-Op players but it has fair balanced content and unlockable, Basically if You're Fan if Jojo It Has Fun Game and Nice Fanservice, if you're not stay away from it"], ["Cerxes", "User", "6", "Jojo's Bizarre Adventure:Eyes of Heaven is a 2v2 arena brawler similar to that of J Stars Victory VS , but of only Jojo characters. Sounds amazing right? Not really. This game is a letdown for a fighting game fan, but not for a Jojo fan. This game is very perfect for a Jojo fan especially one who isn't very good at fighting games or just doesn't care about a deep battle system.  The game features team ultimate attacks as well which you can use when you've accumulate enough of your gauge to do it. Some are generic with your partner doing a generic attack combo leading into your iconic finisher move, but if your character and your partner have relations in the series then they will perform a special attack together that may be straight from the series itself or even be completely brand new as you can intermix characters from different timelines of the series. One example being that of 2 different versions of the same character having a team ultimate."], ["NZAnimeManga", "User", "7", "It's a fun JoJo game - crammed full of fanservice. I have to say though, that the combat in JJBA: All Star Battle (PS3) was a lot better (even if it did utilise stupid directional combos). The Story is alright (though  I can't really say much about it as I played it in Japanese and ~50% of it went over my head), but it is essentially good and is fresh (something I can't say a lot about anime games tbh). Love the character roster, I just wish that the combat was more flushed out and utilised specific combos like Tekken, Street Fighter or Budokai games. Ohh well... 6.5/10 game rounded up to 7/10 because I'm a JoJo lover."]], "platforms": ["PlayStation 4"], "image_url": "http://static.metacritic.com/images/products/games/4/e8e5ae53895bd874f68e0f48c01fe74e.jpg"}
{"publisher": "Thunder Lotus Games", "genres": ["Action", "General"], "rating": "T", "title": "Jotun: Valhalla Edition", "release_date": "Sep  9, 2016", "avg_score": "72", "summary": "In Jotun, you play Thora, a Norse warrior who has died an inglorious death and must face the challenges of Viking purgatory to prove herself to the Gods and enter Valhalla.", "reviews": [["Arcade Sushi", "Critic", "85", "It doesn’t always keep the hits coming constantly, but Jotun is most definitely one of the more beautiful and enjoyable adventure titles we’ve played, with enough continuing challenge to ensure that impressing the gods will be no short order."], ["GamePro Germany", "Critic", "81", "A magical journey through norse mythology and worth a look, despite some small gameplay deficits."], ["3DJuegos", "Critic", "80", "Jotun is an epic adventure game that surprise for the colossal scope of its battles and beautiful art style."], ["IGN Sweden", "Critic", "80", "Jotun: Valhalla Edition is a pretty unique experience with its blend of exploration and boss fights in a beautifully presented world."], ["GameSpot", "Critic", "80", "Jotun is a short game, and good players can probably plow through it in about 3 or 4 hours, but even with the ending behind me, I find myself dying to witness some images again and wanting to try different strategies. I want to hear Thora tell her tale again. Any good bedtime story that makes you want to hear it again right after it’s over is one for the ages."], ["God is a Geek", "Critic", "80", "Jotun offers the exploration and storytelling of Bastion, and combines it with the epic battles of Shadow of the Colossus. What’s not to like?"], ["Playstation Universe", "Critic", "75", "Supremely easy on the eyes and simple to pick up and play, Jotun’s depiction of Norse mythology is flamboyantly atmospheric. Somewhat less up to the task however, is the longevity of the game itself which leaves you craving for more beyond the relatively meagre playtime that the game offers. All the same, Jotun: Valhalla Edition manages to secure its place in the pantheon of action adventures with verve and aplomb on account of it's superb boss fights and varied mystical realms."], ["PlayStation LifeStyle", "Critic", "75", "Jotun is a great game for everything it does right, including its art and overall styling, but misses a lot of the key aspects that could make it a perfect journey to the halls of Valhalla."], ["Everyeye.it", "Critic", "75", "Quotation forthcoming."], ["IGN Spain", "Critic", "72", "A nice adventure, as it was originally on its PC version. The new features on this Valhalla Edition are not worth the wait."], ["Eurogamer Italy", "Critic", "70", "Jotun is a good game with an amazing art direction, a nice narrative and interesting boss battles, but it's partially ruined by the lack of rhythm during the exploration and the abuse of a boring backtracking. Keep an eye on it, and give your money to Thunder Lotus Games as soon as Jotun will go on sale."], ["Game Revolution", "Critic", "70", "Jotun: Valhalla Edition is a throwback to retro gaming in terms of both art style and gameplay. While the minimalist design manages to offer quite a bit of variety, the lack of combat and exploration options becomes evident rather quickly. Still, anyone interested in Norse mythology mixed with retro gaming and old-school art design will enjoy Thora's ascent into Valhalla."], ["Push Square", "Critic", "70", "The gorgeous scenery and animation combined with the amazing, authentic audio make its bosses something that should be hoarded like Fafnir's gold. Even though the gaps between bosses leave more to be desired with disappointing exploration, Thora's tale is one that manages to enter Valhalla's gates with an adequate amount of flying colours."], ["IGN Denmark", "Critic", "70", "Jotun is a stylistically impressive and complete game with great Norse imagery, interesting boss fights and solid gameplay."], ["IGN Italia", "Critic", "68", "Considering the premise and the presentation, I sincerely expected more from Thora's Odyssey: the atmosphere might be there, the overall style might be fascinating and some ideas might be interesting, but that is not enough to truly impress the gods when the core gameplay is a bit lacking and never fully satisfying."], ["TheSixthAxis", "Critic", "60", "Jotun just falls short of receiving that higher recommendation. It’s enjoyable yet clearly inconsistent, despite its great use of setting and some terrific boss fights."], ["PlayStation Country", "Critic", "60", "With a hand drawn art style which needs to be seen to be believed, Jotun plays an enjoyable game of killing Icelandic gods. Unfortunately the short playing time and lack of real replayability stop this game from reaching it’s full potential."], ["Hardcore Gamer", "Critic", "60", "Those looking to explore a lore-filled world heavily inspired by Norse mythology and packed with gorgeous hand-drawn animations will be hard-pressed to find better. But with the limited scope for the interactive aspects of both the exploration and combat, Jotun never quite reaches the heights of Valhalla, instead providing a mediocre experience that inspires as often as it bores."], ["GameCritics", "Critic", "50", "The team at Thunder Lotus is on the right track, but I hope their next effort focuses on adding more depth and intricacy to their work."], ["GamingNinja", "User", "9", "One of the best indie games ive ever played."]], "platforms": ["PlayStation 4", "PC", "Wii U", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/9/08d348cda73c07bc2ebc7c8ff6eb5608.jpg"}
{"publisher": "SCEA", "genres": ["Action", "Platformer", "3D"], "rating": "E", "title": "Journey", "release_date": "Jul 21, 2015", "avg_score": "92", "summary": "The pioneers that brought you the award-winning PlayStation Network titles flOw & Flower are back with another title that challenges traditional gaming conventions. With Journey, thatgamecompany (TGC) continues its tradition of delivering simple gameplay and accessible controls in a rich interactive environment that invites players to explore and experience emotional chords that are still uncommon in video games.", "reviews": [["Forbes", "Critic", "100", "It’s a simple remaster, but it makes a work of art all the more beautiful and immersive."], ["Game Revolution", "Critic", "100", "Playing again on the PS4 was, is, and continues to be just as remarkable as it was three years ago."], ["Digitally Downloaded", "Critic", "100", "Just as Journey is a beautiful game, it has a beautiful heart, and that makes the ending (which I won't spoil, even though you really should have experienced it by now), all the more heart wrenching, but ultimately beautiful."], ["PlayStation LifeStyle", "Critic", "100", "Journey is minimalist to allow you to fill in those gaps with your own emotion and experience — to apply your personal situation and make the story your own. It’s a simple beauty, but one that shines brightly and now has the opportunity to be played by millions more thanks to its stunning upgrade to PS4, with beautiful lighting and environments that impress."], ["PSX Extreme", "Critic", "100", "Anyway, Journey on PlayStation 4 is undoubtedly the definitive edition of an instant classic. It’s not drastically different and there really isn’t any new content, but the upgrades included in this package are noticeable and appreciated, and vault the production into the stratosphere."], ["GameSpot", "Critic", "100", "If you are returning to Journey, a higher resolution and a higher frame rate are your ostensible rewards for returning--a return that doesn't cost you anything if you already own the game on the PlayStation 3. But Journey's real rewards aren't so pedestrian. Journey offers you comfort. It gives you companionship in a lovely but forsaken world. It gives you reason to dream even when facing loss."], ["Impulsegamer", "Critic", "100", "A beautiful, emotional, minimalist journey full of wonder and heartbreak."], ["Critical Hit", "Critic", "100", "Pulling on emotional strings throughout, Journey is every bit the masterpiece on PS4 that it was on PS3."], ["Vandal", "Critic", "100", "Journey has proven again it is a unique game, an experience every player looking for something different should experience."], ["Atomix", "Critic", "100", "If you haven't played this great masterpiece, this is a great time to do it, especially with this perfect port for the PS4."], ["Attack of the Fanboy", "Critic", "100", "An already beautiful experience is made even more gorgeous on the PlayStation 4 -- Journey is a trip worth taking. It’s a bite sized adventure that you won’t soon forget."], ["Gameblog.fr", "Critic", "100", "Journey is a true masterpiece.  A sublime poetic experience in which all videogame elements combine perfectly to create an unforgettable trip. This PS4 version adds 1080p 60fps, which is significant but remains a detail as the original work stands for perfection. A splendid game forever, to put in all hands yesterday, today and tomorrow."], ["Push Square", "Critic", "100", "Journey remains one of the most cohesive titles to grace PlayStation."], ["Gaming Nexus", "Critic", "98", "Journey is masterful. It's meaningful. You won't remember the details of every journey, but every journey is unforgettable. You'll have no choice but to play it again and again."], ["Gamer.nl", "Critic", "95", "Journey is the best co-op game, most subtle storytelling and the most beautiful virtual piece of art we have seen these last ten years. The PlayStation 4 compliments that. Even though the visual optimization is small, this is a diamond that does not need a lot of cleaning."], ["NZGamer", "Critic", "95", "Journey was a masterclass in emotional design when it came out. This sharper, crisper version still carries that badge."], ["IGN Italia", "Critic", "95", "Journey is an evergreen experience that can still fascinate every gamer, coming today to PS4 in a beautiful and sleek edition powered by the high definition and the the liquid 60 frames per second."], ["3DJuegos", "Critic", "95", "Journey is captivating, beautiful and elegant."], ["LaPS4", "Critic", "94", "Journey keeps all of its audiovisual and emotional charm in PS4, with slight visual arrangements, and the feeling that you are playing a unique experience. A true gem that doesn't age."], ["ActionTrip", "Critic", "92", "The game just tosses you into a lovely dream-like experience. This experience you probably won’t forget."], ["Merlin'in Kazanı (Turkey)", "Critic", "91", "Is this just a game? I can feel this game, I can feel this journey in my heart. Great art design and an unforgettable experience."], ["games(TM)", "Critic", "90", "It’s as much a part of the PlayStation legacy as Ico is, as Shadow Of The Colossus is. Its place in PlayStation legend goes beyond its similar presentation and taps into something more sublime, something more exhilarating."], ["Playstation Official Magazine UK", "Critic", "90", "Don't expect a transformative HD remaster. [Oct 2015, p.88]"], ["4Players.de", "Critic", "90", "If you don’t know Journey, get ready to get excited. Not only because technically it is a convincing port. But more importantly because even after three years this masterpiece of reduced game design is as captivating as ever."], ["GamePro Germany", "Critic", "90", "It hasn't lost any of its fascination - but only for those who haven't played it yet."], ["Playstation Official Magazine Australia", "Critic", "90", "Still one of the indie game greats. Journey is must-play material on PS4. Wants for extras, however. [October 2015, p74]"], ["Multiplayer.it", "Critic", "90", "Another remaster for an excellent title."], ["IGN Spain", "Critic", "90", "Short but intense and especially memorable. You can not say that Journey exploit the technical capabilities of PS4, but even with those, we continue to one of those experiences that every gamer should experience once in a lifetime."], ["The Digital Fix", "Critic", "90", "The game is a spellbinding experience that really is a credit to its medium."], ["XGN", "Critic", "90", "Journey is still the amazing experience it was in 2012, with upgraded graphics. If you haven't played it yet this is a must play title to have, simply because it offers a unique experience not quite like anything else."], ["Level7.nu", "Critic", "90", "Journey is a unique experience that has not aged at all since it was\r\noriginally released on Playstation 3. On the contrary, the improved\r\ngraphics makes the experience even more immersive. This is the closest\r\nwe have come to the expression ”to play a painting”."], ["Gameplanet", "Critic", "90", "A tremendous title on PS3, Journey is even better on PS4 thanks to a better resolution, improved frame rate, and sharper textures."], ["Eurogamer Italy", "Critic", "90", "After three years, Journey is still the most emotional and powerful video game  of the PlayStation era. Just buy it, and enjoy a better life."], ["IGN", "Critic", "90", "If you missed it on PS3, do yourself a favor and experience it on PS4. If you did play on PS3, you now own it on PS4, so this minimal graphical update is an excellent excuse to revisit it."], ["Meristation", "Critic", "90", "Let's make it clear: Journey was one of the best games of the last generation, period. And now, in PlayStation 4, looks even more beautiful, so even if you played it before, you'll want to check it out again. If not: just enjoy one of the best experiences you'll play on a console."], ["Hardcore Gamer", "Critic", "90", "Those who haven’t taken the two-hour journey to the mountain top yet should stop what they’re doing and dive in. Journey really is that good."], ["The Jimquisition", "Critic", "90", "Journey’s interactive, visual, and aural elements work together, rather than fight with each other, in order to provide a flowing, seamless, influential, and utterly exhilarating experience."], ["Playstation Universe", "Critic", "90", "A great package with one brilliant game and two half-decent ones. The added extras bulk up the package nicely."], ["GamesVillage.it", "Critic", "90", "It's simply amazing how Journey can still be so intriguing and captivating after all these years. A testament that some works can really stand the test of time."], ["Game Informer", "Critic", "90", "If you judge a game solely by its complex battle systems, intricate puzzles, or branching upgrade systems, Journey is likely a disappointment. If you’re open to that often nebulous realm of how a game might elicit emotion and the artistic potential of interactive narrative, Journey is an absolute must-play."], ["Metro GameCentral", "Critic", "90", "Less is most definitely more in this beautifully understated co-op adventure, that dares you to make sense of its enigmatic voyage."], ["Hobby Consolas", "Critic", "89", "Journey for PS4 is the very same game that millions of players enjoyed on the PS3, a unique adventure that will touch your heart... but now at 1080p and 60 fps, making the experience even more enjoyable."], ["CD-Action", "Critic", "80", "It’s a disgrace not to know this game. [10/2015, p.61]"], ["JeuxActu", "Critic", "80", "While being very short, Journey on PS4 still amazes us with its reworked visuals and an even better gameplay experience. One of the classics on Playstation."], ["Slant Magazine", "Critic", "60", "With Journey, director Jenova Chen presents intimacy as a mirage in a desert and fits inclusivity into an abstracted model."], ["forcis12", "User", "10", "I've played this game countless number of times on the PS3. I will play it countless number of times on the PS4. It's rare to find a video game, especially one so short, that can evoke such deep philosophical thoughts about your own existence (no exaggerating). It's not your typical video game. It's not your typical piece of entertainment. It's not something that hemorrhages explosions, gore, or lengthy cinematic cut scenes to tell a story. There isn't even dialogue! It's a tribute to minimalism in every single way. This experience is not for everyone, but if you are an avid gamer with a hunger for a deep story and rich artistry, then it's a must."], ["lucasl1990", "User", "0", "Short boring and not as pretty or touching as described.  Bad game. not worth the cost. Literally 0 Replay value. Feels like a waste of time when done."], ["BobbyJohnson", "User", "6", "Interesting idea - walk around doing nothing. Watch the views. Enjoy the atmosphere. Also quite boring when you get to think of it. But hey, I enjoyed it for a while."], ["jdvb00", "User", "1", "i have no words to describe how bad is this game  very bad story  at the beginning  you can already imagine what is going to happen at the final and it isnt as open as people say i couldnt find a meaning that fits with the game"], ["magitekman", "User", "3", "I got it for free on ps+ and I deleted it the same day. It looks and sounds awesome but the gameplay is so boring. I finished it in under 2 hours and I'm glad I didn't have to suffer through more. The best phrase that comes to my mind is \"pretentious walking simulator\""], ["MadGear25", "User", "6", "Journey is a good indie game, with good visual, nice music, simple gameplay and unique atmosphere, but still this game is the most overhyped indie game ever"], ["Bensonzim92", "User", "9", "I had forgotten just how much this game meant to me. Journey isn't a game you play to feel exhilarated, it has heart-thumping moments sure, but that's not what its all about. Journey defines life. In the beginning there is unsure exploration of a strange world. Then you begin to learn and master your skills, experiencing jaw droppingly gorgeous moments, the world and narrative beautifully flowing together as you endure it alone or with a companion. As a mysterious history and a dedication to your future drive you forward you must overcome darkness and master the light to progress into true salvation. Does that sound too religious, probably. But Journey doesn't have to be about that, it's about you. Enjoy the music and marvel at the relaxing gameplay. It will be worth your time."], ["thecoon", "User", "6", "A decent game that challenges what a video game can be. I liked the environment, the scenery and the music. This is where the game excels, but apart from these things, it falls short in many areas I have come to expect from games. Specifically, there are no real challenges to overcome, no decisions to be made, no puzzles or mysteries to solve. In many ways this is a movie with some degree of interactivity. It is beautiful, very short and somewhat unsatisfying. At least to me."], ["houjo2000", "User", "1", "Dull and pointless sum up the game. It looks OK for an indie game, but it could have come out two game generations ago. It's short, there's no replay value and there's very little first time play value."], ["chr1so", "User", "2", "I do not understand the hype for this game. It's not challenging, you don't die, there's barely any story. It's just plain boring, and I was thankful it only went for 2 hours."], ["wouldyoukindly", "User", "1", "I like art,  story and meaning beyond just gameplay but this game is such a disappointment for me.  I don't understand why all the love it got from the critics.  There are some pretty parts but overall a dull boring game.  It tool me about 1 1/2 hours to complete and I could not wait for it to be over.  Don't buy but give it a try since it's free on PS4 this month and see if you agree."], ["Bumpster", "User", "4", "I really don't understand why this game has received such high remarks? I could only get through 20 minutes of the game before I was bored of walking through the desert doing nothing. I wish I could stick with it but It's so incredibly boring."], ["homer4president", "User", "10", "Journey is an experience that is a privilege to partake in. It evokes a range of emotions from joy and wonder to fear and heartbreak. The visuals are a sight to behold. It is simple, but not simplistic. It will make you ponder life, friendship, love, loss and triumph. Journey deserves to be experienced"], ["Gurdur", "User", "5", "Really don't understand what all the fuzz is about. This is an extremely short (2 hours), mediocre game. There is nothing out of the ordinary here, apart from that it's heavily overrated. Disappointing."], ["spesini", "User", "1", "Thank god I didn't buy this game. If I didn't get it for \"free\" (PS+) I wouldn't even buy it. But since I got it for free,  why not to try it. And I was disappointed. I don't know if I didn't get the story and the whole game or something, but it was an incredibly boring experience. And the snow section. Oh god, the snow section. That has to be the most boring and frustrating section of a video game ever. Which is kinda funny, because you can't even fail this game."], ["herrmoekl", "User", "10", "What an amazing audiovisual experience, what an incredibly talented developer! I suggest these guys should work with icelandic Band Sigur Ros, that would definitely make a great collaboration!"], ["theTRUTHson", "User", "2", "I got this game after reading all the good reviews in here and in other sites. I was really looking forward to get into it. When the credits rolled after an hour and a half I could not believe it.  I'm sorry, this isn't even a game. You just go forward, that's it. And as far as the atmosphere goes, which is what everyone is praising, I played it after beating Bloodborne, so yeah, the bar was set way too high. Boring, short, not fun."], ["baserocker", "User", "9", "If you play games with little to no emotional investment, steer clear of Journey. If you don't play games in 2 hour or less sessions, this game might not be for you. That said, Journey is a game that boils down core concepts and polishes them to make an exquisite experience. There are no mechanics or elements that feel tacked on or intrusive to the game's progression, a common issue with modern video games.  Despite its length, fulfillment is the word that best describes this game. From beginning to end, no matter what number of breakthroughs, the game will leave you satisfied with the amount you played. It never overstays its welcome, unlike my review ;D"], ["resh_aykut", "User", "10", "This is more than a game Which is so emotional and beautiful, so I have finished it in single breath, and with the same partner from at the beginning to the end. Anyway, when the credit is appeared end of the game that shows you who participate in your game, and what s your partner's psn id."], ["DYEGameBro", "User", "10", "Playing Journey back in 2012 was one of the most memorable gaming moments I had had that year. I only played it once and that was all I felt I needed to do with it as the title was such a unique storytelling experience that moved me in ways few other titles could."], ["thefishslap", "User", "3", "The game might of been better if it was finished. The graphics aren't very pretty, and the story dumber than flumber. My first time playing the game, I tried to beat the first. The PS3 wasn't a very good console choice eather because it doesnt have enought prosessing prower to handle this stupid, a better choice would of been the 3Wii S or the 3 dimensional portable. If i got to play the game i might have"], ["TSapper", "User", "2", "OK, I understand different people like different game types but it's a head-scratcher that so many people claim to like this one. It's just bad. After 20 minutes of play, I was hoping a giant sand worm would pop up and eat my character ... but my hopes were dashed; the boredom continued unabated."], ["romanontherun", "User", "10", "You may think \"oh, i could just watch it on youtube\" but you can't. It's like watching porn vs having sex. You could not know how good it is until you actually experience it."], ["Nathan1963", "User", "7", "First of all, this is a philosophical game, is not anyone will like or understand the object of the game, I finished it yesterday, I have open mind to \"different\" games like this, but I have to say that this game is not all what I expected or the media says is a masterpiece, 92 Metacritic is a lot to me, but the game has its qualities, the music, the visually beautiful and minimalist, but it's all, you pass the whole game just walking, I know the name of the game delivers his proposal, a journey, but this journey don't excite.when I finished, I came to conclusion that this game is overrated.It is not a bad game,don't deserves a 0 score,but for me don't deserve a 10,it's a totally difererente experience of any game on the market, but is not all that criticism says."], ["rodericrinehart", "User", "9", "A beautiful game with a moving story told with no dialogue and in just a scant few hours. Me, my wife, and my daughter all played it and loved it. I wish there were more games like this!"], ["wade22fan", "User", "9", "Journey is absolutely magnificent. It’s basically a “journey” through a very beautiful world full of different types of terrain and seasons and some odd creatures. You play as some type of “being” in a red robe, walking, running and flying through the enchanting world. The simplicity of Journey is what makes it unique. The only audio is music and subtle sound effects. There is absolutely no dialogue or spoken word of any kind."], ["crystalballtina", "User", "9", "Don't believe eldumloido's review, this game was free for owners of the PS3 version."], ["DrakeGarrison", "User", "9", "The pioneers that brought you the award-winning PlayStation Network titles flOw & Flower are back with another title that challenges traditional gaming conventions. With Journey, thatgamecompany (TGC) continues its tradition of delivering simple gameplay and accessible controls in a rich interactive environment that invites players to explore and experience emotional chords that are still uncommon in video games."], ["The_Garays", "User", "10", "An experience in another level, this game was made to be different."], ["epistm87", "User", "10", "The music and environments of this game are incredible. Nice and short story, Definitely it's a short game but every minute is completely enjoyable.  DO  BUY THIS GAME."], ["User3", "User", "0", "Ranks very highly on the list of most boring games I've ever played. Terrible graphics, annoying co-op and puzzles that are either babyish or impossible."], ["RealMuthaF", "User", "2", "Wow, what a f**king waste of time. This game is as boring and pointless as it is gorgeous."], ["Peeto", "User", "5", "Boring, repetitive, one of the most overrated game. It has some art, but this is simply not enough. There is no reason to buy this game, I think. I understand, why it has to be hyped, but do not get fooled."], ["lordsuarez", "User", "10", "The unreal graphics, the beautiful soundtrack, the wonderful moments that occur in co-op and the neat narrative. It's undoubtedly one of the best experiences anyone can have this generation. And to cap it off, it's currently free on PS Plus. I would recommend anyone with good headphones and a quiet room to play this game (it'll only take 2 hours of your time)."], ["madin", "User", "0", "one of the most boring games I've ever had the displeasure of completing.  people cried to this?  out of sheer boredom probably.  people were moved be this?  the only movement I received was of the bowel kind.   avoid this game at all costs if you like having fun"], ["doteweb", "User", "1", "Thiet ke, ho tro, quang cao truc tuyen, dang ky ten mien va cho thue luu tru. Tu van thiet ke theo yeu cau."], ["HuytonLayne", "User", "1", "Ever play a poor game with fantastic graphics(Crysis)?  Ever play a fantastic game with poor graphics but you go so engrossed in the game that you ignored the visuals?  This is neither."], ["Nath6349", "User", "6", "This is a nice and intriguing title with a unique gameplay. It successfully creates a story with no words."], ["KingPorky", "User", "3", "I have no words to describe how much this game is overhyped, it is barely a game to be honest, there is no challenge, no storyline and the only objective its to get to a shining point on top of a mountain, this ain't fun, and this isn't a \"work of art\" either, this is just a pathetic excuse for a game, i glad that i picked up for free, but if u payed any money on this thing, i feel bad for you, cause this is a ripoff"], ["JudasKiss12", "User", "5", "It's a decent game, but it's less than 2 hours long and offers no replayability. The gameplay is solid, albeit extremely simple, and you can tell it's been designed to be played once and put aside. Not BAD, but not great."], ["Gskyace", "User", "10", "It's about you. Journey is like a mirror, and it reflects the story with emotion of yours into the game.One of the best games I've played among hundreds titles. Keep calm and have 2 hours to try it."], ["MikeyMo", "User", "10", "I was blown away by Journey. From the blend of platforming mechanics, online cooperative play, level design, incredible and changing art direction, and possibly, best of all, the camera control and fluidity. This is one of the few games where the player can lose control of the camera be happy about it because the game does so with such grace by now providing the player with an instruction, or a new gameplay mechanic, all based around the camera doing a fluid push and focusing in another direction."], ["ChaosSS", "User", "10", "Game of the 2012 year now on PS4 and  for free to everyone who bought it on PS3. Thank you Sony! Thank you That Game Company! It's really a big present to all of us."], ["bosconian87", "User", "10", "I first played Journey on the PS3 back when it was first- released and it blew me away - That Game Company kept their promise to delight and yet not pander to anyone expecting a repeat of Flow or Flower, and delivered yet another Unmissable experience."], ["namitokiwa", "User", "10", "This is the first time I play Journey. And I must admit that this game is one of the best games ever made."], ["bmx45", "User", "10", "This game is a masterpiece. No game has left me feeling so emotional and calm. This is more than just a game it is an experience which I will never forget. Some may say it is short but I think the length is perfect for a game this minimalist. Visuals are stunning and if you like a deep, rich and engaging story- Journey is the game to play."], ["fabio77", "User", "9", "One of the best games ever now even better. If you bought it for PS3, don't have to pay for this update version. Highly recommended to everyone that loves art."], ["Artur95", "User", "8", "Definitely it's a short game but every minute is completely enjoyable. It's not about story or action, its about simple gameplay and enjoy graphics, sound, music; everything is artistic; it's a JOURNEY in which you can also meet online players randomly, i tought they were IA (PC). If you love art in games, you must buy this game."], ["MrAmazing1914", "User", "10", "I just finished journey with the same partner from beginning to end. This is truly the best gaming experience of my life. It might not have much of a story but it never needed one."], ["brockcheese", "User", "9", "A very interesting game. This is one of those games that critics say elevates the medium to art. I would have to agree. Journey is more of an experience."], ["bulletchan", "User", "10", "This game is a masterpiece. No game has left me feeling so emotional and calm. This is more than just a game it is an experience which I will never forget.  that would definitely make a great collaboration!"], ["joaopontesvaz", "User", "8", "Graphics: 8.0 Sound: 9.5 Gameplay: 8.5 Fun/Story: 8.0"], ["Lewis-Angelo", "User", "2", "aburrido hasta decir basta, al menos dura poco, pero es hora y media de tu vida que ya no vuelve"], ["STROKESs1997", "User", "2", "this game is horrible , all you do is running..."], ["Dal_ReviewedDat", "User", "9", "A Beautiful and enchanting game."], ["Kimomarudotcom", "User", "4", "I almost fell asleep playing this.  Not exciting.  Some of the positive reviews praise this game's symbolism, that it's a metaphor for something existential - whatever.  I don't get it.  It's very pretty, but it mostly plays itself.  It's like Sonic the Hedgehog."], ["SWERY_51", "User", "10", "Best indie game i ever played. It's beautiful, the soundtrack is pretty, it's a pleasure to discover. The way the coop mode works is amazing since you can't really communicate with the other one.  I have never feel that before and i have cried during the credits. Just a blast, you have to play oit if you're a so called gamer. It's, for me, a brilliant life metaphor, and the best one i've ever seen in a video game."], ["MassRelay", "User", "8", "DO NOT BUY THIS GAME."], ["L_Coops", "User", "9", "Journey is pretty amazing and it definitely stays with you as an experience even after you've finished playing. The obvious downside here though is the value for money with the game only being a 2 hour experience. I have to deduct a least 1 point for the short duration and relatively high dollar-per-hour cost."], ["Azgar5991", "User", "8", "A great game to be remember forever, for being diferent what we are used to play, nice experience. This game surprise, a diferent way to play, that make me feel happy, we get boring some times from shooter games as Call of Duty or GTAV, this one catch me because of that a diferent way to play, awsome graphics and many things to explore."], ["nonchalantgamer", "User", "9", "I missed Journey when it first came out, so when i heard it was being re-released for the PS4 this summer I was happy to be able to get a chance to play it based on all the praises it has received, and those praises were well earned."], ["Bastrix", "User", "8", "It's difficult to define Journey, it's so different from anything else. I can understand people who say it's overrated / boring, because it's so unique. Players who just play shooters / action action games might not enjoy this gameplay since it has absolutely nothing to do with most games. It won't provide the \"adrenaline\", fast paced intense action."], ["Lightf00t", "User", "10", "This is the sort of game I love.  You just won't get this sort of experience from the big software companies--they will focus on making the most profits by appealing to the unwashed masses.  Digital downloading has created an ideal environment for small developers to create imaginative titles like this, keeping the costs down via digital."], ["seaneagles", "User", "10", "When i brought this game on ps3 i was totally sucked into a game which is remarkable. Now i am playing it on ps4 and have that same buzz all over again."], ["Memulatron", "User", "10", "To quote the great and talented Christopher Walken, \"Wow. Wowie-wow-wow-wow.\""], ["GlaucioM", "User", "10", "The game is very interesting it have a good history and the graphic is cool. The proposal of game is have a good experience and with two button you can play tranquility. The sound is very nice and complete with gameplay."], ["YoloMcSwag", "User", "9", "This journey of yours may be emotional and heartbreaking like it did three years ago, but it'll always be a beautiful journey you'll never forget."], ["Vinnie0003", "User", "10", "Journey is a beautiful gaming experience, its arts in its pure form, I recommend the use of a good headset and don't let it go of the controller until you finish your experience. The simplistic concept the amazing sound and game mechanics is an achievement that I wish in most video gaming entertainment could make nowadays. Is Thatgamecompany greatest achievement so far!!!"], ["oxtygen", "User", "10", "The music and environments of this game are incredible. Nice and short story, don't expect to be playing this game for days on end. This is one of those standout independent games that flew under the radar when it came out in 2013 on the PS3. Glad to see they did a re-release."], ["Ammer1981", "User", "9", "Is it a game? Is it a piece of art? Is it new age or meditative? It is all of that plus more."], ["consolfreak1982", "User", "7", "the game would EASILY deserve a 9 -"], ["GreenMachineG", "User", "8", "Journey is a masterpiece of art and emotion, but I do not think it hit me as hard as other people. I thoroughly enjoyed it. It was great to sit down for 2 hours and play through a game start to finish and feel so much for the character in such a short amount of time. I found myself doing a lot of smiling and I felt very into the world I was travelling through. I personally however did not feel nearly the emotion a lot of others did. I do not know why, but the end didn't hit me very hard, and in fact almost felt a little anti-climactic. I was happy, but not elated. It also didn't help my play-through that the other players I came across kind of ran off and did their own things. The art style is beyond beautiful, and very appealing to the eye, and the game play is fun and simple. I would recommend this game to anyone."], ["NihiRagnarK", "User", "9", "Don't read any reviews before you enjoy the game!"], ["DragonEye1201", "User", "10", "I've heard of Journey before but I didn't know anything about it. So this is a review about the game which I played for the first time on ps4 and NOT a review about how they changed it when it came on ps4."], ["ffabrao", "User", "1", "I decided to give this game a try after I saw all the positive reviews."], ["mcpop", "User", "3", "ok ,ok ,ok e uma obra de arte mas poxa vida eles tiraram o essencial de um game a dificuldade todo game desde aqueles tempos do atari tem que te pelo menos um pouco de dificuldade e nesse game vc não tem nenhum inimigo pra enfrentar  e o pior de tudo vc não tem como morrer e com isso vc tbm fica sem qualquer um obstaculo eles fizeram uma obra de arte e não um jogo e tenho de avaliar iso como um jogo não é , resumindo:obra de arte : 9.8 e game : 2.0"], ["NinjaLandGameYT", "User", "9", "Journey - Hero's life Arc"], ["moisaras", "User", "10", "Anyone who gave this game a score less than 10 must have not played it yet."], ["guille_rv", "User", "0", "This is not a game. It is a dull and boring 90 minute film. I do not understand the hype. There is no challenge, no story, nothing... Thank god I did not pay for it. I would not recommend it even for Play Station Plus players who can get it for free this month."], ["Gunther123", "User", "0", "Most overrated game ever. Seriously, people's standards have dropped so low that we accept a boring POS game where you run around in a desert collecting scarfs. Yeah I'm glad I wasted money on this junk."], ["Ghoster", "User", "0", "Stopped playing at tutorial. This game looks too boring to be true. Maybe later there is some sense, but from start it's boring you will fall asleep..."], ["AnonymousPal", "User", "8", "Great game, really enjoyed it on the PS4. Beautiful, immersive, graphics, music and game play. I would have given it a 9 or 10 if it had been an hour or two more of content."], ["GamingDrake", "User", "2", "Simply put if you like walking simulators and pretty visuals then you will like this game because there is nothing else to it. The only story is by what you see, the only gameplay is walk and jump that is it. There is zero reason to play this game a second time. Its not a game its an un interactive movie"], ["evilfrog", "User", "0", "I can't believe how over hyped this slow walking simulator is. incredibly boring. couldn't stand playing it for more than 10 minuets. people talk about art and inspiration because on one sunset scene, so what , other games like the witcher3 and MGS5 look 1000 times better . this garbage is aimed at hipsters who pretend to be artistic and try to find meaning behind boring nonsense ."], ["ladyCareyes", "User", "9", "Journey is the kind of game that teaches you the essentials of beauty. A few express such deep feelings!"], ["LordMorgoth", "User", "10", "This is a twenty dollar two hour game with little replay value. That said, BUY IT! Buy the console for this game alone if you have to! This masterpiece is a necessity for any PS4 owner, even if you already played it on PS3. If you know one of those people who dismisses gaming as a gory, dumb, entertainment medium for sociopaths, show them this game and they will respect it for the art form that it is. In conclusion, play Journey. Go! Now! If you already have, play it again!"], ["DapperNapkin", "User", "10", "Looking to change up the pace? Start Journey, turn up the ambience, and let yourself go."], ["DartMaul", "User", "5", "The game is good. But who needed a remastered? If you want to play all PS3 game, then you have to buy the AMAZING PS3... I bought the PS4 and all I got is replaying the indies that were on the PS3... That's not cool at all.."], ["jwewan", "User", "1", "I have played this game on playstation 4 and 3 and I don't know why is getting so much positive stuff! It's not that good its only like 2 hours long and at times it can be really boring!"], ["Turbodowg", "User", "9", "When I first played Journey on the PS3, I couldn't get into it. I didn't get the point. It felt slow and unnecessary. So I gave it a poor review and moved on. It was free on PS+ for the PS4 last year, so I downloaded it and kept it tucked away in the games library, until after completing Nier Automata and needed something to fill the gap between the next big game."], ["YourMumWashes", "User", "1", "This is barely a game- except walking and jumping it has no other gameplay mechanics, no character progression, no puzzles, no fights, no decision making or dialogues, nothing."], ["CoNn3r_B", "User", "5", "Journey can be summed up in one sentence \"Ohh look how pretty it is.\""], ["pelaloco", "User", "6", "Acabo de jugar este juego en PS4... mi Dios que aburrido... me enganche por tanto comentario positivo y decidí realizar \"el Viaje por 20 dolares...\" que arrepentido que estoy, lineal, lento, aburrido y hasta tonto... sonido perfecto, gráficos bonitos pero el juego es muy muy aburrido, sin desafío de nada, un viaje a lo \"desconocido\".... jajajaja dejen de hacerse los cultos y sabiondos porque este juego es muy maloooooooooooo!!! ya se, ya se, soy un bruto ignorante que no entendió donde estaba la magia.. bueno si yo no lo entendí que alguien me explique la historia y cual es la idea general del juego (no la pavada de que es una experiencia personal y de eso trata el juego)"], ["MustafaTouny", "User", "6", "I'm totally disappointed !"], ["bobbsyw", "User", "8", "Very simple, very beautiful, and very well made. It's also very short, but that's a minor complaint for a game that you can pick up for a few quid. Well worth a few hours of you time."], ["mpa", "User", "10", "Un pequeño viaje lleno de pequeñas escenas en donde se engrandece el sentido de la exploración de un pequeño mundo. Lo grande de este juego está en el marco sentimental, y en como rompe esa barrera entre juego y jugador, al contar con controles tan básicos y sencillos que todo lo que hagas en el juego no es más que una interacción directa de lo que haces tu."], ["Gwyndolin", "User", "9", "As much as I loved this game, I could not give it a 10."], ["I_zakharov", "User", "10", "Браво Создателям! Язык не поворачивается назвать этих людей разработчиками )). За последнее время я так устал от всех этих ААА открытых миров, от невероятных масштабов современных игр. Journey проходится за 3-4 часа, но остаётся в памяти надолго. Видеоигры как искусство - веяние отчётливое, но далеко не всем студиям по силам забраться к вам в душу. Спасибо!"], ["Zidane_Mina", "User", "10", "Journey sure lives by its name. This is more of an insight to many things spiritual and human than it is a game. You wont find bosses, neither platforming sections or many of those long held videogames tropes, and that would surely turn some people off, regardless, Journey is an unique experience in the media, and being unique nowadays in this industry is a landmarking achievement. By the end, and if you like these sort of experiences, as a gamer you won't know if you finished Journey, or Journey finished you, and no many amount of games can claim such a feat."], ["ombranox", "User", "7", "Don't get me wrong, I love Journey. I really do. But this was a weak port. There's a visual downgrade (somehow...) from PS3 to the PS4 version. Nothing is as detailed, vibrant, or shiny in this version. And that is REALLY disappointing to me. The underlying game is basically the same, but it still can't hold up against the original version."], ["Golden-Chicken", "User", "10", "This game is simply amazing! One of the best games ever made. Also a technical achievement. By far the prettiest looking indie game ever made too. And it's been 4 years. (already)"], ["Echoes", "User", "10", "Amazing experience, a piece of visual and musical art, was almost crying at the end, enough said!"], ["ITZZZPERRY", "User", "10", "Journey is unlike anything I have ever played. This is the first game, that I can honestly say, moved me. It tells a beautiful story, without saying a single word. I loved how it didn't teach me how to do anything, making this one of the best games ever made."], ["fijiboy", "User", "10", "journey is a puzzle platformer, and as the name implies, its about a journey that the player goes on for reasons that aren't immediately clear. The game really focuses on making the puzzles in the game add context to the world and story, favoring visual storytelling over a narrative. The game does an incredible job at evoking emotions through the way you interact with the world and other players you may, or may not see in the game as they go on their own journey. As I progressed through the game, I found myself so in the moment all the way through and I didn't want to stop playing, and when I finally got to the end, I was almost sad that it was over. This game is the embodiment of the expression, \"its about the journey, not the destination.\" an expression that people may or may not agree on depending on your view on life, but after playing this game, I'm sure you will believe it. there are lots of games that have gotten me to tear up a little bit out of sadness, but very few have ever got me to shed tears of joy. This game does everything it sets out to do perfectly without a single flaw in my eye. for those looking for a challenge or steller gameplay, you wont find it here. For those looking for a meaningful and unforgettable experience, play it. not to say the game play isn't good, it adds a lot to the game, very relaxing and feels very natural, but its not the reason the game is so good. The reason this game is so great is because of how well it evokes emotions with such a simple story and game mechanics, relying on its visuals and the context of the player's role within the world. If you enjoy this game as much as I do for these reason's I would highly suggest playing other games like shadow of the colossus and Ico on playstaion 2 or the ported version of these games on playstation 3. I cannot praise this game enough for being so simple and yet leaving such a huge impact on me. I don't think everyone is going to necessarily get what I got out of this game, because the enjoyment of this game is completely based on how much the game resonates with you. If the game doesn't speak to you then all your left with is the gameplay which is fun and relaxing but in itself nothing really special. This isn't really a flaw, because it is pretty clear that this game was meant to be looked at as a piece of art. Even though the Mona Lisa is undeniably one of the greatest paintings in the world, it literally means nothing to me and that's fine, if this game means nothing to you that's also fine, but you cant deny that it is one of the most beautiful games of the last generation of consoles."], ["Dandanger", "User", "9", "So I've seen the term \"walking simulator\" being thrown around quite a bit primarily concerning games with minimalist game design. The thing is there are games that engage you enough with the gameplay as well as story, and this is one of the only ones that actually succeed at doing so."], ["Nachipants", "User", "10", "Only managed to pick this game up recently but I have to say I'm totally blown away by it. This game perfectly captures how attached you can get to characters in the game that utter nothing more than just sounds. The vast open world that goes from peace and fun to dark and scary is just amazing. The multiplayer is something else. Whether you meet a stranger that helps you complete certain tasks or you helping another is just something that doesn't get old. I highly recommend it and just can't stop playing it over and over again"], ["hoppypoppy1", "User", "10", "Beautiful, beautiful game! Truly a perfect work of art! I read a review that talked about how this game is boring and all you do is walk on sand. So I guess this game is not for shallow, uneducated, or ignorant people. It touches on philosophy, spirituality, and beauty! It was beautiful in 2012 and is beautiful now. Definitely worth the $15 bucks on PS Store!"], ["Termin8ter", "User", "9", "Beautiful soundtrack, breathtaking art style and visuals. Even though the plot of this short game is very mysterious and definitely requires some digging to piece together, the sheer experience that this game delivers without a single line of spoken dialogue (A lot like Brothers, actually) is incredible and needs to be praised. Buy this game, or at the very least rent it. You won't regret it."], ["Mossy087", "User", "5", "I just don't see a point in playing this game. It's boring! The graphics are good and It was pretty optimized for the ps3, but the graphics doesn't really stand out on the ps4. The game is pretty unique and I assume that's what people see in the game, but for me it wasn't really good even though I bought in on the ps4 and ps3, but it was unique."], ["Colaflare", "User", "10", "Short games rarely warrant full marks or raving reviews, and you'll probably read that this game is something you have to experience to fully understand why subtle gameplay and well executed sound design led this to win several game of the year awards - it is precisely that. An experience, and it shocked people that a video game can inspire strange reactions and emotions. A lot of this is subjective, but Journey has demonstrated that gaming as a legitimate artform can unravel emotions without a need for strict narrative or complex gameplay"], ["jjsalas", "User", "10", "This game is a masterpiece, period. It's, probably, the most beautiful game experience ever created. There is nothing compare today to Journey, it's more than a game, it's art."], ["M7mdatta", "User", "10", "this is the most beautiful and gorgeous i'll ever play in my entire life and not just a walking simulator as most people assume. please do yourself a favor and play it !"], ["itrain", "User", "5", "After the first couple of playthroughs of Journey the magic starts to wear away, the PS4 port of the game is slightly a breath of new air, not necessarily better, just different. The PS3 potential was seen through Journey when it came out and that was what made the relevance so much higher, however bringing it to PS4 the amazing visuals is well...expected. This is nothing special from the original, if you already own it for PS3, just play through that copy again. This was a strange move for the company to bring when it favorably could have been a sequel to Journey. The port generation is getting old to me, polishing up a Greatest Hits game that you may buy for $19.99 or lower and charging double is just bad business. Please do what Tearaway did, we loved Tearaway, they created a sequel...If Tearaway was ported to PS4 it would have been just the same...which doesn't exactly make my wallet shoot open. Journey is a very fun, amazing visual adventure, I am not rating the original PS3 version a 5/10, this is purely the port to PS4 and graded for the reasons I listed above."], ["ilushka", "User", "3", "Relaxing game. But only for 2 hours. Simple gameplay, not differently. Price of this game is $0. Good that sony give us it on ps plus, the game is not worth a penny."], ["Obomrapaz", "User", "9", "Os Gráficos podem não ser o pico do game além do mais ele é apenas uma remasterização, mas ele ainda mostra a mesma identidade. Eu achei que a adaptação para o ps4 não poderia ser melhor para um game como esse."], ["mrmustard", "User", "7", "Definitely worth a play but way too short - finished it in around 2 hours and took my time. Simple but satisfying to explore with diverse landscapes and no UI. Not much else to it. Cool game"], ["SuperDuck23", "User", "10", "Following on from Flow and Flower, it is clear that thatgamecompany have learnt to utilise what was good about their games because Journey is absolutely fantastic. It's a masterful combination of gameplay, art, music, storytelling and pure emotion that should be recommended to everyone."], ["Jarbear28", "User", "10", "This game changed my life. I couldn't stop thinking about the detail and the symbolism of the game for weeks. A game has never made me feel this way before. I will play it again and again. My children will play it again and again. A must play, and a must own. I would recommend a PS4 just for this game."], ["Grant_Mackin", "User", "10", "Why are you still looking at reviews? GET THIS GAME ALREADY!"], ["Ryudo1986", "User", "7", "What made Journey for me was essentially that, the 'Journey' itself. I had issues with other players basically messing about and not following the direction of the game so I had a much better experience following my own path. The landscapes and environments are simply stunning, Journey wasn't a thought provoking social bonding experience for me but it was a beautiful and fresh game to play."], ["Gamer2068", "User", "10", "I came across this game without knowing anything about it.  So glad I did. It was powerful and moving. It made me discover a new genre of games I didn't know much about. I recommend good headphones or stereo, dark room and no distractions in the room."], ["Sheep_198", "User", "5", "Average game.  Deleted after 2 play throughs.  World is not as pretty, not details to look at, not an artwork like Bloodborn.  Co-op not as good as Bloodborne.  Story is short and simple, nothing to reflect or ponder on, just plain common sense.  But it does gives chill after first complete through.  No Replayability, nothing exciting after test out the game.  Feels like a rip off after this short game, paid for nothing."], ["dypsomaniart", "User", "10", "after grinding away on metal gear phantom pain for a week, i needed a break. Thought I'd try this game and it was an absolute surprise pleasure. A totally enjoyable way to spend a saturday afternoon, I highly recommend it to anyone looking for a pleasurable experience from gaming."], ["Xinra68", "User", "9", "Journey is one of the most interesting games I've played on the PS4. It has a quieting and somber atmosphere that also bodes mystery, and a bit of sadness along the way. The music and game mechanics made finishing the story one of the most memorable of my gaming experience. I loved immersing myself into this fantasy realm, and learning the secrets of it as I ventured toward the mountain of light. While this game is very short, I found myself playing it again to experience the surreal & emotional journey."], ["EdMTC", "User", "10", "Lovely, beautiful, relaxing game. I met another player early in the game and we played together through the whole thing; really epic! I recommend Journey to anyone =)"], ["CriticsCave", "User", "10", "I just completed Journey and I am in shivers. No game has ever been so beautiful and full of meaning. ThatGameConpany is on a journey to huge success, and the step up from flower to journey suggests amazing things for them in the future. Fantastic game."], ["Elvis_Llama", "User", "9", "I generally like artistic games, and I did like Journey...just not as much as I thought I would.  Maybe I built it up in my head too much.  That being said, it is a beautiful game.  The true beauty of the game comes after you beat it, when you start to think, \"what was that?\"  I would really recommend reading what some theories on it - especially the \"dying/death\" one."], ["chillaxer", "User", "8", "I don’t even think this counts as a “game”. After 5 minutes I thought it was complete garbage. I decided to play it through though as I knew it was a short game. After I was done, I wanted to play it again. The aspect of meeting a “companion” and journeying together is an interesting concept."], ["ChrissyBoy6661", "User", "9", "I was watching a let's play of the game, and it looked phenomenal. I clicked off the video as to avoid spoiling it, I glanced at IGN's review, bought the game & don't regret it. On my journey I slowly encountered players, eventually becoming four members strong. We explored together, and went on to complete the game. Truly, an entrancing experience, with a beautiful visual appeal and some of the most meaningful multiplayer, though the game ended in a very short time, but I think it was worth it."], ["njanik4721", "User", "10", "So I have wanted to play this game for a long time, but I waited, I have seen it on sale countless times, but I waited, finally I picked it up when it was free for ps plus, and I am honestly sorry I waited so long. Journey is without a doubt the most beautiful gaming experience of my life"], ["ergonomicoT2000", "User", "9", "Got it on the ps4 summer special and its an incredible game. They managed to condense a dream in a videogame allowing you to fly just to enjoy the exploration and the discovery. Amazing game"], ["Fostero1993", "User", "8", "Beautiful game with soul. Journey is the original of its kind.Playing in this game is very chilling and you can feel a unique atmosphere in this game. Minus of this game is very short time to complete the game."], ["nico101510", "User", "10", "Journey is an absolute masterpiece of a video game.  It may be short, but it is by far the most beautiful game I've ever played. An incredible soundtrack that will leave you in awe, outstanding graphics and views, simple yet immersive gameplay; Journey is not something you want to miss."], ["ramayan", "User", "9", "Loved it. The game is beautiful, serene, and invokes so many emotions in me i didn't even know i had. Only gripe was that it was too short, but again, great for replay ability."], ["ConnorR", "User", "8", "79/100"], ["likevin96", "User", "8", "Completion: Finished once"], ["angraholyland", "User", "10", "A masterpiece. If you are looking for a immersive experience this is your game. Lovable soundtrack and excellent graphics. One of the most enjoyable game of all time."], ["BlakDak666", "User", "9", "Journey is an experience that few games can match when it comes to emotional gravitas and feeling. It's not a hard game, a beat-em up, or anything that defines a more violent construction of what gamers see in triple-AAA titles, but rather a deep philosophical trip that allows players to develop their own ideas on the game. Anyone can play this game with a universal system of how it plays out, tells its story and adds a co-op system that never intoxicates players with chatting. Despite its 2-3 hour time, It still nails the artistic style, music and emotions that still put itself on a pedestal for how art games shine even above conventional ones."], ["DanBenevenuto", "User", "8", "Journey has a mystery on its gameplay. You certainly will love this game, Journey has nice graphics, the soundtrack is amazing, the map is large. It's a short game, but Journey is absolutely one of the best ps4 games ever !"], ["Panzidane", "User", "10", "Ow... Now I remembered the first time I have played it. Magical... just magical. This game is beautiful, and can get your attention. I strong agree this is the best PS3 game, and one of the bests of PS4. Just play and see it."], ["Hunterrified", "User", "9", "Fantastic game with astounding visuals and a unique implementation of multiplayer components."], ["DPonce98", "User", "9", "This is game is simply breathtaking. The visuals and musical pieces are perfect, it sets up the mood that some parts of the game gave me goosebumps. There are no texts or narrations to tell the story. However, it is told through art that are scattered in levels and meditation sections. Maybe that is why my interpretation of the story is still scrambled. And for that I am giving this the highest 9/10!"], ["siphus007", "User", "10", "I knew this game existed and was out there... But finally stumbling upon this on the PS4, it became 1 of the only games I've played that was somewhat life-changing. The less you know the better. Try it some day. Play it straight through if you can. Very memorable, and one of my favorites of all time."], ["Rustaman", "User", "10", "A fantastic mix of different emotions, unusual NSA, unlike each other levels, each with its own atmosphere, a magnificent realization of desert and sand, enchanting music, which fits perfectly into what is happening on the screen. It's not just a game - it's upscale, professionally created artwork! The only disadvantage of this masterpiece, unfortunately, fleeting.."], ["twinky4746", "User", "10", "Journey: is like... uh... ok for example Journey is like a piece of art work, you study it, it looks really well made, captures your eye, and you move on. I'm not too sure what to think of Journey, it feels like an adventure that you experience when you get to your final destination. It took me 1 full hour to get to the final destination and I thought there was going to be more to it but it leaves me hanging \"what kind of game is this?\" honestly your going to have to play this game for your self because I'm not too sure what Journey is about. Though it feels like that's the point of this game, a Journey you experience. This is something that I thought nothing In the beginning, but incredible at the end..."], ["memus", "User", "8", "The game is visually and aesthetically stunning. All this single tint colors work perfect. Also, I like the general arc of the story and the way they incorporated companions (it can be frustrating sometimes due to lack of communication, but the point devs are trying to make is cool)."], ["MerodeTalks", "User", "6", "It's very hard to give a rating to this game. The thing is, it's not much of a game. You could try to categorize it as a puzzle game but it's not hard to notice that developers cared more about it's presentation and story (or rather its moral). You really have to approach it as a game-like experience."], ["Spyros_spy", "User", "7", "It's a good game overall. Nice remaster, graphics look stunning and music too. Apart from that the game is too small for it's original price (I got it about 5 euros from ps store at a discount), doesn't offer anything interesting (my opinion) and can be confusing at the beginning. There is no menu, you can't pause the game while your character is sliding about. I would only recommend this game to people that want to play a game late at night that doesn't require much brain or thinking or scare them and before their sleep."], ["Kaprawiec", "User", "5", "I actually dont know what I think about this game... It has nice graphics and mechanics, sand looks great, the setting is awesome. And the game is about...journey to where exactly? I didn't quite get it... Only try this if its free, otherwise You may be left just like me - wondering about what was that all about?"], ["Vzhik", "User", "7", "Красиво, расслабляюще, но историей проникаешься как-то слабо. Ожидал большего погружения."], ["Morshlac", "User", "5", "I was on a forum where this was pretty much described as an awesome life changing experiance...wtf! Journey is okay, yes I know life is a struggle where people fade in and out and die...I didn't need a very short lame platformer to tell me that. OK so  its got some nice scenery and was fun to play through once. Still decidedly average in my view. It irks me that a game like this can be rated so highly with the limited play time or value you get out of it.."], ["SeanMasters", "User", "5", "2 horas caminhando na areia em visuais exuberantes, enquanto se imagina uma história. Duas horas depois, você pode colocar um jogo no seu PS4 e se desafiar."], ["t0mmyg", "User", "7", "Journey is more interactive art than a game. You don't really have any real challenge and the gameplay is simplistic. It does however have an outstanding art style and soundtrack. It's brief but poignant and somehow creates and emotional impact, especially when adventuring with a random co-op player."], ["Nel", "User", "7", "Great game, confusing at first, but once you get a hang of it you will start to understand it more and more. SCEA did a good job with the design, and the graphics are really good."], ["KafkaStoleMyBik", "User", "7", "Such a brilliant and emotional game, marred only by crashes. The soundtrack, graphics, and gameplay are fantastic, and you'll definitely want to replay it as soon as you finish. The addition of multiplayer is surprisingly fun, especially during the later levels."], ["MasterRiley", "User", "10", "Journey delivers an incredible experience with beautiful music and art design. If you are looking for a game to immerse you in a jaw dropping world that is both magical yet horrifying at the same time, Journey is for you."], ["Man-Rata", "User", "7", "Good:"], ["vgm", "User", "7", "This game has beautiful visuals and sublime soundtrack with a story that is open to interpretation. Unfortunately, I didn't have much interaction with a couple of players that came across during my play through, which I think can change the whole experience. Overall it's a game that has been worth experiencing it but that I doubt I'll replay or remember in a long time."], ["Skepller", "User", "10", "Not much to say here, the game is nearly perfect! The graphics are awesome, the soundtrack is (if not the best), one of the best ones i've ever had the joy of listening! The game is a MUST HAVE for PS4 owners that like good games! Even though the game has no dialog at all, the lore is surprisingly touching, can't recommend it more!"], ["Jonttuzuu", "User", "9", "A very enjoyable and beautiful game, and something new you don't see that much. The game is defiently replayable for few times, and its enjoyable every single time. Though the game is only about 3h, but the gameplay makes up for it."], ["aliasalias", "User", "10", "Journey is by far the best game that I have ever played.  Never before has a game given me such a strong emotional response and attachment than Journey has.  The graphics and music are stunning, the game mechanics are fluid and fun (especially the flying aspect of the game).  But more so than that, what really draws me back to Journey week after week is the fact that you make an emotional connection with other players.  It is very relaxing to play Journey after a long work day, and to be able to help out or travel along with an anonymous companion.  I've purchased triple A titles and spent close to $50 on other PS4 games before, but none of them captivated me as much as Journey did, and I still continue to play Journey even after a year of owning it."], ["Zvezdochet", "User", "7", "Эммм... ну для любителей фантасмагорическую ерунды, с нотками недосказанности(хотя какие нотки, тут кроме того, что эта «хрень» бегает и парит вообще ничего не ясно) будет самое то. А всем остальным тут ловить вообще нечего! Тут даже бронза выбивается за то, что зашёл снова через неделю)))) видимомало кто рискует это делать вновь! А так обычная адвенчура ( или как ее там?). Спокойно можно пройти мимо! Плюс ещё очень короткая."], ["Emrys89", "User", "9", "This is the best  game ever. A mist have. The gameplay is easy and the atmosphere wonderful as you play it."], ["raskin_oleg", "User", "9", "Great, beautiful game, but too short... Devs can create for 2-3 evening duration."]], "platforms": ["PlayStation 4", "PlayStation 3"], "image_url": "http://static.metacritic.com/images/products/games/0/388aa7c17cfd4e981e4fa4f81efc52ae.jpg"}
{"publisher": "Jamit Games", "genres": ["Miscellaneous", "Party / Minigame"], "rating": "E", "title": "Jump Stars", "release_date": "Jun  6, 2017", "avg_score": "55", "summary": "A bonkers new local multiplayer party game which pits player against player in a bizarre, violent game show as they collectively compete to save their skins. [Playstation.com]", "reviews": [["Video Chums", "Critic", "70", "Jump Stars is a mostly enjoyable multiplayer party game with simple yet fun single-screen 2D platforming gameplay within a variety of stages. That being said, the dual nature of its premise will make most gamers scratch their heads."], ["PlayStation LifeStyle", "Critic", "65", "Jump Stars is a nice, cheap diversion if you have a couple of friends to play with. Unlike almost every other game out there, you cannot play single player. There are also just a handful of game modes to choose from. It’s a party game you might come back to when the mood strikes. The fake game show announcer with dual personalities injects some, well, personality into the game, and the characters are amusing to play with. There’s not a ton of content, and multiplayer is required, but $9.99 ($7.99 for PlayStation Plus members) seems like a fair asking price for Jump Stars."], ["Playstation Official Magazine UK", "Critic", "50", "As far as party games with mad quiz show hosts go. Jump Stars is serviceable, but there's better out there. [Aug 2017, p.86]"], ["God is a Geek", "Critic", "40", "A quiz game that does little to hold your attention after the initial impressions."]], "platforms": ["PlayStation 4", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/2/fdebee44c387d916dca3e2436d50ed6f.jpg"}
{"publisher": "Square Enix", "genres": ["Sci-Fi", "Action Adventure", "Open-World"], "rating": "M", "title": "Just Cause 3", "release_date": "Dec  1, 2015", "avg_score": "73", "summary": "Set in the bucolic Mediterranean island republic of Medici, a land crumbling under the brutal rule of General Di Ravello, you assume control of franchise's hero Rico Rodriguez, a man on a mission to liberate his homeland and the people of Medici...by any means necessary. With over four hundred square miles of utter freedom from sky to seabed and a massive arsenal of weaponry, gadgets and vehicles, prepare to unleash chaos in the most creative and explosive ways you can dream up.", "reviews": [["Forbes", "Critic", "95", "Let’s try a metaphor and imagine games as drinks. Fallout 4 is a fine wine, aged, complex, and evolving, likely better with a bit of wait. Bloodborne is a single malt Scotch — dense, overwhelming and rarified. Destiny might be a well made cocktail — a bit trendy, probably too expensive, but eminently satisfying and possessed of a certain technical skill. Just Cause 3 is a Miller High Life. It might not tick those other boxes of quality that those other drinks manage, but damn if I’d have it any other way."], ["CGMagazine", "Critic", "95", "Just Cause 3 is a joy to play and is easily a candidate for game of the year."], ["GamingTrend", "Critic", "90", "Its main goal from the outset seems to focus on raising the player’s blood pressure and enthralling them with the action. While it achieves that feeling for a majority of the game, the console version suffers from some serious frame rate and loading issues that bog down their experiences."], ["Twinfinite", "Critic", "90", "Just Cause 3 is a great game plagued by two issues that constantly rear their ugly heads to break up the fun. The unbearable load times and incessant login attempts can often times sap the energy right out of the excitement. Luckily, just a few seconds with the game can bring the life right back for those willing to deal with the constant frustration."], ["Playstation Universe", "Critic", "90", "Filled with action, Just Cause 3 offers a massive and realized world with engrossing scenes inspired by works like those from Michael Bay. Skill development aside, this sequel delivers on all fronts."], ["NZGamer", "Critic", "87", "When you’re not waiting for it to load, Just Cause 3 is an incredibly fun game. Crisp visuals and a clever soundtrack bring all the explosions to life. Even with the violence and destruction, it manages to maintain a lighter tone than the Far Cry games, without sliding into the outright silliness of Saints Row. But, it’s still silly enough."], ["LaPS4", "Critic", "85", "This game doesn’t innovate much over its predecessors but it has an interesting component of creative and open action. Just Cause 3 is one of those sandboxes that, in the long term and when you have played many hours, is not fun, it's simple entertainment. Avalanche Studio gets one of the most agile, rapid and interactive open worlds, it’s a pure explosion of gameplay."], ["Impulsegamer", "Critic", "82", "Just Cause 3 is over-the-top, dumb fun, and incredibly beautiful to boot—when it all eventually loads, of course."], ["Brash Games", "Critic", "80", "Just Cause 3 is one of the most satisfying experiences of 2015."], ["DarkStation", "Critic", "80", "Like an action movie marathon, the busy energy of it can become wearying, but in most ways, Just Cause 3 is, quite literally, a blast."], ["Gaming Nexus", "Critic", "80", "Just Cause 3 gets away with more stunts and high-flying hijinks that, let’s be honest, even Hollywood can’t get away with much anymore. Come for the explosions, but stay for the, well, stay for even more explosions."], ["Toronto Sun", "Critic", "80", "Just Cause 3 doesn’t hold too many surprises, particularly if you’re familiar with the previous titles in the series. But it offers an almost unlimited number of ways to create your own flavour of mayhem, and is a source of constant “did you just SEE that?” moments. If the next Michael Bay movie features a dude hanging upside from a helicopter while blowing up a bridge with a missile launcher, you’ll know where it came from."], ["PlayStation LifeStyle", "Critic", "80", "The game isn’t meant to be deep or perplexing; it’s meant to be fun and tap into that inner madman who just wants to make things go boom, and Just Cause 3 succeeds in doing just that."], ["COGconnected", "Critic", "80", "The scenery is quite stunning as the island life is beautifully rendered. There’s so very much to do in the game that you could spend entire sessions simply travelling the map and entire other ones just hunting down secrets and easter eggs."], ["Push Square", "Critic", "80", "The campaign may have some low points, but attacking bases and liberating towns is some of the best fun that you'll find on the PS4 this year."], ["Cheat Code Central", "Critic", "80", "The game does have its glaring flaws in the atrocious shooting mechanics, repetitive main missions, and turtle-like loading screens. However, the title definitely shines where it needs to, and Just Cause 3 might very well be the most underrated title of 2015 - this is one wild, testosterone-infused adventure you’ll want to check out for yourself."], ["Atomix", "Critic", "80", "Just Cause 3 is a thrilling sandbox full of varied content. It will definitely improve over the time thanks to the committed mod community. Sadly, console players have to suffer from continuous framerate problems, but if that doesn't concern you, it shouldn't be a problem at all."], ["Attack of the Fanboy", "Critic", "80", "Just Cause 3 is one of the best open world games of 2015. Avalanche Studios gives players endless possibilities in this sequel that one-ups its predecessor in nearly every way."], ["Hardcore Gamer", "Critic", "80", "Horrendous loading times, a lack of synchronous multiplayer and optimization issues hold it back from pure bliss, but Just Cause 3 is an absolute blast, an experience equivalent to a shot of adrenaline straight into the heart."], ["Giant Bomb", "Critic", "80", "If you’re aware of the game’s limitations and you’re still eager to blow an open world straight to hell, few games do it better than Just Cause 3."], ["IGN Spain", "Critic", "78", "Quotation forthcoming."], ["PSX Extreme", "Critic", "77", "All in all, Just Cause 3 is one giant bombastic set piece that manages to be immensely enjoyable and disappointing at the same time."], ["Vandal", "Critic", "77", "Just Cause 3 just wants you to have fun, and it does achieve that. It's a shame the secondary missions feel quite empty, but if you know what it is about, it won't disappoint you."], ["PLAY! Zine", "Critic", "75", "One of the most entertaining open world games of the year, even though it's not bringing much to the table compared to the series' previous instalment."], ["Post Arcade (National Post)", "Critic", "75", "This sense of freedom combined with the game’s unbridled love of destruction and mayhem is what will earn Just Cause 3 a spot on millions of gamers’ shelves. It’s not particularly polished, pretty, or innovative. And no one would make the mistake of calling it intelligent or vital. It’s just a bit of stupid fun. And sometimes stupid fun is all we really want."], ["InsideGamer.nl", "Critic", "73", "Just Cause 3 offers a lot of options to go ballistic, but there are many technical errors like long loading times and a dramatic framerate. If you can handle that, the game is big enough to keep you going, and there is a lot of fun in there like using the wingsuit, crashing helicopters and blowing up tanks."], ["Merlin'in Kazanı (Turkey)", "Critic", "73", "\"I have an island and i will blow it up!\" Just cause 3 is a symphony of explosions. Action scenes make you feel good but missions get repetitive after a while."], ["IGN Italia", "Critic", "73", "Just Cause 3 is quite a good game, but it would have been better with more attention to detail."], ["Play UK", "Critic", "70", "Frustrating technical issues are never far away. [Issue#265, p.78]"], ["PSNStores", "Critic", "70", "At this point, around 20-30 hours in, I might have spent more time watching Just Cause 3‘s loading screens than playing some of the smaller indie games that have released on the PlayStation Network."], ["ActionTrip", "Critic", "70", "It’s a fun ride even if it does not make much sense. In other words, never underestimate how much a good explosion can make up for other shortcomings."], ["Game Revolution", "Critic", "70", "Like me, fans of the predecessor will still enjoy playing this game, and the true sandbox nature that promotes tinkering around with nearly endless possibilities will ensure that some people will continue to play it even after the story is completed."], ["Kill Screen", "Critic", "65", "Without compelling characters or inventive story missions, all that’s left to keep the audience entertained is destruction, repeated ad nauseum. There’s value in the small-scale satisfaction each explosion creates, but an empty feeling lingers after every plume of smoke has cleared."], ["Digital Chumps", "Critic", "64", "On a base level his (and by extension Just Cause 3's) explosive areas of expertise remain impressive, but his application falls well short of expectations and ultimately becomes inert. What good are the world's greatest explosions when you stop caring to see them?"], ["Playstation Official Magazine UK", "Critic", "60", "For all its booms and bangs, Just Cause 3 is never quite the unrestrained fun-maker it threatens to be. Whenever Rodriguez dons his wingsuit, however, it positively soars. [Jan 2016, p.88]"], ["GameCritics", "Critic", "60", "Just Cause 3 may offer a metric ton of content, a ridiculously huge world to roam, and some unbelievable aerial acrobatics, but none of those things are enough to save the day because the writing is phoned in and the game's core is too rooted in the last generation. Apart from the traversal, everything here has been covered time and time and time again, and it absolutely wheezes without anything more interesting to sustain a player over the long haul."], ["New York Daily News", "Critic", "60", "It’s not fun to learn the mechanics in this restrictive setting, less fun to restart over and over because of Just Cause’s lengthy load times. For a game that offers so much freedom, it’s a shame that many missions rob you of that by forcing you to work under time constraints."], ["Gameblog.fr", "Critic", "60", "Just Cause 3 could have been so much more than it is. Even though the action scenes and the destruction are fun, the game is dragged down by its faulty AI, its bugs, and its framerate and loading issues. Just Cause 3 is enjoyable, but only for a little while."], ["The Escapist", "Critic", "60", "The additions of the wingsuit, dual tethering grapple hook, unlimited C4 and regenerating health system are all fantastic additions that would've made Just Cause 3 a breakout game in the franchise, if not for the dull story, repetitive story missions and technical issues ranging from long load times, to poor framerate and to constant disconnections for a single player only game."], ["IGN", "Critic", "59", "At its best, Just Cause 3's over-the-top action and physics-based mayhem has me laughing out loud on the regular. It’s a damn shame so many performance problems and punishing load times keep cropping up, because I love what Just Cause 3 does. But for game that’s so heavily dependent on action to run this poorly is no laughing matter."], ["PSX-Sense.nl", "Critic", "55", "Just Cause 3 is not a bad game. On the contrary, it is a lot of fun. It's a shame that our enjoyment with it is cut short by technical difficulties that really have no place in this day and age."], ["Slant Magazine", "Critic", "30", "Imagine a roller coaster that stops for maintenance every 30 feet and doesn't allow you to exit, even after you've already been around the track a few dozen times."], ["Riskyreview", "User", "9", "This game is very you can do just about anything you want!"], ["JRG", "User", "10", "Repetetive after a while, and it has some questionable progression unlocks. A little bit shallow too."], ["bull3", "User", "8", "Summary- The story is sub-par,  main missions repetitive,  and frame rate can dip into single digits.  Despite this,  Just Cause 3 is the most fun I've had in a game in a while.   It is just pure fun.   Liberations always feel rewarding when you find new ways to blow things up. The tether was the best feature of this game."], ["Typical_cynic", "User", "7", "I had constant crashes while playing this on PS4 but it is still a fun game. It can become repetitive after a while but I think so are 99% of games that are out there."], ["renao", "User", "0", "Jesus Christ, do not buy this game."], ["Tubey", "User", "7", "It's good for what it is - a random playground where you blow stuff up. Better title for it would have been \"Just Because 3\", as the meat of the game is destruction and doing random things in a sandbox \"just because\"."], ["Rundusol", "User", "6", "Right now as this game is on the PS4 - i cannot in good conscience give it more than a 6. And lets go into why ina moment."], ["robinzvak", "User", "4", "Dear Avalanchce studios,"], ["Matinski", "User", "2", "Broken game . Long (and I mean looooooong) load times. Horrible frame rate drops . Don't buy. This could have been as good as 2 but it isn't. Really expected more from Square Enix."], ["MisterChau", "User", "4", "Nice big open world and some pretty good fun to be had, but that is where is really ends. The story is a meh cliche' at best and voice acting is cringe worthy. They had a lot of great ideas, but it seems like they didn't work out well at all. The grappling system is wonky and hard to control most of the time, it really only works well in cities where you have lots to grapple, but most of the game so far has been open  fields with little to grab. The parachute is near impossible to control while grappling and 95% a grapple while in wingsuit throws you right into the ground. Grappling vehicles to hijack is cool at first until you find out it only works half the time, the other half the time ends up you smashing into the vehicle and saying wtf to yourself. The weapon usage and aiming doesn't feel smooth at all, and the fire button switches while inside a vehicle, making me blow myself up with grenades constantly after a long ride in an attack vehicle. Additionally, with the vehicles, to say for the most part they handle like dog **** would be a terrible insult to dog **** There is what feels like a 1-2 second delay when turning a vehicle, so you are constanly over/understeering trying to \"adapt\" to the ****ty handling. There are fun aspects to the game outside of all the glaring problems, but the one hugely unacceptable thing about this game that totally **** it over are the ungodly load times. Holy **** the load times are baffling long on a next gen console. All in all I will say a decently fun game, but can't hold a candle to similar games like GTAV."], ["Slevin310", "User", "7", "I'm disappointed, I don't expect much about this game. It's supposed to be a bat **** crazy fun game and it was but the developers straight up lied. There is no customization on cars or weapons. It does not \"feature 80+ cars\" in the game. The map is not 400 square miles making it \"The biggest map ever to be made for a game\" and there is no multiplayer. All things promised and now they're saying \"we didn't have the resources to do all that\" so I knew none of that was true but that doesn't make it okay to lie. If that wasn't possible why not just take what you have and improve on it? Improve the shooting mechanics and customization."], ["Linkn216", "User", "8", "Repetitive mission design and lacks an engaging story, but who cares!!"], ["Agarwel", "User", "6", "This may be a great game. But after they actually finish it. Action, destruction, physics are really fun. I would compare this game to the Saints Row 4. You are ovepowered hero in fun sandbox world. But... the game needs polishing. There are crazy loading, that takes minutes. (and sometimes all this loading will do is set a wehicle next to you and show a waypoints). I estimate that I spent almost half of the \"play time\" looking at loading screen. This has to be fixed. Then there are enemies. I wont mind their bad AI (it is sufficent for this type of a game). The problem is with their respawn, that are really annoying and non logical. You shoot the nemies, turn around and suddenly someone is shooting you in your back again. This is runing the gameplay ,because shootingenemies feels meaningless. And then are are lots of randoms small bugs (levitating npscs, etc). I can say, that when I way playing I have tremendous fun. The problem is, that the game did not let me play as much as I wanted and kept interupting with looooong looooadings. Once this is fixed, I will recomend this game. Until then I stopped playing."], ["bongorock", "User", "6", "Haters gonna hate I guess. But I'll be real with ya, if you liked Just Cause 2 it wasn't because of the awesome voice acting or story telling. It was probably because it was so horrible it was funny. Nothing has changed here, and to me that is a good thing. I don't always need a hollywood story with no substance like the order or Ryse."], ["gamer6969", "User", "9", "This is a very cool game. A bit repetitive, but what game isn't. Not much of a story, but this is a game all about action. Big open world and lots of stuff to blow up."], ["robkaper", "User", "9", "While the story arc remains unimportant, everything else is an improvement over predecessor Just Cause 2. The new wing suit makes exploring the islands easier. The environments are again massive and even more beautiful than before. The fire leech has instantly become one of my favourite weapons in gaming history. Just Cause 3 might not exceed expectations, but then again it doesn't really have to as long as it delivers what it promised. And it does: endlessly blowing up everything in sight in various way still is fun, a lot of fun."], ["Kimomarudotcom", "User", "8", "An interesting game that feels like it's taking two steps forward, one step back whenever I play.  The destruction and physics in this game is just a lot of fun, vehicle and aircraft handling is great, has a pretty wide assortment of weapons and tools, and the characters are likeable.  In a season where Black Ops 3 and Battlefield 4 are my go-to games, Just Cause 3 fills a space well.  There are a couple of weird things.  The actions slows down in some of the more hectic gameplay.  Also, the load times are pretty long.  I've been playing JC3 in the mornings and can scarf down breakfast in the time it takes to load the game from the start screen.  It becomes a bigger hassle when retrying a challenge - it's enough to make me give up on the challenge altogether rather than wait.  I hope they have a way of patching this because the game is outrageously fun.  It's a great game in a season of solid releases and it deserves attention - a class act."], ["thermalflight", "User", "9", "This is exactly what JC it's meant to be.  The biggest sandbox ever."], ["Zlatan", "User", "0", "As of today's date with current latest patch the game is unplayable. The frame rate is appalling. You are warned!! Blowing  up stuff is why I bought the game but  frame rate drops so low that it takes the fun out even there. Compare it with bad characters and story and you got a **** game."], ["gd01skorpius", "User", "7", "Overall: 4.5/10"], ["Critical_Fun", "User", "6", "One of my favorite sandbox games of all time.  That is the one big PRO I can list for this game.  Destruction.  Endless fire and destruction.  Also, the grapple and parachute gives the player a great feel."], ["Niceguy3210", "User", "7", "I like this game a lot, but I do have issues with it. Issues like the gear currency. You need to do side missions to earn more gears to upgrade your abilities. But the problem with that, is that it is mind numbingly boring. Seriously, I beat the campaign and liberated every location in the game, and only upgraded 2 abilities. Missions like \"try to get to the target by driving through rocky terrain that you'll only struggle to get across without slowing down or else you blow up\" or \"get from point A to point B in 1 minute\" are not fun at all, and it makes me wonder why time and time again we see these kinds of missions in games when most developers should know that it's incredibly boring."], ["GuywiththeGames", "User", "6", "I know this game came out a while ago, but I do not care. I will tell people what I thing of this game."], ["TalentlessHack", "User", "7", "Let's keep it simple here, Just Cause 3 is just a Just Cause 2...but on current gen systems."], ["LOLZIES", "User", "10", "for the xbox one, at times the game can lag like SUPER hard. it also has a bit of a shallow progression system, but overall a very fun game. (would like to see the lag issue fixed up though)"], ["Wiz1414", "User", "3", "I created an account just for this game. My god. Its fun, it gets repetitive fairly quickly but its fun to make things explode. Fun to put someone to something explosive with the grappling hook, fun to pull helicopters out of the sky. The dialogue is funny when you take over bases, and the the game looks beautiful. These are the good things about it, not much, its a game you can play while waiting for something better."], ["extremeprey", "User", "7", "To be fair to Square Enix Just Cause 2 is hard one to follow up. Did they manage it? No not really. The game isn't bad though it just sort of hammered my expectations down. When I heard there was going to be a JC3 I was mildly excited and continued to be mildly excited until the game was released when my look on the game changed to moderately impressed that they didn't just flunk it. They gave this game a solid try so I'm happy with that. A lot of the faults in the game comes simply down to Square Enix playing trail and error. The wingsuit is a good example: You see the map was designed for distance for the wingsuit to glide from one side to the other whereas JC2's map was designed for the parachute which hasn't been toned down in this game but rather ignored. Because of how much the parachute was used in JC2 they assumed that adding another traveling mechanic in the same fashion would add brownie points but it sort feels weird. The parachute was designed so we can travel vast distances and climb with ease whilst soaking in the environment however the wingsuit fires you past the environment that you don't really get a chance to stop and look at it."], ["jabawokie", "User", "4", "For people who are currently considering this purchase... This game was filled with bugs, repetitive, yet fun."], ["Maxreviews420", "User", "9", "Okay I loved this game but It has some issues. 1st OH MY GOD THE LAG!!!!! Whenever I cause a lot of explosions the games frame rate goes to hell and sometimes it crashes. On a ps4 that's nearly unheard of."], ["mwil236", "User", "6", "I believe it is unfair to give sequels negative reviews for being repetitive, but the manner in which Just Cause 3 shamelessly replicates even major plot missions from Just Cause 2 is not ideal.  Initially, the game shines - missions are interesting, there are a variety of new challenges and a few new features, but these quickly give way to outrageously difficult story missions and a painful fast travel and resupply system.  I understand that the developers may have wanted to make the game a little more challenging than JC2, which simply allowed you to drop a helicopter or jet right in front of you at any time, but their new \"beacon\" system means you only get one resupply before having to traipse perhaps tens of kilometers back to the nearest city you liberated to get more.  The real issue here is once the story progresses past the initial island grouping in which you find yourself, you end up on a large island that has about half the content but is more than three times the size - villages and military bases are anywhere from 5 to 30 kilometers away, and many mountain ranges block your way.  Travel slows to a crawl and essentially requires you to use the very weak aforementioned beacon system to get a helicopter.  And even then, you're in for several boring minutes of holding down the analog stick and simply flying to your next objective."], ["Chamberspank", "User", "7", "The games gives you a lot of freedom. It's nothing were you need your brain. It's just action without a meaningful story. It reminds me of expendables. It's pure action and nothing else. Nothing to think about too much. Beside the massive amount of really ugly video fade-outs and the unnecessary loading times the controls could have been a little bit more intuitive. Actually it still needs some tweaks to make it more \"special\"."], ["yloquen", "User", "6", "HORRID LOADING TIMES !!!"], ["SeanGamerDays", "User", "9", "Who cares about the goddamn plot! Let's start blowin s--t up! Now we can start a Michael Bay simulator, and we don't have to watch his whole goddamn films!"], ["TheNik520", "User", "10", "I absolutely love the game. I feel as though it lives up to all of the hype. The story is great, the gameplay is great, I just overall love the game. It is a true sequel to Just Cause 2."], ["funkamonkey", "User", "8", "Mindless fun. 2 words that sum up Just Cause 3."], ["alexmann", "User", "6", "I am not one of those reviews who gives game a 1 or a 10. This is a fair score."], ["L1R1", "User", "0", "Millions spent making a game, yet they're too incompetent to swap the shoulder buttons with an option, allowing players to use L1 & R1 for shooting. (Something they did in Just Cause 2!)"], ["HENCHMAN", "User", "7", "I really wanted to give this game an 8 or 9 but could not for the following reasons:"], ["DoctorMonocular", "User", "9", "I think people are confused about what this game is supposed to be, which is why the score is below 90. This game is an epic \"Dude, check this out!\" sort of romp. If you like tethering cows to jet panes and ramming them into military fuel tanks as you parachute overhead raining rockets onto tanks, then this game is for you."], ["ciambella", "User", "9", "Amazing physics, great graphics and an amazing grapple hook/parachute/wing-suit dynamic."], ["jacko928", "User", "10", "Gr8 M8 I r8 8/8"], ["Overgreedsuck", "User", "0", "It would be beautiful if the game didn't have always online DRM, 10 hour long loading screens and a horrendus framerate.........................expectations crushed"], ["Retro_Roland", "User", "8", "This game is too much fun to not be positive about. I've only played around 7 hours so far but there have been several times while playing that the thought has occurred to me as I look at all the destruction around me, \"Did I do all that?\""], ["Concretenomad", "User", "8", "After having a blast with JC2, I could not wait for JC3 to drop. It does not disappoint. I have a SSD in my PS4 so load times while more noticeable than other big titles are not really bad. The introduction of the wingsuit is awesome. While I am sure there will be a grind to get some of the trophies the real fun of the game is just running around destroying things and using the grapple. It does this very well :)"], ["xtro01", "User", "1", "guys... do not buy this you will regret it. it's not even patchable :) ... technically it's completely outdated feels like a 5 year old game. The game mechanics are rudimentary and boring and it's full of bugs and very often drops to under 10fps on ps4. forget it."], ["dannyboyswe", "User", "8", "I have not played any of the erlier Just Cause-games prior to this one, but I was too curious to pass it up after the announcement at this year's E3."], ["NMFreed", "User", "5", "If last year was the “Year of the Bow” in gaming, this year is the “Year of the Grappling Hook.”"], ["VidjaGames", "User", "9", "Just Cause 3 creates a realistic nation with an oppressive government and then let's you right that wrong. There are however drawbacks to a world that's perhaps too realistic/ immersive. There are big open spaces that can be annoying to traverse. The cities are very similar looking which is also accurate to how must of earth is but it can also make them boring."], ["Hollowfied", "User", "10", "I simply love this game its open world   quest based level with taking down enemy  gun are cool  driving mechanic top notch"], ["MattHodge", "User", "7", "Oh how I wanted to give a 9 or 10.  It was always a great amount of fun to tether a tank to a wall, and then watch at what people at Bethesda call 'a simple fact of games' as it pings into space.  But I can't.  Because while it is fun to do that, the game (an open world game, mind you), has paradoxically has both a lot of side quests, yet has no fun content that is repeatable."], ["coolguyhasachil", "User", "8", "When people talk about say the word \"game\", I usually think of qualities like fun, excitement, and basically the opposite of being bored out of your mind. A lot of games today try too hard to be a \"survival hardcore crafting\" game, and forget about what makes video games, well, *games*. Just Cause 3, however, doesn't. The game is fun. Like, really fun. Yeah, it's plot is no better than your standard Bollywood movie, but its obvious that that was not the focus for Square Enix. They decided to concentrate on making a really fun and exciting game instead, and you know what? It worked. I'm about 13 hours into the game and I'm proud to say it hasn't left me a dull moment, even the traveling from point a to point b is exhilarating with the sheer magnitude of transportation methods. The characters are simple, yet somehow memorable, with characteristics that make happy to know them, even if they aren't exactly groundbreaking in depth. Overall, Just Cause 3 is not for everyone, some people prefer a dialogue-driven story or RPGs with tons of depth and character customization, but for those looking for a good game to just sit, grab a snack and blow s*** up cause why not? Just Cause 3 is totally the game for you."], ["Sheldor13", "User", "2", "some of the worst vehicle controls i have ever seen in a game and very average game play, would not recommend paying full price for this game, only buy if it was on sale for very cheap"], ["jakephish", "User", "10", "This game is great. It is true to Just Cause 2's fun style, and any repetition is because people aren't seeing that this game has such an open physics model that allows you to beat stages in unlimited ways. If you choose to use the same strategy for every mission, it will be repetitive. It was never supposed to be a GTA level of detail in story, gameplay, or even complexity of missions. People seem to want to hold it to that standard, which isn't realistic. GTA needs to raise the bar of open world with every new release, this was never supposed to be that."], ["SILVERBACK6153", "User", "9", "This game finally cured my Fallout 4 addiction! The game is beautiful to look at especially when you start blowing it up. The story is the only downside but I didn't buy this game for the story, I bought it to relax and have fun at the same time. Nearly as good as Just Cause 2 but this game still gets a 9/10 from me! Recommended :)"], ["damman", "User", "10", "Love the game. I didn't think of this game being repetitive at all.  It's fun on the PS4 muck more than star-wars battlefront which i received a full refund and purchased this game. Very smart on my part. At least you don't get a half game and boring game play like most games. Keep up the good work Square Enix!  This is a sleeper hit."], ["MetalGearBunny", "User", "2", "just cause 1 i never played. just cause 2 was stinky penis and this well dont even ask about this one as i played the trailers for a few minutes i knew i was having a bad time in this world it felt like aids but without the D. i couldnt get any enjoyment out of this as it felt ike i was watching a movie and all i really had to do was press play    2/10 will not watch again might on xbox when the price goes down doe."], ["Quink666", "User", "4", "I have never been so bored with a game 2 hours into it. Graphics are extremely grainy, controlls feels a bit wonky, Cant even aim down sights without the right  MOD......"], ["fallouts", "User", "7", "Eh, not bad at all, but something definitely seems to be missing with this game. The game play and explosions are better than before, but the map has far less locations than the last game making the map feel rather empty and lifeless. The character feels like a generic military buff this time around with the voice to match. The devs kept hyping the story yet it's very generic and barely gets the job done.  The biggest sin this game commits is forcing the players to do these challenges to unlock skills essential to game play. The challenges themselves are phoned in and uninspired. If you can't be bothered to do these side activities (I don't blame you if you don't) then you will be using the same few moves throughout the game. Also, why did they take out he whip meele move and replaced it with this lame shoulder push. Visually, this game shines and is probably one of the best looking games of this generation so far with a detailed map and a very well done view distance. Overall, get it on sale."], ["DF007gamer", "User", "9", "This game is awesome. Load times aren't a issue (PS4) for me or the frame rate and Ive been playing it for over 40 hours. People complaining about repetitive missions have obliviously not played Square Enix games before.  Liberating settlements and taking over Military bases never gets boring. Its worth the money spent because there is alot to do besides the main story missions. Its a enjoyable Platinum to go for."], ["Jack_Cranberry", "User", "9", "Look. This is a hoot."], ["BetterThanSonic", "User", "8", "A really fun game because it has very little in common with the Sonic the Hedgehog games. Seeing something this well done just makes games like Sonic Adventure and Sonic Boom seem that much more terrible."], ["BlueSilver", "User", "10", "Just Cause 3 is one of the best open world games and best action game for PS4! Explosions look sensational with particles flying everywhere. Big world to play! This game is better than GTA V. 10 points!"], ["paddystudmuffin", "User", "6", "Have to agree with people saying on here that the loading times destroy the game.  It's true.  Loading after each challenge means your waiting a lot in this game.  JC2 was amazing this unfortunately isn't.   Looks great when sun is shinning but when it dull it's ugly.   Seems smaller too.  6 I'm afraid until fixed."], ["Ozzy0071", "User", "6", "This is a good game, don't get me wrong. But it could have been so much better. It could have been a lot, lot better."], ["Dog4life", "User", "6", "As fun the sand box can by at times, the whole game is afflicted by terrible tech, with heavy frequent frame drop when the real action starts.... and not minor drops, consistent heavy drops that affect badly the gameplay."], ["OwtDaft", "User", "6", "Repetitive, buggy, bad story, long load times and bad controls. Has it's good moments but for the most part the game is mediocre. Playing with your rope thing to lift things and pull things together is fun though. The physics can see really random at times and appear buggy. The game bugged on me very early on causing me to have to restart the game. Some of the high scores this game has been getting despite it been clearly unfinished is a big let down in trust."], ["BogdanXdd", "User", "4", "It's awful! The driving mechanics are the worst i've ever seen,the plot is unexistent,the characters are very boring,it's a repetitive and poorly made game. I've spent between 40 and 50 hours playing this game; i tryed to see the good things and lie myself that i didn't spend my money on a bad game. If you want to buy this,don't do it!"], ["AllThingTrivial", "User", "7", "Its a fun game with a lot to do but will leave no lasting impression. Nice whilst you're playing it but nothing inspires or exceeds expectations, its above average but cannot - in good conscience - be considered as a great."], ["SimpleReviewz", "User", "7", "At first glance, Just Cause 3 is MY type of game: an outrageously crazy game with outrageous fun. After all, I play games to have FUN. It's good to play truly amazing games like The Witcher 3, Metal Gear Solid 5, and so on, but a game like this is the reason gaming exists. Sadly, though, I have discovered outrageous crazyiness and fun is not what makes a game great when that is the only thing it offers that is awesome. I have uncovered that with Just Cause 3. JC3 is undoubtedly a fun experience pretty much all the time, but it's deeply flawed. From technical problems to repetitive, shallow, and lazy mechanics, I would not dare call JC3 a great game. When the fun madness of the destruction is there, though, JC3 is a very good time indeed."], ["AnthonM2", "User", "10", "Awesome and fun game, great soundtrack, the graphics are really nice, the colors are so vibrant, one of the best games ever, so fun to play, a must buy."], ["szszsz", "User", "8", "plot is bullsht, characters are lame, ultra villain is cliche, also loadings loadings loadings even tho the game looks worse than gta5"], ["SuperkenGaming", "User", "8", "Just cause 3,"], ["homer4president", "User", "7", "Story is just meh and I didn't really care for it. Great graphics and very fun gameplay. HOWEVER, I have run into a lot of frame rate issues with the PS4 version and loading times which have been trimmed down from the update but still, to restart a challenge takes a while."], ["Marshb63", "User", "8", "Liked this game a lot. Great action, a (for a Just Cause game) good story/campaign.  But it does have some problems.  The biggest is that the game was pushed out the door too soon. For example,  the game doesn't load \"behind\" cutscenes, it loads after the cutscene ends. Little touches like this and others slow down the pacing to a crawl at times, not to mention the un-optimized state the game engine is in largely due to a last minute on line component."], ["Elitist1945", "User", "8", "Just Cause 3 is a game that knows what it wants to be. It has an extremely large, beautiful world with plenty of missions/optional missions to complete, great graphics, solid humor and most important of all: exciting action. It falls short from being an amazing game, however, by having extremely long load times, poor frame rate, and not enough incentive to return to the game upon completion, although subjectively, completing the game may itself be enough."], ["SuperDuck23", "User", "7", "While the missions and story of this game leave a lot to be desired, the open world and toolkit that they player is given right from the start just about makes up for it. The only problem here is that the gameplay, despite being fun, is so shallow that it won't hold your interest for very long and you will soon look elsewhere for a game with more bite."], ["RealLeather", "User", "8", "This is very much a one trick pony kind of game but luckily the trick is an entertaining one. The constant destruction and violence is campy in that old Commando-era Schwarzenegger kind of way. The story is just awful and completely devoid of any of the bizarre elements of JC2. Admittedly, JC2 also had a terrible story but the weird voice acting made it quite entertaining, unfortunately in JC3 the voice acting is average which gives the story no novelty value. The new voice actor for Rico is not very fitting either, he imbues the character with a lot of pomposity and in general the 'writing' for Rico is not great although there are a couple of nice one-liners. Load times have been patched now but the framerate is still questionable at times."], ["Adix", "User", "9", "Although the game does get repetitive it can be excused with all the creative ways you create chaos. This game has many explosive surprises in its sleeve and its something to appreciate. The world is absolutely beautiful with plenty of things to see and all of its hidden secrets and easter eggs to find. From driving a boat to wingsuiting through the world this game is what players want to immerse themselves in. The beauty of this game i undescribable, I had a great time flying around through caves, hills and cities. The story is great fun too with lovable characters and funny moments for everyone to enjoy and not to forget all the action it packs. The addition of mods is fantastic and great to mess around and making gameplay incredibly fun. This game almost lives up to its previous game but it is still an amazing game with lots to do."], ["PureIronStag", "User", "6", "While this game did satisfy and overcome my expectations in many regards, it is far from perfect and has actually managed to get worse than its predecessor in some regards."], ["ImperialCast", "User", "7", "Just Cause 3 is basically explosion simulator. I'm not saying the explosions and booster explosives aren't super fun to watch, but that's the extent of what's offered here. The side missions are boring, the main character is like a blank sheet. Occasionally they throw a gob of ink on there, only to rub it off with white-out. Some other characters like Dimas are pretty good, but Just Cause 3 lacks good characters. This game encourages me to be creative. In my face, it tells me it will reward me for being creative. And while ten automatic weapons, a missile launcher, and three snipers are shooting at me I'll plant a super intricate chain reaction and be 'creative.' Basically the game consists of main quests, side quests, and taking bases. You'll need to take bases to advance the story. The first couple of bases are awesome as you goggle at the explosions and watch your explosives go to work, but then it becomes repetitive as being creative is impossible as the super aggressive AI works all too well on you. There will be red screens. There will be grinding. All I ever used was a RPG, and occasionally the plantable explosives on big objects. But over all of this, the idea of how you take bases is absolutely ridiculous. Blow the crap out of everything and then the dictator loses the place. What? How does that help the resource starved rebels? Now onto the best parts of the game. The graphics are phenomenal. I've never felt more in paradise in a video game. The explosion effects are awesome too, with pieces of metal flying through the air, and crushing Di Ravello's puny militia troops. I've never had more fun strapping explosives that push things(booster explosives) onto cows and watching them fly through the air in awe. It almost brought tears to my ash caked eyes. The game is extra fun when you're just jacking around, blowing up cars and cows, and testing how far you can free fall. Also, travelling with the combination of wingsuit, grapple, and parachute makes long distances a 'distant' memory."], ["GameWarp", "User", "8", "At launch, console editions of Just Cause 3 were mocked and belittled for their poor frame rate, long loading times and even crashes. With a new patch, these issues aren't gone, but are severely minimised, mainly the load times. On PS4, Just Cause handles, from what I've seen, fairly well, with slightly clunky driving, which is ignorable here because most traversing will be done with the amazing wing suit, grapple hook and the parachute. The story is very bland, nothing special, but most of the focus is on the free roaming. The mini games and challenges are boring, admittedly, but when you make your own fun, the energy in the game is seemingly endless. Recommended, yes. Completely bug-free and without its frame rate issues, absolutely not."], ["radioraheem20", "User", "8", "i really don't get why a significant chunk (maybe half?) of reviews -- from both pro critics and users -- say this game's story sucks as if it's a deal breaker. don't get me wrong, the story does suck. BUT WHY DO WE ACT LIKE VIDEO GAMES HAVE STRONG STORIES? these same people act the stories of GTA V is Godfather Part 2 or Rise of Tomb Raider is the video game equivalent of a deep novel. Nah, those stories were pretty damn generic too. most video game stories are inherently dumb."], ["FryTech228", "User", "10", "The best game ever! It is cool game!"], ["ArduxcoolGM", "User", "9", "El juego le doy un 9 por las horas que me ha dado de diversión volando y explotando cosas por donde sea si cierto que no tiene unas mecánicas muy buenas y la historia no es nada del otro mundo hay veces que las personas se olvidan de que los videojuegos se hicieron para divertirse :D"], ["blueshark33", "User", "7", "Played JC2 for 4 years, bored with JC3 after a month."], ["DiscoMoose", "User", "8", "If you want a fun romp that doesn't take itself too seriously, then this is pretty fun. If you're looking for a realistic tactical shooter... go buy RainbowSix: Siege."], ["Floodaren", "User", "9", "I think Just Cause 3 is a great game!"], ["Brandon_Harris", "User", "1", "Just Cause 3 is a very glitchy game. But really, that was bound to happen due to the amount of things you can do in the game. You can really have fun destroying objects and watching the physics. As in its moniker, you can do it all “just cause”."], ["oldmanfire", "User", "0", "4702MQ CPU GTX760 GPU 16Gb RAM and up to 70 pictures in Game. But many many cold shut downs in Game. Bad support and trubleshotings. i have no experinece about Gameplay because....... b."], ["keepers_hammer", "User", "4", "To anyone considering buying this game DONT. It runs ok sometimes but usually like crap crashes a lot which over time corrupts your save game. Im at 99 pc complete and cant finish the last few challenges coz it wont save progress anymore and tech support is non existant they just dont care. Trust me and save yourself a big headache. Such a shame too coz i do like the game if it worked properly"], ["2theTardis", "User", "9", "Although it gets slightly repetitive after a while, and there are a few bugs, you can easily ignore that given how god dam fun this game is. There have been complaints that the story missions suck. I have no clue what that is about. the story missions are great, and not very restrictive in how you go about them. But then the open world is fun too. The action is over the top and brilliant because of it. The story is predictable, but, hey, you can ride a missile!"], ["SwarleyStinson", "User", "4", "This game has so many dumb problems right from the start. To liberate outposts you have to destroy objects. Not just any objects or lots of objects, SPECIFIC objects. So you have to FIND them. How? oh yeh the devs didn't think of that - THERE IS NO MINIMAP!!! Why??? You have to press the touchpad to open the full map all the time. That's bafflingly idiotic design choice #1."], ["TotalBloodMan", "User", "0", "This game should be called Just Unplayable. Optimization? Nope, huge FPS drops and repetative gameplay. What a shame. I do not understand how this game has positive ratings. Absolutely unforgiving."], ["Jack97", "User", "7", "The open world is enormous, the biggest and probably most detailed one I've ever played in. The game is undeniably fun to play, it's very entertaining flying around enemy bases and blowing up everything you see. But the story for the game is one we've seen many times before and the characters are boring. So you don't care about either of them. But it is still a lot of fun to play and that's important."], ["mikepango", "User", "6", "Destruction galore! that is the best part of this game. running around F'in stuff up is a lot of fun and a sight to behold. But to tell you the truth thats it. not much else to talk about. The open world is large and beautiful but sadly repetitive. Every base is the same, every town is the same and every mission almost feel the same. You may find nothing wrong with that at first but 5-10 hours will make you want to move on. The story is cringe worthy at every turn. The main character is cool, nothing wrong but when he and other characters start to talk and play out the story. Well lets just put it this way, you'll be wishing you were deaf. It's not the voice acting it just leaves you with the thought of \"Who the hell says this ****"], ["HaloFever", "User", "6", "Waiting an entire year to buy Just Cause 3 for $15 during PSN's black friday sale was a great decision because this game is not worth $60. Somehow the developers made this game less fun than Just Cause 2. The game has such a simple formula, how could they mess it up?"], ["DocWeird", "User", "7", "It is Just Cause - just that something is lacking. It can't quite catch the original's, or the sequel's, magic."], ["ToFewViews", "User", "7", "Do you ever feel like parachuting into a military base and using a RPG to blow up anything in sight? Well that's Just Cause 3, You will spend most the game going from Cites,Towns and Military Bases and destroying them. The game takes place in a tropical island in the middle of a Military Dictatorship, You are part of the rebel group and I'm sure you see where this is going. The highlights from Just Cause for me have to be using your Grappling hook and wing suit to fly across the map like a superhero or just thinking of new ways to destroy everything. The game is fairly simple with not much depth, If you don't enjoy the simplicity of just killing everything with not much of a story then you won't really enjoy Just Cause 3. It seems like a game you play for a bit then move on, not much with the game keeps you playing or draws you in."], ["TsukasaHiiragi", "User", "5", "TL:DR"], ["Debaucep", "User", "3", "This game is thirid part of great Just Cause franchise."], ["DrZomboid", "User", "6", "Buggy and often boring game with stupid repetitive missions."], ["EricDean", "User", "6", "I really wanted to love Just Cause 3. After all, Just Cause 2 is my favorite game of all time (second only to Red Dead Redemption) and Just Cause 1 was a fun game in its own right. But Just Cause 3 is just... missing something. I can't really narrow it down to one simple thing but what Just Cause 2 did right, Just Cause 3 does wrong. Voice acting is poor and cringey, the story tries to be more deep and interesting but just ends up being more boring than the other ones, the game looks nice but has too many technical issues. It's a combination of all these things and more. I got this game for free with PS Plus last month and I have to say that I'm glad I did because if i had paid full price I would have been thoroughly disappointed. Pick it up on sale or when its price is reduced if you want a game to run around and blow stuff up, but don't buy expecting a fully polished and expansive game like 1 or 2."], ["Britmatt81", "User", "5", "Extremely repetitive but fun. The graphics is gorgeous and realistic and even the water. I have had many hours just enjoying blowing stuff up like ammo crates, petrol staions and barrels and fun to grapple things and cause chaos and the wing suit is really good fun and is quite relaxing to go for a fly. The world is huge but it all looks the same and even the towns are based the same. I think its ok but just too much of a grind and a very uninteresting story. The driving handles horribly but with a bit of practice its a tad easier but still dreadful handling lol Id say POANTA (Play once and never touch again) ."], ["leopoldo", "User", "7", "Just Cause 3 is an interesting game, but repetitive. Just Cause 3 is an action game with a very simple story, but the game never tried to change that, with this, this simple story was deliberate. The gameplay is very fun, explode, fly, and blast again is very good, but even with many varieties of weapons, vehicles, and explosions, Just Cause can become repetitive (the missions are often simple and similar). Visually the game is beautiful, but what is most striking are the explosions, they are extremely well made, and can even say that they are innovative; the soundtrack does not have anything special. The maor problem of this game are the bugs, are many and are annoying (but some are funny). Overall, Just Cause 3 is a very fun and beautiful game visually, however, has a simple story, it is repetitive and possesses many bugs. 7.5 / 10"], ["Manjisan13", "User", "6", "Was ok, I had a better gameplay exp in just cause 2 than 3. everything feels the same. few things added, the rest is copy/paste."], ["Multitude", "User", "4", "A Chance wasted! - But you should still buy it!!!!"], ["WackoDaSniper", "User", "7", "Same sandbox-style as JC2, some characters have different voice actors which is a little disappointing and the performance issues are there. The world itself is massive but the landscape is repetitive unlike JC2 which was many different landscapes. Other than that, the mechanics and handling are improved which is nice but the story just doesn't come together like JC2 and I was a bit let down by the game."], ["Termin8ter", "User", "7", "Just Cause 3 is an absolute blast to play, and some of the scenery is impressive, and the gunplay is solid,too. But everything else fails miserably. The main story is as interesting as a brick wall, and the side quests get very repetitive after a while. Overall, JC3 is a decent game, but nothing special."], ["Epik_Ninnja", "User", "7", "This game has just as much mayhem as the second one as well as another huge open world. It also has some cool new tricks up its sleeve like the wing suit and pulling two things into each other with tethers. However, the gameplay is too much of the same and never gripped me the way the second entry did when I played it a few years back. Another sub-par story and more stuff to explode hardly counts as a full-on sequel (and its progression system is not ideal). Ultimately, if you liked the second game (or if you're an action fan in general) you'll probably like this game but don't expect to be blown away (no pun intended) this time around."], ["badgerryan19", "User", "6", "Same as the last unfortunately. Just blow up stuff. Forgettable story mode and everything else. The wing suit was pretty cool though. This is Michael Bay the game."], ["Nel", "User", "5", "Game had great potential, and it looks gorgeous at time, but the sluggish  mission which has to do with the main story is just right down awful. In a game where destruction is a virtue, the game literally forces you to be very careful,  and with the AI being pretty dumb it will make for hours of repetitive gameplay (which kinda ruins the experience)."], ["waddi007", "User", "10", "never had so much fun with a game addiction is not the word !!!! it will keep you going for a long time forget gta this is the beast dont bother with the xbox version ps4 all the way"], ["imnotyourguy", "User", "7", "It's a game for blowing off steam.The world is huge and gorgeous-looking and there's certainly a lot of stuff to blow up.The story is barely there,but barely necessary.It's the typical Just Cause shtick of ''Kill the big mean dictator''.The best thing about the game is how you traverse the world:the hookshot,the wingsuit and the parachute all offer a lot of mobility,making this feel like InFamous as much as GTA.Blowing up the enemies and the scenery is fun and there's a **** of ways to do it(bombs,vehicles,red barrels,etc.).The shooting mechanics are inprecise,but you can use the hookshot in combat,which is a fair substitute."], ["dugsyu", "User", "8", "Just bought it a week ago as i saw a friend spending a good time on it but clearly telling me it gets repeating itself after a while : well that is true but after 20h i'm still enjoying, simply this is a fun game where you destroy as much as you can and the controls are really nice, display is clean and nice as well so in the end i simply enjoy this one to get quick fun. Lots of hours still to play so i give a good 8 on this game, a good surprise in the end"], ["Nightlistic", "User", "3", "Just Cause 3 is a okay game if you are interested in repetitive game play. The control are incredible difficult to master if you aren't familiar with the franchise, and much like the Dark Knight series you are going to replay the timed events over and over and over because of the game controls. The new grapple is confusing as the games controls say to hit L1 but doesn't tell you that you need to actually tap L1 quickly or you are going to just launch tethers out over and over. The Wing gliding is insanely difficult to even master the basic mechanics of it without face planting to your death a hundred times over, and the vehicles you use during races have such sensitive suspension hitting a small rock can send you air born.  Don't expect a deep, and fulling story either as the game's main focus is just destroying things.  Ultimately this could've been a much more user friendly game if there were a dozen different controller schemes you need to remember for every type of vehicle used in the game in addition to your new grapple, wing glider and using the parachute. So its a decent game with overly complicated controls."], ["MercenaryofHate", "User", "8", "This is a very fun game. In this game you are fighting the oppressive government and have allies in blue to help you in the struggle for control of Medici. Medici itself is a very beautiful map, it consist of nice textures of nature but also has densely populated life-like mechanized areas. Action packed and wonderful music can make your already exciting gameplay even more awesome.  There is alot of things to do and many diverse vehicles to be driven. The game give power to the player not the devs, dlc or enviroment as your rarely in any real danger."], ["chimiche1992", "User", "10", "Quitando de lado su campaña que como siempre nunca tiene sentido por mas que lo intentan lo que este juego le salva, es su jugabilidad, su manera de poder hacer el cabra a tu antojo, es un jueog que recomiendo para entretenerse"], ["KayVen17", "User", "4", "Deutsche Review - Kritik"], ["BoatyMcBoatFace", "User", "9", "Pros: Interesting and Funny characters, Very Fun and addicting game"], ["mildewman", "User", "5", "Its incredibly repeditive, and the 60fps basic framerate drops severely whenever theres lots of explosions.  The system 4.00 upgrade did improve the framerate heaps, but by then i had almost finished the game."], ["thatonetarget20", "User", "10", "This is the best game ever!!! I bought with high expectations from the last game but this game not only got to my expectaion it exceeded it. There is just so much to do not including the epic DLC."], ["slickserpent99", "User", "9", "This is the first game I've played in a while that feels like a game. It is oodles of fun to pick up and relax with, for there are virtually no limits. Surprisingly enough, I like this game more than JC2. Just Cause 2 was great, but had problems with some repetitive missions, a terrible problem with de-spawning vehicles that you order, and a pretty much useless grapple tether that broke whenever you tried to pull something (at least in the PS3 version) but other than that, JC2 was a blast to play with a huge, beautiful world and loads of stuff to blow up. Just Cause 3 does that and more. JC3 is innovative over JC2 in it's own right, for JC3 has introduced us to the Wingsuit, which is a blast to play with, and the multiple grapple tethers with retract function allows for limitless possibilities for causing chaos. The story isn't anything special, in fact, its a little worse than Just Cause 2, but by no means does the story bog down the experience. People new to the JC series need to understand that you should go in expecting a game, not a cinematic, immersive story. Gamers and critics alike who write the game off as mediocre because of a bad story have little imagination when it comes to games, and need to get through any game with a strong story. I also see some people saying that the world isn't detailed, which is completely false. JC3's map has so much more depth to it than JC2. There are numerous cliffs and caves, and huge mountains to explore. Here in JC3, you don't need a story, all you need is your parachute and wingsuit, unlimited C4, varied and creative weapons, and explosions to have a great time as you're dropped into this massive, beautiful map."], ["indigobeast", "User", "7", "Just cause 3 is actually not that bad for a game like it is. The open world is humongous with days of gameplay to be had so it is great for spending time on. However the game can get repetetive very fast such as liberating every base and town. The story wasn't that great in my opinion and doesn't bring anything special, but the characters are quite interesting and quite funny at times and the voice acting isn't too bad either. But there is one thing the game has failed terribly at doing, THE DRIVING MECHANICS! The cars control very dodgy and don't always work they way you want them to which can end up being extremely frustrating, which can make the land races a mundane task as you'll be failing a lot at them. And don't get me **** started on those **** MOTORBIKES! They are completely uncontrollable and feels like you are driving on a **** ice rink, it is by far the worst vehicle I have ever had to control in any video game I have played period! avoid motorbikes like the **** plague in this game as they are completely broken! But the game overall is extremely fun and if you like blowing stuff up and enjoy open world games. Then this is a must buy for you."], ["GamingDrake", "User", "10", "The just cause series have gotten better with each game. Yes there's not much to it but its so much fun doing cool stunts, explosives and destruction. This game is like a cross between James bond, Red and the A team more leaning on the latter. if you like them then you'll probably like this. Its a game you switch off to and have pure gameplay fun. p.s love the intro song"], ["JyroJyro", "User", "7", "Without a compelling story or main character, Just Cause 3 relies on it's destructive gameplay rather too heavily to prop up the rest of the game. This is quite disappointing, given the initial glee I experienced at being able to destroy anything & everything with the innovative grappling tethers and wing-suit/parachute combo. If you want to feel like a pyromaniac god, this is the game to play. Graphics are also great, although be prepared to sit through tediously long loading screens to witness this"], ["Killercaden", "User", "8", "This game is a great free roaming game with a grappling hook and a parachute, can it get any better? Of course not! But they can make the story line a lot better though, but it is still a very fun game!"], ["AJC3317", "User", "7", "Just Cause 3 is the ultimate sandbox game for sandbox game fans. An incredibly huge map filled with tons of things just waiting for your explosive touch. The draw distance is fantastic, as you can see glimpses of settlements and military bases from way off in the distance. Anything you can see you can go to. Once you're at one of these settlements, the choice is yours as to how you go about bringing down the enemy encampments. You can sneak around, using your mystical grappling tether to pull objects down. You can quickly dart from object to object, planting explosives as you go. You can hijack a helicopter or tank and laugh at the puny reinforcements who try and stop you afterwards as you mow down everything in your path. I personally found the planted explosives route the best, as you have unlimited amounts of them from the start of the game and almost every object can be destroyed with 1 or 2 bombs planted on them."], ["Dolosais", "User", "7", "This one is ok i guess the fact that when it comes to gameplay its actually pretty fun the way you can blow some stuff up, but the framerates drops sometimes,story Decent,graphic ok"], ["dewdar", "User", "3", "Garbage. Absolute mess."], ["SonicClancy", "User", "7", "+ Brilliant Destruction"], ["Ishi123", "User", "5", "Wow. This game sure is innovative. I always thought that the idea of a sequel was to add MORE things to the original, but that just shows how narrow minded I am, it seems."], ["Fran0995", "User", "6", "Just Cause Series is the Bollywood  of the GTA series."], ["DanBenevenuto", "User", "7", "This game has nice graphics and a great story line, but, I got bored playing It after 3 days. The gameplay is a little weird with the hook and the parachute. So if you want to have a little fun, destroying everything, It is the right game to play !"], ["jonymancamulas", "User", "8", "The games is Quite fun to play but It gets a little repetitive, with the wingsuit, the explosions, and the challenges the game in the ps4 system has a lot of Keyframe problems"], ["Panzidane", "User", "8", "The game is cool, its gameplay is ok, its destruction is VERY COOL, however ... The game is just another generic game. A **** character returns to its origins, fight and is invincible, play without difficulty. His characters are generic, his story is generic. Just play the game and be happy."], ["theaman", "User", "9", "i love this game  is fun bad ass explosion city  and i love explosions  the graphics are amazing but the story sucks  but the missions  that are in the story are fun as hell"], ["Lee_Godspeed", "User", "6", "Just cause 3 is broken mess which is a damn shame as when you get on a roll with the game it's incredibly fun to play. Blow things up in many different ways. Drive, fly and sail wherever in a huge and beautiful map. All this and then some with the potential of been close to a 10/10 game but and a Huge but is that, it's so badly buggy and glitchy. I've had many unfair deaths in which there's nothing around or powerful enough to kill me but from not a scratch to a 1 hit kill from nothing in the area. Upon restart Ive started multiple times in mid air falling to my death. The game crashes far too much which has also corrupted a save file. The game needed more Q n A and Polish as it's feels like it didn't have any which is a shame as it's great fun. From its multiple settlements, collectibles and challenges to plough through its got the content for hours of enjoyment, if not hindered by the many bugs and glitches. Many I've not even listed"], ["TheHumbleGamer", "User", "8", "I would like to pretence this review by stating that I have not yet finished the game (though I have it over 50% completed at the point of writing this) and I also have the gold edition which means i have been able to play the DLC as well as the vanilla game."], ["Janker", "User", "8", "Although it can sometimes be a little repetitive, Just Cause 3 is a really unique and fantastic game. The world of Medici is beautiful and massive, the vehicles are plentiful and the destruction is awesome! What other game can you wingsuit of a heli and then blow up a bridge which then hurtles down debris onto the freeway below crushing all of the traffic? THIS GAME!"], ["really_mordax", "User", "8", "It's a silly, Hollywood style action game, plenty of explosions and action. Pretty generic storyline though no complaints on the execution. Not a fantastic game by any metric but a heck of a lot of fun for blowing off steam. Lot to see and do, though the story itself is short if you don't do the redundant side missions. I wouldn't spend a lot of money on it, but it's a good grab on sale (or free now on PSN)"], ["RaFfr0", "User", "7", "Despite having one of the worst driving controls ever, and an uninteresting story,  i can say this game is a lot of fun, especially if you likt to blow and destroy things, but not expect much more."], ["oni_no_oniichan", "User", "5", "Fun, but also generic and repetitive with terrible framerate and slowdown"], ["MannWithNoEyes", "User", "4", "Just Cause 3 is a very frustrating experience, in the sense that I should like it much more than I do. My biggest gripes with open-world games are their focus on story at the cost of gameplay. A very nice example of this is the Witcher 3's story, which, because it is so emotionally driven, requires constant attention. If the player decides they want to explore the world more or put more focus on the side content of the game instead of following the main quest for the majority of their playtime, the pacing of the story is broken and the magic is ruined. No matter how good that side content is, the story and main quest is ruined because the sense of emergency and realism is ruined. On the other hand, if they player decides to follow the story and ignore most of the side content, they will be unprepared for the more difficult moments of the story, and as a result their experience will contain a lot of harsh difficulty spikes. Furthermore, their experience will be a very limited one, as they are only following this one path in a sea of branching paths. In my opinion, the best open-world games purposefully create an environment where anything the player does feels like the right thing to be doing. Everything feeds into the experience instead of being their own separate entities. That is why, despite the universal criticism of it, I desperately wanted to like Just Cause 3, and in some ways I do. I like the amount of freedom the player is given from the very beginning of the game despite the fact that not everything is unlocked, which gave me the impression that this game was confident in its world for entertainment, and that gave me hope that the game would use its environment and its world to always keep things fresh. I like the movement mechanics, because the variety of ways to traverse the world allowed familiar areas to feel fresh. The movement on the ground, by contrast, feels restrictive and stiff by comparison. For example, it's weird that the game doesn't allow Rico to scope. I get that it was going for the 'arcade-style shooter vibe, but then why do the guns all have limited ammo? If their ammo was infinite, but the reload times were made more extensive, I may have overlooked this, but to me this minor flaw is a little jarring. The explosion effects are obviously pretty, if only because they're so over the top. The loading screens start acceptably, as they never break the flow to an unforgivable extent and mostly stay below forty-five seconds each, however they seem to increase in time throughout the game, and by the end go for a minute and a half. Another persistent flaw is how unpolished the game feels. In thirty hours, this game crashed about seven times, each of which signaled the end of a play session for me, which brings me to the most egregious part of the game: it cannot keep my attention. Despite the fun superhero-esque movement controls and expanse of beautiful fields, everything in this game is exactly what has already been seen. The environments are very bare in terms of variation, ninety percent of the environments are fields and snowy mountains. Sometimes the layout of the environment changes, which can really keep the game fresh, but that is all the game does to demonstrate its varied locals. Compare this to Horizon: Zero Dawn or Breath of the Wild. In both of these games there were a variety of environments, each with their own effects, enemies, and hazards. In Just Cause 3, there's no purpose in exploring because all there is to find is enemy camps and more fields. Despite the initial promise of an open-world game with focus on the world itself, exploring gets dull very fast. There's nothing to find and nothing but repetitive missions to do. This would be excusable if the main story was fun to follow, but almost every single mission ends up using the same mechanics, and instead of using the wingsuit, most of the missions use either the mediocre driving controls, or the simplistic shooting mechanics. Despite the fun that can be had through grappling up mountains or soaring through the skies, Just Cause 3 tries to place its focus on a world without variety, and as a result the whole game lacks variety as well, so I'm going to give Just Cause 3 a 4 out of 10."], ["ElKoala", "User", "4", "les invito a comprarse just cause 2, porque este no lo vale. lo obtuve gratis y solo por eso puedo entregar una critica, sino dudo que lo hubiese comprado solo con ver gameplays... pero si quires comprar este juego, te recomiendo primero buscar en youtube explosiones belicas, porque seguramente será lo mismo que el propio juego."], ["user12", "User", "9", "This games is incredibly underrated. Just Cause 3 has MANY downsides, and it does many things wrong. But it just offers you endless possibilities, and an infinite amount of things to do. What was the last game that showed you an enormous military base, and casually says, \"Go and destroy that!\" ? Just Cause 3 also offers you many ways. Do you want to call in an airstrike? Do you want to have a fighter jet dropped off to you at the push of a button, and then bomb it from above? Do you want to enter the base and plant C4 everywhere and detonate them? Or do you want to blow it up from a distance without even stepping foot inside the base at all? The choice is yours. Also, you will never see a copied and pasted military base in Just Cause 3. It's also very easy to get lost in the world of Just Cause 3, and how often does that happen in game worlds? Not very often. Just Cause 3's world is vast. INCREDIBLY vast. Although it's a bit shallow, lifeless, and empty, it's very, very varied. One minute, you could be in icy mountains, the next you could be in an arid desert, the next you could be in a forest, the next you could be at the bottom of the sea. The world is also limitless. Even right from the start, you can explore the entire map. No invisible walls, no boundaries, just a vast, limitless world of 400 square miles, waiting to be explored. Exploring is also fun, with the help of the wingsuit and grappling hook. The wingsuit and grappling hook combination has real physics and momentum, and with the right type of terrain, you can cover massive distances very quickly. Just Cause 3 is a must-play this generation. It's an explosive sandbox playground. Just Cause 3's downsides (mediocre storyline and narrative, bad writing, voice acting, sub-par graphics, lack of attention to detail) are outweighed by its upsides."], ["TopSlavenDvora", "User", "10", "This game came down to the mere mortals from the fingertips of the gods of the gaming industry and shed light in our eyes , and we understand the essence of this world.And yet there is multiplayer."], ["Joaumxinho", "User", "10", "Repetitive after some months but you stay like 1 month without playing and when u try to play again it will be to good square enix did well waring: lot of explosions"], ["SortOfCritic", "User", "9", "This will get very repetitive after a while, repeated town liberation will get boring. But it is an improvement to Just Cause 2 in every way, and I had a blast. Literally. There is so much mayhem to be caused and you can blow things up in a thousand different ways. For one who is looking for a deep game, in game play, story, or otherwise, you won't find it here. For one who is just looking for some plain old easy fun, you've come to the right place"], ["JPSantosS", "User", "9", "The game is great, not perfect and has its faults, but it has a great open world and the freedom to destroy things is isana, it makes the game a lot of fun."], ["bobobolas", "User", "6", "Just finished it. I played because it was for free with PSplus."], ["BaksCritic", "User", "9", "graphic 10/10"]], "platforms": ["PlayStation 4", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/7/75a3ebe95f8988a1a559e11793f1591b.jpg"}
{"publisher": "Square Enix", "genres": ["Action Adventure", "Open-World"], "rating": "N/A", "title": "Just Cause 3: Mech Land Assault", "release_date": "Jun 10, 2016", "avg_score": "64", "summary": "Mech Land Assault takes Rico Rodriques to the island of Lacrima, home to an abandoned eDen research facility and a prison camp ran by mysterious “Black Hand”. The island is defended by powerful Mechs so Rico will need the new Bavarium Power Core rifle to disable their shield and hijack them. Once Rico is inside he can use their powerful cannons and new GRIP Gravity Guns to hurls and mash the enemy into pieces.", "reviews": [["GameGrin", "Critic", "80", "In all, I’m happy with the DLC, just annoyed that it is so short. It’s fun to use the mechs and it’s interesting to learn more about Medici’s past for a lore hound like me."], ["Gaming Nexus", "Critic", "74", "Mech Land Assault is not here to make friends. This piece of DLC is made up of some of the most fun—and some of the least fun—you’ll have in Just Cause 3. It’s harder to get your hands on a mech than it should be, but it’s a power trip every time you do."], ["Vgames", "Critic", "52", "Rico Rodrigues returns once again to his island homeland of Medici. While exploring new areas, armed with a giant mech and a gravity gun like weaponry to aid to the total chaos and destruction. Mech Land assault DLC falls on the same trope of its original release. Repetitiveness ensues almost immediately."], ["CD-Action", "Critic", "50", "Mech Land Assault proves that Avalanche’s designers have tons of ideas on how to make JC3’s total chaos even more total, but not enough resources to implement these ideas properly. [09/2016, p.45]"], ["SuperkenGaming", "User", "4", "Just Cause 3 Mech Land Assault"]], "platforms": ["PlayStation 4", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/0/71ed527beceb7fabb145f1b246bd2f8b.jpg"}
{"publisher": "Square Enix", "genres": ["Action Adventure", "Open-World"], "rating": "N/A", "title": "Just Cause 3: Sky Fortress", "release_date": "Mar 15, 2016", "avg_score": "72", "summary": "Just Cause 3: Sky Fortress is the first PDLC pack from the Air, Land & Sea Expansion pass. Be the master of the skies with Rico's all new and fully armed, Bavarium Wingsuit. Save Medici from the threat of the terrifying Sky Fortress and its army of deadly robotic drones. This content pack includes new missions, challenges, the \"Bavarium Splitter\" assault rifle and the \"Evictor\" personal defence drone, all of which can be carried over into the main game.", "reviews": [["God is a Geek", "Critic", "80", "Sky Fortress takes Just Cause 3 in a completely new direction and opens up new gameplay possibilities for those who want to liberate Medici once again."], ["GameCritics", "Critic", "75", "Frankly speaking, I find Just Cause 3 to be a bloated, boring game full of wrong decisions and wasted potential, but there's no denying that strapping a rocket to Rico and owning the skies is pretty fabulous. It's not good enough to recommend buying the game, but for people who already own it, Sky Fortress is an absolute must-have."], ["Gaming Nexus", "Critic", "74", "Sky Fortress cranks up Just Cause 3’s bombastic effects more, if that were even possible. The addition of the jetpack wingsuit and Bavarium rifle make a video game-y video game even gamier. They change up the game enough—and in enough good ways—that I wouldn’t want to give back the new toys."], ["Brash Games", "Critic", "70", "The Jetpack does add a boost to the gameplay, and you do feel badass swooping around as Rico, but the overall experience does feel a tad too short – as soon as you begin to get into the game it is over, and this does feel like a real shame."], ["GameGrin", "Critic", "70", "A couple of new items, three missions and four new locations which won't take much more than a couple of hours to finish, but if you're looking for an excuse to return to Medici, this is it."], ["Push Square", "Critic", "70", "It may be hard to justify the price of this DLC if you're not a committed fan, though, but keep in mind that Sky Fortress really does make Just Cause 3 that much better."], ["Impulsegamer", "Critic", "65", "Just Cause 3: Sky Fortress is like an explosion: brief and kind of awesome. Not very substantial, but on the other hand: jetpacks."], ["rambosfist", "User", "8", "The story content is terrible and is super short. But for someone who enjoys the wingsuit and goofing around in the JC3 world, the new gameplay mechanics (jet pack!) are worth the price."], ["SuperkenGaming", "User", "6", "Just Cause 3: Sky Fortress"]], "platforms": ["PlayStation 4", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/7/3d428bdbf32aea28ac774755889a93b8.jpg"}
{"publisher": "Ubisoft", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "rating": "E10+", "title": "Just Dance 2014", "release_date": "Nov 12, 2013", "avg_score": "75", "summary": "Just Dance 2014, the sequel to Just Dance 4, is bringing all new moves with features for every motion control platform and over 40 of the hottest tracks and dances.", "reviews": [["PlayStation LifeStyle", "Critic", "80", "Just Dance is a guilty pleasure that few want to admit they are playing, but that everyone is having fun with, so give in to your heart’s desires and just… dance."], ["Playstation Official Magazine Australia", "Critic", "75", "The one and only PS4 difference – camera-only dancing –intermittently works. Woo. [February 2014, p81]"], ["IGN", "Critic", "75", "It's disappointing that the PS4 version of Just Dance brings nothing new to the table, and that it doesn't work as well with just the camera as it does with the Move, but it's still a lot of fun."], ["Push Square", "Critic", "70", "As long as you have a Move controller in your hand, then Just Dance 2014 deserves your A-P-P-L-A-U-S-E."], ["Stafmeister", "User", "5", "Got this in the bundle when I bought my PS4. Probably would not have purchased it individually. This can be fun with a few people, however the Camera does not alway recognise everyone and it seems a bit random in it's scoring."], ["discobanco", "User", "1", "Basically same problem everyone else is mentioning. You get PERFECT scores without moving..."], ["Ateam043", "User", "2", "I cannot recommend buyers to get this game on the PS4."], ["RazerN", "User", "1", "Mixed bag, in one respect the kids like playing it and don't really notice the camera issues with scoring etc, on the other hand they are now bored of trying to get the dam thing to recognise they are standing there to begin with to start the game. No amount of hand waving, jumping up and down seems to work, I would say 70% of the time it fails to pick up the kids when trying to start a game. So now it's not being played as its too much effort to get going, ironically you can see from the heat map picture in game that its picking them up perfectly, but I think they have done a rushed job in the development."], ["Guy_McDude", "User", "0", "Entirely defective. I can't get the game to detect a single person. I know it's not the camera because it worked in the playroom. Don't buy this game by any means. And shame on the reviewers for giving a game that entirely fails to function anything other than a zero. If ever there were a greater example of publisher to reviewer payola this would be it."], ["Jorio", "User", "4", "Same thing here, it doesn't recognize my daughter, she has to jump on the couch to play. Scoring issues are unforgivable, its not a game if you can do a perfects without even moving. Very disappointing to see them release songs after songs as we are waiting for a serious update."], ["koolkyle1010", "User", "0", "Don't even know what to say worst possible game i have played yet. Can never get a good score, and not sure if it is the camera or the game that just can't see what i'm doing, I do the move and get a crap score. The older versions of just dance I found way better and not rushed or camera problems such as this one."], ["kunalbahl", "User", "8", "So if you are looking for a fun game when you have your friends or family over - then this is a good fit on your ps4. You can either use the party mode or the workout mode which displays a calorie counter as well. The calorie counter seems to be quite accurate and displays different results for different people depending on the size, height, etc (I guess). There are a few glitches which if fixed by an OTA update would be great - the camera sometimes switches between people, stops recognizing you for a few seconds and can only detect 4 people (6 in the Wii U). Make sure you place the camera at the correct height and direction for it to work and give good results."], ["stefer", "User", "6", "It's OK but seems to not recognize every move.  The game feels rushed."], ["WoshJills", "User", "5", "Either the camera or the game sucks at picking up multiple people. That said, it's a fun game which is great at parties and for bringing friends as well as family together. Good, wholesome, fun."], ["thebiggerD", "User", "4", "This game is fun and all, but overall, it it suckish. Dance Central IS SIGNIFICANTLY BETTER! Too bad there's no PS4 version."], ["Araiz", "User", "8", "Just Dance is a guilty pleasure that few want to admit they are playing, but that everyone is having fun with, so give in to your heart’s desires and just… dance."], ["Nel", "User", "7", "If you are looking for a party game this isn't bad, the camera picks up your moments semi-good, and you will have lots of fun dancing with friends.  The game is great for what is it made for."]], "platforms": ["PlayStation 4", "PlayStation 3", "Wii U", "Xbox 360", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/5/65ae25fe451d95ceb593049007e769e8.jpg"}
{"publisher": "Ubisoft", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing"], "rating": "E10+", "title": "Just Dance 2015", "release_date": "Oct 21, 2014", "avg_score": "72", "summary": "Since its launch in 2009, the Just Dance franchise has become the world’s top selling dance video game and a mainstay of popular culture. And the game is back again this year with Just Dance 2015, bringing hot moves and new features to 40+ current hit songs and throwback favorite tunes. Let loose with friends and family by dancing to hit songs like “Happy” by Pharrell Williams and “Burn” by Ellie Goulding. Staying true to the Just Dance personality, there are also legendary favorites like “Walk This Way” by Run DMC & Aerosmith and a chance to dance to Tetris moves!  Get ready for this year’s fun and quirky dance moves that have something for everyone in your family or group of friends.", "reviews": [["Vandal", "Critic", "80", "This is one of the best episodes of the series. Thanks to the possibility of using smartphones as controllers playing with friends is going to be easier than ever."], ["TheSixthAxis", "Critic", "80", "Just Dance 2015 is a polished and enjoyable product, and whilst it’s potentially still behind the Dance Central series in a few key areas, including the way it monitors player actions, it makes up for this with its trademark styling, a strong collection of songs and intuitive online features."], ["LaPS4", "Critic", "78", "Just Dance 2015 gives us, once again, the perfect chance to turn our saloon into a dance floor. However, the lack of remarkable new things may be a problem for those looking for something new."], ["PlayStation LifeStyle", "Critic", "75", "They say if it ain’t broke, don’t fix it, and Just Dance is a series that remains the same at its very core simply because it works."], ["Push Square", "Critic", "70", "Overall, Just Dance 2015 is much like its predecessors, but in the struggle to do something ‘new’ with the game, Ubisoft has added a lot of features that are not really worth bothering with."], ["Gamer.nl", "Critic", "65", "A new track-list and a variety of fun features make Just Dance 2015 a nice dance game. But the lag and the fact that only one profile can  be used in multiplayer are a big party-stopper."], ["JeuxActu", "Critic", "65", "We saw this coming: the Just Dance series begins to show some signs of fatigue. Less tracks, no big new feature, nothing to push us to spend 50 euros in a game."], ["Playstation Universe", "Critic", "65", "Just Dance 2015 is definitely fun to play, especially with family and friends, but the inconsistency of the scoring system brings into question whether it actually does track your moves accurately."], ["superfields", "User", "1", "What a dud, could not get the camera to see me whatever I did! Took it back to eb games and they said they were not aware of any problems, yet YouTube had videos showing gamers with the same difficulties. Luckily they took mercy and I got a credit. As for Ubisoft this is a how can you release a faulty game do you even test them? Back in 2012 they did the same thing with rock smith 2012 which again was plagued with tuning issues making it impossible to play. Till this day that game is still not working but they quietly moved on to 2014 and jacked up the price this time it works."], ["Polarweii", "User", "8", "Not bad for killing time. Playing with family is fun. The graphics and Interface very good , but sometimes the camera cant recognize us, it is very frustrating."], ["RazerN", "User", "0", "Just Dance 14 with ps camera was a truly awful experience for the kids, after a week we stopped playing it. No matter how much hand waving, jumping, moving the camera we did, would only recognise the kids 30% of the time, and rarely when more than one tried. When working it would switch the kids around or lose them. I was hoping Ubisoft would have sorted the problem for 2015, but appears they just don't care. At least I had the common sense this time to take the kids around to a friends house to try 2015 before shelling another £50 on a flawed game. Money saved this time, but more disappointed they could not be bothered to fix the issues from the first game."], ["Avin1973", "User", "5", "My daughter and wife are disappointed, Ubisoft removed individual Dancer Cards. Support was awful, repeating I could create them like in JD2014. It took 3 days for the support tell me they removed it."], ["alehmarchiori", "User", "10", "The game is good but i really think is more easy than 2014 version, i just spend two days and i complete the all dances with 5* stars, is really more easily than others version but is graphs are amazing"], ["Otakkun", "User", "0", "There's no other score but a 0 for a game that doesn't work. I bought this game for my kid who loved the game at first sight on a mall (running on a xbone) where it worked like magic. Bought the camera and the game for my ps4 and it just wont recognize her no matter what I do. Garbage."], ["DepthExc", "User", "0", "After multiple attempts at starting a game, rearranging the camera, the lighting and the setting, the game is still unable to recognize the children as people on the PS Camera. As such, my children (10 and 5 yrs) can't play it at all. Returning the game to the store."], ["SmithROrus", "User", "0", "This game just sucks because it does not work properly."], ["Thegodfatherson", "User", "5", "After playing Just Dance 2015, I realized that how horrible the PS Camera works. The motion detection is REALLY BAD. I Personally think that you should go for the Wii or Wii U version of this game, because in Xbox and Playstation- it sucks. The song selection is good, with new pop songs added and some calorie burning game modes as well. Those were fun, what's not is that my experiance is being detracted from thye bad camera and horrible motion detection. If Sony would fix the camera and sell it again, I would buy it. Until then, Just Dance 2015 is a fun game that falls really hard becuase of the camera."], ["ChoBroooo", "User", "8", "Before I start this review, I want to say that this is the first console version of Just Dance that I have ever played. And it has to be the best version. Well Kinda."], ["castelliar", "User", "5", "it's always pleasure to play such creative games, but I don't get this one. while you're just standin' still and doin' nothing you get perfect scores, and while you're dancin' the camera loses your movements. i love the idea of the game but that camera is really **** oh god why"], ["Nel", "User", "6", "Just dance  14, was a superior to this in many ways. This game had several glitches, and the camera had a really hard time picking anyone up. The game has as always several songs, mostly popular pop songs, but it's still a solid game for a few hours"]], "platforms": ["PlayStation 4", "PlayStation 3", "Wii U", "Xbox 360", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/9/ffe63c24e1c17a3ff5fa10623c381a05.jpg"}
{"publisher": "Ubisoft", "genres": ["Action", "Rhythm", "Dancing"], "rating": "E10+", "title": "Just Dance 2016", "release_date": "Oct 20, 2015", "avg_score": "73", "summary": "Bust some moves to \"Uptown Funk\" by Mark Ronson ft. Bruno Mars and feel the beats in \"All About That Bass\" by Meghan Trainor.", "reviews": [["InsideGamer.nl", "Critic", "80", "It is easy to be the best if you are the only one, but Ubisoft still works hard on its fluorescent dance franchise. It was a good idea to extend the video content so we can watch people dance from all over the world. The introduction of Just Dance Unlimited is still somewhat small, but it has definitely potential to become a Netflix dance game."], ["Brash Games", "Critic", "80", "Its fresh song list, hilarious dance moves and memorising graphics will keep you and your friends entertained for hours, with some always demanding more each chance they get. Just maybe, be careful what songs you do in front of your parents, or you kids."], ["Push Square", "Critic", "80", "Just Dance 2016 is great fun for people of all ages, and is an excellent game among friends."], ["JeuxActu", "Critic", "80", "After a bad Just Dance 2015, Ubisoft Paris has learned from its mistake and now gives us Just Dance 2016, one of the very best games of the IP with its high quality playlist and its overall generous content. A must-have for fans of musical games."], ["LaPS4", "Critic", "79", "It's time to dance again, and Just Dance 2016 turns the music on. Songs for everyone, in an iteration of the franchise that goes all out for the social aspects. The fact that you can use a smartphone instead of a camera is yet another success."], ["TheSixthAxis", "Critic", "70", "Just Dance 2016 is a one trick pony and if you have beers and friends, or children who need to be entertained, it’s a great way to spend a few hours. As a solo game it’s a bit dull and you do start to notice that the tracking of your dancing is dubious to say the least."], ["God is a Geek", "Critic", "70", "Just Dance 2016 is best when playing with friends and family, but it's no more than a mild improvement on the last."], ["PLAY! Zine", "Critic", "65", "Dancing on the very edge of a recycle bin, Just Dance revamps what's so great about it every year. But the formula might just be losing its momentum, due to repeating."], ["Playstation Universe", "Critic", "65", "Fun but flawed, Just Dance 2016 is wildly entertaining with family and friends and offers instant pick-up-and-play appeal, but it needs a serious rethink in terms of its scoring system, track list and identity if it’s to continue to be a success."], ["Game World Navigator Magazine", "Critic", "64", "For previous Just Dance games you had to use specialized controllers like PS Move; now you can make do with a smartphone. Problem is, when you’re holding the phone in your hand, it’s very hard for it to know what your left leg is doing, so JD 2016 assumes the best and awards you much more score than you deserve. [Issue#203, p.68]"], ["jdeamaral", "User", "1", "Why are they selling me a stream service when i bought a game. Ubisoft is pissing me off! They are trying to be Netflix or Shomi or whatever streaming service you actually like. At first what I thought was a \"thank you fans for your continuous support\" was a down right wallet grab. I got this for my nine year, who doesn't understand what line she can use and which lines are for \"streaming\" ARE YOU **** KIDDING ME???? From this point on I will buy all UBISOFT games as Used games. **** THEM!!!"], ["sylvioros", "User", "6", "(WARNING: Do not buy Gold Edition or you may end up with a standard edition, no Just Dance Unlimited code to redeem.)"], ["RazerN", "User", "2", "A good line-up of songs but serious issues. I can't believe they have not improved the camera support. It really is no better than JD2014, with my kids frequently giving up from starting a game as it did not pick them up."], ["davidkucaj", "User", "10", "This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year! This is the best game of the year!"], ["Nel", "User", "6", "Great game if you have all the tools, ps4 move is great with it, but without it it's nothing, but a frustrating camera experience. The game  has good content, but the cost of the actual equipment drags it down."], ["dylan1601", "User", "10", "buenas canciones, clasicos de ayer y hoy y los pasos son unicos y no vistos e otra parte y la gran tecnología que tienen en los fondos es brillante es muy bueno"], ["Bat4023", "User", "0", "Just dance 2 and 4 were extremely fun but now Ubisoft is turning into a pay to enter game and you have to pay 30 to 40 dollars already. Extreme infuriating that Ubisoft is poisoning their just dance franchise."]], "platforms": ["PlayStation 4", "PlayStation 3", "Wii U", "Xbox 360", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/8/68dfe7d8826c81168253eb8bf429987a.jpg"}
{"publisher": "Ubisoft", "genres": ["Action", "Rhythm", "Dancing"], "rating": "E10+", "title": "Just Dance 2017", "release_date": "Oct 25, 2016", "avg_score": "73", "summary": "Grab your friends and family because it's time to dance! The biggest music video game franchise of all time is back, with over 60 million units sold. Just Dance 2017 brings you over 40 new tracks, six game modes, updated content all year long and access to 200+ songs through Just Dance Unlimited!", "reviews": [["GameCrate", "Critic", "90", "It’s always good to end on a high note, and that’s exactly what Just Dance 2017 will be doing if it ends up being the final physical entry for the franchise."], ["Vandal", "Critic", "80", "Just Dance continues to build upon is successful formula, polishing and expanding its concept to reach wider audiences."], ["SpazioGames", "Critic", "75", "Few additions and a great new tracklist make Just Dance 2017 advisable to purchase for another year. Companion App works very well. Just Dance 2017 brings fun again."], ["IGN Italia", "Critic", "75", "The usual funny, colorful and loud Just Dance, with a way more improved playlist and a new mode. If you like to dance and party, it's the right choice."], ["PSX-Sense.nl", "Critic", "75", "Just Dance 2017 once again plays it safe. If you're looking for a fun party game, look no further. If you're looking for innovation, you won't be able to satisfy your needs here."], ["XGN", "Critic", "75", "Just Dance 2017 is another solid entry in the franchise, although it has its flaws. The game is rich of content, but some of that content is locked behind a pay wall in the form of Just Dance Unlimited. Also, a lack of new modes is a missed opportunity."], ["Wccftech", "Critic", "75", "If you've played a Just Dance game before, any Just Dance game, you'll know whether or not you like Just Dance 2017. It doesn't add much to the series but is another bombastic, deeply enjoyable game to play as you accidentally break your living room furniture."], ["Eurogamer Italy", "Critic", "70", "Quotation forthcoming."], ["Atomix", "Critic", "70", "Just Dance 2017 takes all the things that we saw on the last year edition, even it lacks of truly innovations, it has a new music selection that probably will be enough to the casual players that enjoy this kind of experience."], ["Critical Hit", "Critic", "70", "Even if Just Dance 2017 isn't the greatest game, it's still a whole lot of fun. If you have previous iterations, I'm not sure the new modes or songs are a reason to upgrade, but if you don't have a home dance game, this is well worth picking up for kids or partying adults."], ["JeuxActu", "Critic", "65", "It's no a surprise, after a successful Just Dance 2016 at all levels, Ubisoft fails with this Just Dance 2017 which is lack of new features. Worse, the playlist and the choreographies are really disappointing. Too serious, not enough fun."], ["Push Square", "Critic", "60", "Just Dance 2017 may be a good dancing game for anyone who doesn't take themselves too seriously or wants to have a good time with friends, but if you bought 2016, then don't bother. The new Just Dance Machine mode is fun, but it's hard to justify a purchase unless you're a big Just Dance fan."]], "platforms": ["PlayStation 4", "PC", "PlayStation 3", "Switch", "Wii U", "Xbox 360", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/6/8413a8854d3d9192ce3e0e8b1d7adc00.jpg"}
{"publisher": "Ubisoft", "genres": ["Action", "Rhythm", "Dancing"], "rating": "E10+", "title": "Just Dance 2018", "release_date": "Oct 24, 2017", "avg_score": "75", "summary": "No matter where you come from, how old you are, if you are a panda or a carrot: turn up the volume and get ready to unleash your inner dancer, because Just Dance 2018 brings out the dancer in everyone. Whether you are a party starter, a young dancer in the making or a pro dancer looking for new challenges, it's never been so easy to Just Dance. Dance your heart out to 24K Magic by Bruno Mars, Side to Side by Ariana Grande ft. Nicki Minaj, The Way I Are (Dance With Somebody) by Bebe Rexha ft. Lil Wayne and Chantaje by Shakira ft. Maluma. Relive classics including Daddy Cool by Groove Century, or if K-Pop is your thing get down to Bubble Pop by Hyuna.", "reviews": [["Meristation", "Critic", "85", "Dancing is one of the most fun exercises and Just Dance 2018 knows it. The popular dancing series is back with lots of amusing game mods and makes dancing a rewarding experience for oneself and for sharing with friends."], ["Critical Hit", "Critic", "80", "It might be the adrenaline talking, but I seriously got into Just Dance 2018. It’s a silly amount of fun combined with a serious workout and guaranteed to have you grinning along when you pull off a sick move."], ["Everyeye.it", "Critic", "80", "It continues to work great."], ["Digitally Downloaded", "Critic", "80", "The Just Dance franchise hasn’t grown a lot since its heyday, but it doesn’t need to. Most of the songs included are a lot of fun to dance to, even if pop music isn’t your thing. The gashapon reward system offers an incentive to keep dancing without making it feel like rewards are constantly out of reach. Grab a friend and clear the lounge-room, because it’s time to get addicted to dancing all over again."], ["Areajugones", "Critic", "80", "Just Dance 2018 is an improvement over the previous version; everything that was already working has been improved, the menus are now more intuitive and simple, and Ubisoft is still thinking about the kids in the house. Without a doubt, it will be one of the great successes of this Christmas, especially in the Nintendo platforms."], ["XGN", "Critic", "75", "Just Dance 2018 is a blast to play for young and old. The newly introduced kids section brings old and new songs to the table for the smaller ones, while the rest of the game delivers a wide variety of popsongs. Every dance fan can eat their heart out."], ["Vandal", "Critic", "75", "We miss more modes, but this year's additions are interesting. It looks like there isn't much room for innovation, so you already know what you're going to find."], ["Game World Navigator Magazine", "Critic", "74", "Track list ranges from Boney M and Queen to Shakira and PSY – about 40 songs in total. Thankfully, each PS4/Xbox One/Switch copy of Just Dance 2018 comes with a 3-months access to songs from previous titles, bringing total count to several hundred – more than enough for a party (and to drive your neighbors completely nuts). [Issue#225, p.66]"], ["PSX-Sense.nl", "Critic", "70", "Just Dance 2018 is exactly what you've come to expect from this series. It's a lot of fun, especially now that you can use your smartphone to participate."], ["Playstation Universe", "Critic", "70", "Pretty much the same, boringly dependable Just Dance experience at heart, but the addition of a kid friendly mode makes this far more worthy a purchase for front room dance fans than the last few iterations."], ["3DJuegos", "Critic", "70", "A very little evolution in the Just Dance series. Ubisoft should make a bigger effort in next entries if they want that the party go on."], ["JeuxActu", "Critic", "55", "Just Dance 2018 is clearly a game to forget as it's merely a copy of the previous games in the series, but we can only notice the drop in quality that goes along whether it's the dull playlist or the uninspired dance moves. A textbook case of badly recycled content."], ["Xbox_Alive", "User", "8", "As far as the Just Dance series goes you either love it, or you hate it and there never seems to be an in between. Personally I actually quite like the series because it encourages you to keep fit and interact with friends and by doing this you end up having quite a lot of fun. The selection of songs this year is pretty good and they’ve got a very good mix of some classic songs and of course some new songs. Some of the harder and more complex songs are very hard to do though and this is mainly down to the lack of a decent tutorial. I did however notice that they’ve improved the hit detection when playing with your mobile device, and it was a lot more responsive which is great because this really did need improving. Unfortunately though that’s where the improvements stop and nothing else has really been changed much, which is a shame because the World Dance Floor mode especially would have benefited from some slight changes. Once again the game’s biggest draw is its replay value and without a doubt there is a huge amount of it here. It’s actually pretty addictive when playing at parties and with family and friends so expect this to be a game you will revisit multiple times. I just wish that you didn’t have to pay in order for you to get more songs because buying the game should be enough. The presentation side of the game is something I really enjoyed. The visuals especially made me enjoy it because the game is packed full of colour and each song has its own unique style. At the end of the day if you’re a fan of the Just Dance series then you will definitely have some enjoyment here. Unfortunately though if you’re not a fan of the Just Dance series then this game will not make you become a fan because nothing much has changed and in order for this series to stay relevant they have to make more changes because it only just does enough to get a recommendation from me."], ["TJgames1", "User", "0", "It's missing a lot of things I find it half incomplete because it is not as full as the Nintendo Switch,"], ["Madonnarainhado", "User", "10", "It's been great to keep up with this game, in addition to having a number of fantastic alternatives, the game includes the queen of just dance 2018, Katy Perry. Basic choreographies can be lively and calm, example shape of you and John Wayne."], ["Heliosantoos009", "User", "10", "Alem de estar um jogo totalmente diferente de todos os outros, o jogo trouxe algo inovador para as pessoas que curtem músicas e coreografias mais lentas, isso depende muito de cada pessoa, o jogo está otimo, porem faltou aquele toque de mais alternativas. Mesmo assim 10/10"], ["Jujuabreu002", "User", "10", "Simplesmente adorável EU TO AMANDOAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA MELHOR JOGO DO MUNDO AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA"], ["pamelahduson", "User", "10", "estou apaixonadaaaa uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu melhor jogo do mundoooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo"], ["JonasCroft", "User", "1", "Honestly, it's not very good. Although the UI and menus are constantly becoming better, some cool resources, like Karaoke while dancing, Community Remix, Dance Quest or, EVEN MORE IMPORTANT, MASHUPS, disappeared in this 2018 version."]], "platforms": ["PlayStation 4", "PlayStation 3", "Switch", "Wii U", "Xbox 360", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/0/ff4762c6b847e777b3ac439df5f22dfd.jpg"}
{"publisher": "Ubisoft", "genres": ["Action", "Rhythm", "Music"], "rating": "E10+", "title": "Just Sing", "release_date": "Sep  6, 2016", "avg_score": "60", "summary": "Featuring a tracklist, including smash hits from Sia, Justin Bieber, Meghan Trainor, and more, you'll always be in tune. With the free Just Sing Companion app, your smartphone is all you need to play.", "reviews": [["IGN Spain", "Critic", "65", "Not the deepest karaoke experience that we have played. We were expecting a better game or at least a completely licensed one."], ["Stevivor", "Critic", "65", "Just Sing isn’t bad; it’s a good karaoke game marred by presentation problems, or, a half-decent party title."], ["Vandal", "Critic", "65", "Just Sing is a good party game, but a bad karaoke. Depending on your priorities, it can be a good choice."], ["Gameblog.fr", "Critic", "60", "As expected, Just Sing is The Just Dance of karaoke games. It doesn't care about precision or performance. It's just here to let people have fun on some popular songs, with the possibility to make some quite hilarious videos."], ["LevelUp", "Critic", "45", "Just Sing seemed like a good idea when the trailer of the game was first shown... the result is different, though. The companion app does not work as it was supposed to and the experience of a great singing performance is not gratifying. This is merely a poor Just Dance adaptation to a karaoke game. The only salvageable aspect of Just Sing is a music selection made to please all tastes."]], "platforms": ["PlayStation 4", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/2/657cb87f47f20ff284f57d2aca590fb4.jpg"}
{"publisher": "10tons", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "rating": "T", "title": "JYDGE", "release_date": "Oct  3, 2017", "avg_score": "76", "summary": "Build your JYDGE. Enter Edenbyrg. Get out alive.", "reviews": [["God is a Geek", "Critic", "90", "Jydge is great. Not only is it inexpensive, but it offers a lot of diversity in terms of builds or play styles. If you want to make it to the end, you’ll certainly be required to branch out and test the waters, but this only led to more fun in my experience."], ["GameCritics", "Critic", "90", "JYDGE isn’t very long, but it’s incredibly wide, and its winking embrace of  ’80s-style ultraviolence should charm both devotees of the franchises that inspired it and anyone who can appreciate a clever shooter."], ["Critical Hit", "Critic", "80", "Jydge is superb in its approach to a niche genre. It’s violent, it bends to your particular whims thanks to an onslaught of constantly available upgrades and it never takes itself too seriously as you dispense instant jystice."], ["PlayStation Country", "Critic", "80", "With its smartly constructed levels and deep customisation options, JYDGE is 10Tons' best twin-stick shooter yet."], ["Vandal", "Critic", "77", "JYDGE is fun, offers a lot of replayability and adds a great coop mode. It's not unforgettable, but it's definitely enjoyable."], ["Gaming Age", "Critic", "75", "In other words, it’s a cross between Robo-Cop and Hotline Miami, thrown over whatever twin-stick shooter floats your boat. It doesn’t do much for me, and I suspect that, in years to come, if I ever try to recall Jydge I’ll have a hard time differentiating it from Neon Chrome, but if you just want a solid twin-stick shooter, it’ll do."], ["PSX Extreme", "Critic", "75", "If you played Neon Chrome or other similar isometric twin stick shooters and enjoyed them I would recommend giving this one a go. At first glance it doesn’t seem like much but once you get into the meat of it you’ll realize that there is more then meets the eye. The game is short but has some depth."], ["PSX-Sense.nl", "Critic", "75", "It's a shame the game forces you to replay certain sections in order to experience the whole thing, thus making JYDGE a lot more repetitive than it should be. If you are able to overlook this minor complaint, JYDGE comes highly recommended."], ["Video Chums", "Critic", "72", "Jydge is another entry in 10tons line of competent twin-stick shooters. The robust upgrade system and loadout options are its best features but the campaign is dragged down a bit by a lack of unique levels and being forced to replay them multiple times."], ["CD-Action", "Critic", "70", "Jydge’s core mechanics are solid and the means to customize the character in meaningful ways that impact the gameplay are almost ridiculously extensive. Unfortunately the game becomes wearisome quickly, as it offers only 18 short missions and the grind-based progression system makes you replay them over and over again with slight alterations. Jydge also doesn’t look good and voice acting is laughable. [13/2017, p.45]"], ["Cubed3", "Critic", "70", "Ultimately, this is a strong twin-shooter that might be a little too confident in how much people will enjoy replaying older stages on a higher difficulty."], ["Push Square", "Critic", "70", "JYDGE is an enjoyable twin-stick shooter that has a fun and destructive core mechanic and a lot of replay value. If you’re a huge fan of twin-stick shooters it’d be a crime not to give this one a try and judge it for yourself."], ["GameSpew", "Critic", "60", "Jydge has been found guilty of conspicuous padding and needless repetition, and my sentence will see it placed in a comfy resort prison with all the other decent games when it could have walked free this very day as one of the good ones. Let this serve as a warning to all other perpetrators who would seek to increase value through nothing more than a shallow investment of time."], ["FriedConsole", "User", "8", "This is 10tons making another game like is a really good game but lacks anything that makes it special.    This is pretty much a Hotline Miami game but it is a lot easier thanks to the upgrades that you will eventually unlock if you are stuck on a level.  Biggest flaw is that I have trouble noticing the enemies until they move as they just blend into the backgrounds.  I have a lot of fun playing this game but will probably forget about it soon after playing."], ["foxviewchannel", "User", "8", "10tons Ltd. is an independent games developer based in Tampere, Finland. They have a great collection of unique titles. My personal favorite is Crimsonland, an intense and addictive game that I enjoyed playing with friends."], ["GBG_Jason", "User", "8", "10tons is on a roll recently, filling my time with their own take on the Hotline Miami formula. Their newest release Jydge comes just a few weeks after releasing Time Recoil (you can see Chad's review of it on Metacritic and the Garage Band Gamers site). This entry is set in the universe of Neon Chrome, where the criminal element has gotten a little out of control, so the powers that be have initiated the Jydge program, which is essentially the love child of Robocop and Judge Dredd."]], "platforms": ["PlayStation 4", "iPhone/iPad", "PC", "Switch", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/2/e0bc6e83d07a952910da1eeb9d75b58a.jpg"}
