{"publisher": "Milestone", "genres": ["Racing", "Simulation", "Automobile"], "rating": "E", "title": "Valentino Rossi The Game", "release_date": "Jun 17, 2016", "avg_score": "75", "summary": "A videogame entirely dedicated to the career of Valentino Rossi, the 9 time World Champion. Experience the career of Valentino from his perspective in a series of 20 challenges from his first race in 1996 up to 2015. Jump into a new career starting at the VR|46 Academy and taking you up to World Champion. During the championship, Valentino will ask you to take part in different events like drifting, flat, R1M-only races, and rally in order to improve his abilities.", "reviews": [["GameGrin", "Critic", "85", "Valentino Rossi The Game marks a significant leap forward for Milestone s.r.l, it has created an excellent MotoGP experience, managing to capture the career of biking legend. This is a must buy for fans of The Doctor, and anyone that likes bikes!"], ["The Games Machine", "Critic", "85", "Valentino Rossi The Game is the best videogame by Milestone so far, full of things to do and a good physical engine under the hood. Some issues still need to be fixed, but the overall vision (from the previous MotoGP games) is preserved, and even enhanced. Give it a chance."], ["Pelit (Finland)", "Critic", "80", "A competent take on MotoGP-series. The Rossi-themed new events are fun. Audiovisual aspects are a bit bland and the multiplayer is already pretty much dead at this point. [Sept 2016]"], ["PSX-Sense.nl", "Critic", "80", "The complete package for every Moto GP fan, even if there's still some (minor) room for improvement."], ["XGN", "Critic", "80", "Valentino Rossi is a living legend. Milestone named their next MotoGP game after him and oh my... What a good game. This is very promising for future games to come. Rossi is already a legend, but this game might just become a legend too."], ["3DJuegos", "Critic", "80", "Appealing and a very complete racing experience. A bit tough around the edges in some areas, but a great effort nonetheless."], ["God is a Geek", "Critic", "80", "Valentino Rossi: The Game may be too much of an advert for the motorcycle legend himself, but it finally brings the MotoGP series back to the top of its game."], ["Multiplayer.it", "Critic", "80", "Valentino Rossi: The Game is the largest chapter of the MotoGP series, with plenty of content and a revamped career mode. The good work done by Milestone is undermined only by the dated graphics."], ["IGN Italia", "Critic", "80", "Valentino Rossi: The Game is the official MotoGP videogame for 2016, with tons of content and features, and good gameplay."], ["IGN Spain", "Critic", "79", "The different disciplines added as a tribute to Valentino Rossi are enough to fill the content of a video game that as MotoGP 16 would have been more of the same."], ["Everyeye.it", "Critic", "78", "Valentino Rossi The Game needs more care for aesthetic, the driving system is not perfect and still suffers from some physical inaccuracies. However, the game has accomplished a big result: it is not a plain racing game, it's a game about passion for racing."], ["Hobby Consolas", "Critic", "78", "As MotoGP 16, there are no playable or visual changes compared to previous years, but, as a tribute to Valentino Rossi and the last twenty years of the World Championship, this game is worth it."], ["GameOver.gr", "Critic", "70", "Even though some of its gameplay elements don’t really work (like, for example, the driving sessions) Valentino Rossi: The Game if full of Milestone’s “know how” of the genre and offers a complete motorcycle riding experience."], ["Brash Games", "Critic", "70", "Valentino Rossi: The Game is a solid entry in the long running MotoGP series made all the better for the inclusion of the Valentino Rossi inspired, Legacy Mode."], ["Gameblog.fr", "Critic", "70", "Quotation forthcoming."], ["IGN Sweden", "Critic", "65", "Valentino Rossi: The Game is a good racing game, it feels good to drive and the physics works pretty well. Fans of Valentino Rossi might find more enjoyment in the game than the more casual players, though."], ["Game Revolution", "Critic", "60", "As a racing experience, though, this was generic. Obviously, mileage will most certainly vary depending on how big a fan one is of the world of MotoGP. At best, for fans of Rossi himself, this is at least a rental."], ["JeuxActu", "Critic", "60", "Valentino Rossi The Game is a tribute to the Italian motorbike pilot, glued with the yearly MotoGP game. With few improvements over the past ones, this game will mostly appeal to VR42 fans, and Moto GP fans."], ["Critical Hit", "Critic", "60", "Valentino Rossi: The Game knows everything there is to know about the man behind the number 46. I just wish it knew a little bit more about crafting an exciting MotoGP game."], ["theczarek", "User", "9", "good game, good motorbike feeling, better then MGP15. if you like moto GP you should buy this game, if you like normal motorbike thinks, not sport - the Ride will be better."], ["Paul91Pop", "User", "10", "Iwas looking for a game that included the history of MotoGP, and this game nailed it. You can play 20 years of history with a huge roster of bikes and, generally speaking, I really enjoyed the game. Of course this is focused on Rossi s career, but the game is huge and it could entertain those who are not very fan of the Italian rider."], ["ASGaming21", "User", "10", "Milestone have done a great job making this game. It definitely feels like a day in the life of Valentino Rossi. Also I like how they brought some old tracks back like Phakisa and my favourite, Laguna Seca."], ["Cateye10", "User", "7", "Valentino Rossi the Game è quel tipo di gioco che non smette mai di stupire e non parlo da tifoso del grande campione romagnolo. Il gioco è vasto, completo, divertente e tecnicamente ben realizzato. Per non sembrare troppo partigiano ho cercato qualche pecca e le uniche che ho trovato sono così minuscole da essere veramente ininfluenti. Sicuramente il modello di guida delle quattro ruote non è al topo, ma considerate che si tratta di un gioco dedicato alle due ruote, dove la guida automobilistica serve solo a spezzare un po’ il ritmo. L’altra cosa che ho trovato sotto tono rispetto alla complessiva struttura del gioco, sono le corse Fast Track sull’ovale, che non sono al top per quel che riguarda il sistema di guida. Per il resto tutto è all’altezza della fama di Valentino Rossi: ci sono centinaia di schede sulla sua vita su due ruote, una modalità Carriera divertente ed appassionante, la possibilità di sfidare Valentino sui suoi tempi oppure quella di gareggiare nelle sue corse storiche. In questo gioco Milestone ha unito alla perfezione la sua ultradecennale esperienza nelle simulazioni di moto con l’omaggio ad un Grande (con la G maiuscola) come il nostro VR46"], ["IrisIris", "User", "10", "Career mode is really nice: you can create and customize your rider and then join a Moto3 team, making your way to the MotoGP championship. Between the main races the game makes you ride a flat track bike and a rally car, and any race increaces your rider's ability. You will need a lot of hours to complete your career (at least 4 seasons + extra events), therefore the lasting appeal of this game is really good."], ["Blasphemy", "User", "7", "Although there have been quite the improvements on graphics and gameplay, there is not much improvement on the AI area, they are still very easy to beat on the highest level, i sometimes have a 2 second + lead in qualifying if i really try my best, can't say its that great although the different gameplay does make it more interesting"], ["antony560", "User", "10", "Don't get fooled by the title: this is NOT a game about Valentino Rossi only. It's a complete game, with all the MotoGP 2016 and 2015 championships, Moto2, Moto3, historical bikes, flat track and much more. While I didn't like the rally mode (I'm not a big fan of cars) the amount of contents is impressive. One of the biggest motorbike games ever made."], ["Unstoppabull", "User", "10", "The game is a big step forward in comparison to MotoGP 15 and earlier years. It has dirt bikes, rally, racing and drifting. Online is not great (as always with a Milestone title) but single player is tons of fun. I especially like the historical events which you can play."], ["ElenaPop", "User", "10", "Legendary Valentino Rossi gets his own game... and it's pretty good! This is clearly a game of the MotoGP series that takes the name of Valentino Rossi and puts it on the cover, but the game includes a lot of new features. I was very surprised to see that the put even Monza Rally in the game. Even if this is mainly a MotoGP game, the new stuff they’ve put in it is fun to play!"], ["simonexxx9", "User", "0", "this game has a graphic of at least 10 years ago . It is not fun and the bike seems to fly on the slopes, there seems to be contact between the wheels and the track . In addition , the AI ​​of opponents appears to be that of Mario Kart , with all due respect to Mario Kart . 70/80 game that give him ten years ago was already so . Today one is the most that you can give to a game based only on rider name. Please stay away , after 3 games will regret having bought it . I still have to understand why we users had to pay taxes on this game as the main character did not pay."], ["mikehettfield", "User", "8", "A great evolution to the Motogp series, this time with tyhe inclusion of all those little things outside the races, makes you feel investe3d in the world of your rider, all te customization options are great and the bikes handle and sound way better than in other entries of the series, eveithing under the name of our most charismatic rider VR46"], ["narcisa", "User", "10", "Career mode is really nice: you can create and customize your rider and then join a Moto3 team, making your way to the  MotoGP championship. Between the main races the game makes you ride a flat track bike and and a rally car, and any race increases your rider's ability. You will need a lot of hours to complete your career (at least 4 seasons + extra events), therefore the lasting appeal of this game is really good."], ["Feanfan35", "User", "6", "On the whole t is a good game. Graphics best so far in MotoGp games. Sadly it's not treu to life, with old lay-out in spain and accept for Ducati, absence of winglets. Contacted Milestone an d never got a reply, wich is a shame..."]], "platforms": ["PlayStation 4", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/7/e432810a03b8671ad3197591bb810b4b.jpg"}
{"publisher": "Ubisoft", "genres": ["Platformer", "2D", "Action", "Platformer", "2D"], "rating": "T", "title": "Valiant Hearts: The Great War", "release_date": "Jun 24, 2014", "avg_score": "77", "summary": "The story of crossed destinies and a broken love in a world torn apart. All of them will try to survive the horror of the trenches following their faithful canine companion. In Valiant Hearts: The Great War, the lives of all these characters are inextricably drawn together over the course of the game. Friendship, love, sacrifice, and tragedy befall each one as they help each other to retain their humanity against the horrors of war.", "reviews": [["Digitally Downloaded", "Critic", "100", "In a way Valiant Hearts is a challenge to everyone in the industry; it's a challenge to the publishers churning out the same old \"war games,\" and it's a challenge to all the players that continue to buy into these games without really thinking about what they are playing. War isn't fun, and it has a real impact on the people that are involved in it. It's games like this one that, critically, remind us that there is a human side to war."], ["PlayStation LifeStyle", "Critic", "95", "This game made me shed more tears than any game I have ever played before, and I find that I am not alone in that sentiment. I even think this game communicated parts of WWI so well that it could be used as an educational tool, though the characters’ story is fiction."], ["DarkStation", "Critic", "90", "It offers an appreciation of the smaller struggles during The Great War while exposing its horrors. The characters are charming, the gameplay is interesting, the storyline is gripping, and the visuals are full of heart."], ["Playstation Official Magazine UK", "Critic", "90", "Compelling and respectful in a way few games can match. [Aug 2014, p.90]"], ["COGconnected", "Critic", "90", "Overall, I couldn’t have been more pleased with Valiant Hearts: The Great War. Beautiful art, moving music and a compelling story that has a heart wrenching and unexpected ending with plenty of subtext for you to chew on, it was an absolute treat to play."], ["Playstation Universe", "Critic", "90", "Valiant Hearts: The Great War delivers a moving story that will surely leave an impression on you. The UbiART engine delivers another great artistic showpiece telling a story through animation, a powerful and harrowing musical score and documentary-like narration. Valiant Hearts doesn't depict what war may have been like, it makes you feel it."], ["IGN Italia", "Critic", "90", "Valiant Hearts is quite a peculiar title: behind a simple (and even questionable) videogame lies a stunning experience than will warm your heart while teaching you actual history. If everyone played it, the world would surely become a better place."], ["Push Square", "Critic", "90", "Valiant Hearts: The Great War is a poignant and powerful reminder of the significant human toll borne of the wars that we so often act out in our favourite video games."], ["Eurogamer Italy", "Critic", "90", "Valiant Hearts is a masterpiece, a game that combines gameplay and narration so well that it should be an example for every game designer. And it can teach you a thing or two about the Great War and the human nature. You should really play this game."], ["God is a Geek", "Critic", "90", "Valiant Hearts tackles the harsh realities of what this war did to regular families. It tore people apart and, conversely, brought strangers closer together. It’s a beautiful tale of love and woe, with a consideration for the chilling realism of war."], ["XGN", "Critic", "90", "Ubisoft did it again. After Child of Light there is again a unique downloadable game. Valiant Hearts: The Great War is a compelling puzzle game, a must have. It has a funny look but it's actually a game with many layers."], ["NZGamer", "Critic", "87", "So in the end, Valiant Hearts is something of a flawed masterpiece. But it’s a masterpiece nonetheless. This is a game that definitely won’t be for everyone, but it’s something that the videogame industry has been in dire of need of."], ["LaPS4", "Critic", "87", "Valiant Hearts: The Great War is one of the best graphical adventures you can find nowadays. Its beautiful visuals provided by UbiArt engine was already known as a good choice, so the surprise comes with the amazing story it manages to unfold."], ["GameCritics", "Critic", "85", "While it can be completed in less than six hours, it perfectly explores themes and concepts that triple-A titles still have difficulty grasping: gray morality, a poignant, thought-provoking storyline, and appealing gameplay that isn't based on killing everything in sight."], ["InsideGamer.nl", "Critic", "85", "Valiant Hearts: The Great War is a history lesson as you have not experienced it, ever. The story is full of touching moments, small pieces of joy and at the same time it shows the horrific impacts of war. The gameplay remains varied, although the puzzles are a bit repetitive."], ["Game Over Online", "Critic", "85", "Valiant Hearts’s low barrier of entry difficulty-wise makes it a perfect gateway game for those who don’t usually enjoy the genre. While the puzzles are simplistic, they’re also fun to solve and never get in the way of the interesting storyline going on."], ["Everyeye.it", "Critic", "85", "A very unique experience, which mixes delicate graphics to the gritty storytelling of the worst war the world has come to know. When it tries to be anything less than tragic, it might lack some of that energy, but it's still a game anyone should at least give a try."], ["Merlin'in Kazanı (Turkey)", "Critic", "85", "Valiant Hearts: The Great War is inspired by letters written during the Great War and has four characters on the battlefield. They sneak across enemy lines and solve puzzles to fight for their survival. The artwork looks amazing and is complemented by the game’s soundtrack."], ["JeuxActu", "Critic", "85", "After Child of Light, Valiant Hearts is another great game from Ubisoft on the UbiART Framework engine. And it proves the publisher can make something great, even with a tiny budget. Even with its WWI background, Valiant Hearts isn't just an historic documentary: it's really a story-driven title, which focuses on characters and successfully displays quite classic gameplay."], ["3DJuegos", "Critic", "85", "Hearts has been a total surprise, first for its historic fidelity and then for its gorgeous comic visuals. A master class not to be missed."], ["Vandal", "Critic", "84", "Behind the cartoonish visuals, there's a great game that deals with a conflict as deep as the World War. A beautiful experience on every front, we think it would have been released as a full retail game if launched a few years ago."], ["Games Master UK", "Critic", "83", "Never syrupy, sensationalized, or cliched, but dulled by puzzles that veer between easy and illogical. [Sept 2014, p.72]"], ["Gamer.nl", "Critic", "80", "The heartbreaking First World War is a perfect setting for games and as expected with Valiant Hearts, Ubisoft delivers a beautiful, intimate tearjerker. It certainly does not excel in terms of gameplay, but this is compensated, by strong, impressive artwork. The world is so attractive that they could have skipped the puzzles to make an animated film instead."], ["Giant Bomb", "Critic", "80", "Ubisoft Montpellier's take on the first World War is a surprisingly heartfelt adventure."], ["AusGamers", "Critic", "80", "In any case Valiant Hearts does something genuinely different, and it does so well. There has been a large contingency of people asking for a war game in which you don’t pick up and fire a gun, so it’s great that, when it actually happened, we were given a game with this much charm and emotion packed into it."], ["Game Revolution", "Critic", "80", "Valiant Hearts could very well be the most poignant World War I game ever made, especially as it tells a tale from both sides of the conflict without getting bogged down in the unnecessarily stupid allegiances and battles that wasted thousands of precious lives."], ["Meristation", "Critic", "80", "It is not perfect; it is far, very far from the intentions of other IPs like Medal of Honor. And, the most significant thing: It's a war game without shooting mechanics. Valiant Hearts: The Great War not only tells us the story of the First World War, that one that seems not to be very interesting looking all the games based on WWII, but it tells it with a visual sense of pure art, the only one that the UbiArt engine achieves. It is about soldiers and battles, about lost and death, but also about things the new generations should know, because it is our story after all. Visual novel concepts mix with the core of the graphic adventure, and the result needs some adjustment and balance here and there, but it is one of those experiences that can touch us."], ["Multiplayer.it", "Critic", "80", "Its gameplay is too linear and basic but from the plot to the art design is a marvelous project."], ["Eurogamer Germany", "Critic", "80", "It's a valiant little game, then. One you won't begrudge for its final monologue about honor, homeland, and freedom -- words that usually have my eyes rolling whenever lesser games dare to utter them."], ["Hardcore Gamer", "Critic", "80", "While Ubisoft has shown that it can deliver outstanding blockbuster AAA titles, its growing library of creative downloadable games should put EA and Activision on notice: this is how to be creative."], ["IGN", "Critic", "77", "There’s not much of a challenge or a reason to revisit once you’ve finished, but the story alone is worth experiencing. Ultimately, it’s a game about warfare that’s more interested in the people and their experiences, than bullets and their targets."], ["Critical Hit", "Critic", "75", "Valiant Hearts is a good game offering an emotionally satisfying experience. With about six hours of gameplay (depending on puzzling speed) it has solid value. As humans, we should all play this, even though it's not the best gaming has to offer."], ["NowGamer", "Critic", "75", "Valiant Hearts: The Great War can be poignant and contemplative, but it does undermine itself by including a cartoonish villain. Superb art direction and a genuine interest in its own subject matter count in the favour of a game that is unremarkable in a mechanical sense."], ["games(TM)", "Critic", "70", "A rare gem that takes the time to commemorate a tragedy, exploring its human cost in a way that's both meaningful and moving, and relying upon core interactions that are mostly about helping others rather than harming them. [Sept 2014, p.114]"], ["Gameplanet", "Critic", "70", "A surprisingly sensitive, if flawed, retelling of a harrowing time in human history."], ["Eurogamer Portugal", "Critic", "70", "Its narrative is able to offer a story that manages to be humorous and even lovely during one of the darkest periods of humanity, but there are hardly any serious obstacles and it leaves no desire to play a second time."], ["VideoGamer", "Critic", "70", "Valiant Hearts doesn't make the most of what it's got: the four playable protagonists (the dog is essentially a tool for fetching things) each offer different perspectives on the war, but their stories are predictable and too dependent on coincidence to really engage...No matter. Valiant Hearts may be confused, but it's also brave."], ["Gameblog.fr", "Critic", "70", "This game could be considered as a good one in terms of gameplay. But the whole package is a very intense, very moving experience. Thanks to its graphics, its story, its characters and the clever way it talks about a very sad part of History, Valiant Hearts can be considered as one of the best initiatives this year. With games of this kind, with a soul, even not perfect, we ask for more."], ["Metro GameCentral", "Critic", "70", "A heavy-handed but impressively sincere attempt to tackle a subject most other games would never dare, with the end resulting being both affecting and entertaining."], ["Game Informer", "Critic", "70", "It may not be challenging or action-packed, but Valiant Hearts provides some thoughtful and sobering looks at what life was like on the front."], ["Playstation Official Magazine Australia", "Critic", "65", "Very pretty, but pretty shallow. Unchallenging – both emotionally and as a puzzle-platformer. [September 2014, p71]"], ["LevelUp", "Critic", "65", "This game feels like a well intended failure. Its puzzles are too simple and easy to solve, the action parts are diluted minigames and the animations feel cheap. However, the historical context is interesting and the visual style is amazing. In the end, sadly, Valiant Hearts is unable to overcome its weaknesses."], ["Play UK", "Critic", "64", "There’s good puzzling to be had, and some engaging stories here, but a lean towards either fictional fun or serious stories would have worked better. And while this was an interesting experiment, we //really// don’t want to see a WWII game presented the same way."], ["LEVEL (Czech Republic)", "Critic", "60", "A short and simple adventure game with strong atmosphere delivered via an unique visual style. If you're looking for something different, this is it. [Issue#244]"], ["Slant Magazine", "Critic", "60", "And yet, even in its current state, you still have a game that aims to be more than just a jingoistic, us-versus-them shooter, and Valiant Hearts comes off as a blessed gasp of fresh air as a result."], ["Eurogamer Spain", "Critic", "60", "Valiant Hearts is a correct game, but also a superficial tribute that lacks some boldness and will to adopt fresh gameplay solutions."], ["Level7.nu", "Critic", "50", "Valiant Hearts is a really ambitious war game that has the most of the ingredients that have been missing in the genre so far. Most of the characters is really enjoyable and the graphics is fantastic. Unfortunately the mechanics are too basic and the story isn’t very well written."], ["Gamer.no", "Critic", "50", "As a means to tell stories based on actual events Valiant Hearts: The Great War works fairly well. The plot is engaging, the characters compelling and the use of World War One as a backdrop is a bold, but ultimately good decision by Ubisoft Montpellier. The beautiful, hand drawn graphics are stunning to look at, and manage to underscore how difficult life in the trenches was. Unfortunately Valiant Hearts isn't able to justify itself as a game. The gameplay is, ultimately, not very interesting and completely without challenge."], ["adamkynaston", "User", "10", "Unbelievable.  Emotional, moving, intimate.  Beautiful.  This is what is taking gaming from a child's activity to the most powerful medium available for storytelling. Simple story based on a truly horrific event.  Easy to identify with, lovable characters, and an interface so friendly this is accessible to gamers of all skill level."], ["aadms", "User", "7", "Valiant Hearts is a 2-D side scroller that incorporates gameplay in the fashion of puzzle solving to progress through a very well told story set in World War I. The story is told in comic book style with no animations for their cutscenes. The narration is very well done, and the music selection with contemporary pieces is beautiful. It took me about four hours to play, however, that took about a week's worth to get through as I found myself only playing in 15 to 30 minutes spurts. Perhaps because the mind can only go for so long solving puzzles before it needs to move on to something else. The developers did try to interrupt these puzzles with different type of game mechanics, such as those found in classic arcades like \"Space Invaders\" and \"Dig Dug\", as well as newer game mechanics like \"Angry Birds\" and \"Guitar Hero\". However, I think these mechanics didn't work very well in this game as they did in those games that I mentioned above. If you don't like history or education, you may not appreciate all the items you find to unlock the history of World War I and the reading that goes along with them; which I actually loved. It gave me a good sense of understanding World War I's history much better and the people who lived and fought during that time. It made me care about these characters in the story. Excellent overall story presentation and puzzle solving, however this game may not be to some likings as it game length and reading requirment."], ["Yerczeys", "User", "7", "Despite my burning distaste for Ubisoft, I quite enjoyed this game.  I'm echoing the herd at this point, but it was simplistically delivered, and emotionally touching.  It manages to humanize rather than villainize soldiers in the unique setting of WWI.  This is definitely not for the twitchy types or adrenaline junkies, it's slow paced and easy going, but in the end it hits you right in the feels."], ["dacritic82", "User", "9", "This is probably one of the best puzzle adventures ever made. It's beautiful and touching with a lot of interesting facts that help you immerse in the story (and learn something along the way) . Well made in every aspect."], ["carlingtat", "User", "7", "Valiant Hearts is a 2D sidescrolling puzzle game that tells a great story during the events of WWI. While its not an action game which one might expect for a game set in a war but it does get a nice balance and pace for the gameplay and story."], ["nonchalantgamer", "User", "8", "Valiant Hearts: The Great War was a great game that had some high emotional moments throughout, this is was a free pick up on PS Plus and it was worth it."], ["ToyGunSoldier", "User", "7", "Good plot, great storytelling, but poor gameplay. This is a simple puzzle game that exploits greatly an historical setting to build up a solid novel. I think of it as a nice interactive movie instead as a boring adventure videogame."], ["felasi", "User", "8", "I loved this game. The puzzles were entertaining. The world beautifully designed. It had enough background information to keep you informed if you so choose. It didnt pop up in your face breaking the pace of the game. I also admired how they included all aspects of the war, and covered all the groups involved. Well done for being culturally inclusive and truthful."], ["AvxrageJoe", "User", "6", "The game's story is touching and beautiful, but I have a problem with the gameplay. The gameplay is very boring even for a 2D game. All you need to do is go from place A to B. Sometimes you have to search stuff in the world and go back and forth, back and forth with ultimately slow speed, since the characters move quite slow. And the constant mumbling of a certain character was incredibly annoying over time."], ["Dal_ReviewedDat", "User", "8", "If your looking for a deep puzzler, or a robust platform game, this isn't it."], ["dubloon7", "User", "6", "Overall 6/10. Music was the best aspect of this extremely linear, short-lived, novel. Too much reading, consisting of the 100+ collectible items, historical facts, and journal entries. The ending was great, but the overall performance of this OK game was just that: OK. Walking from point A to B to C etc. while button mashing the X button to hopefully find any hidden collectible. Button mashing by the dog and you per the dog, every 1 to 2 seconds. I will never play again, and I hope Ubi actually makes better games from now on, than this and ASSASSin's Creed"], ["Basquilly", "User", "8", "Beautiful style and beautiful story. The narration in this game is fantastic. Great to see Ubisoft recognising the popularity of indie games and giving the time and funding to a project such as this."], ["stamito", "User", "9", "This game has an excellent, really moving, captivating story. The setting, music, graphics etc. are great. Game play wise, it is a bit like the old point and click adventures but a lot simpler, which is not necessarily bad. I also loved all the real historical data, why not learning a bit while playing? Not only that, reading those historical facts and the horrors of the war made me experience the story in a much more intense way (emotionally speaking). Like a good story and point and click adventures (much simpler that the old ones)? Give this one a try."], ["determan9", "User", "9", "Valiant Hearts is a beautiful game that shows you what few other war games ever will: War is not fun. There  very little besides pain and despair for those involved. This portrays this wonderfully, but still manages to wrap all of it around a very touching story."], ["WhiteJedi87", "User", "10", "Moving and intimate.  These are just two words to describe this game. Ubisoft have shown the true horrors of war with grace and truthfulness, yet with respect. All should play this game just to get an idea of what it would been like for all those brave men and woman."], ["1610", "User", "9", "Отличная игра, повествует о событиях Первой мировой от лица простых французских солдат."], ["Muzzle131", "User", "10", "This is something hands down amazing. Valiant Hearts goes deep in that of WW1 a very touchy subject as neither side could be described as good or evil like many can with WW2, so instead the game goes into the lives of soldiers and show/tells us the ways how war is Hell. We got 4 characters here Emile a French Soldiers, Freddie a US citizen joining French forces, Anna a medic who only aims to make sure people survive this Hell, and Karl Emile's step son who was forced out of France and made into a German Soldier. However Emile in this is the main main character, the game mostly centers around each one of these character's personal goals and endeavors making the war something of an obstacle for each of them to get around. Gameplay wise is it is a simple 2D platforming/puzzle solving adventure usually you have to progress past something by finding an item to use to progress past something, simply put if you don't like being paced and stopping to think stay away from this game. Even with that said it's something to see with the ending being pure beauty (not going to spoil anything) as we drag our character witnessing horrifying (yet stylish) cartoonish locations that make it so when the heavy emotional stuff has a greater impact than any serious war game that has come up in the past. With all this considered there is a certain demographic that is specifically targeted here and that is people interested in story, if you don't have a lot of time on your hands, or are looking for game to have actual fun in then I have to tell you to stay far away from this game as possible, it has a heavy atmosphere that doesn't let up putting the weight war on your character who you can't help but want to come out of this, this game is also very educational too somethings are simple and in fact you could learn some new things which is pretty neat. But anyway this is a very emotional pain train of a game and will play with your emotions like nothing. I would give this game a score between 8-9 but I decide to give this a 10 to somewhat raise the score a bit."], ["AdrianChan", "User", "9", "Finally there is a war game which is not to gun blaze every one all the time. Valiant Hearts: The Great War has a interesting, touching and meaningful story line. Gameplay is quite good. The puzzle solving is great. It even creates more intense moment than other ordinary action adventure game. It is probably the best game Ubisoft has made this year. It is very cheap and you should pick it up. 1 marks extra is given to all the emotional and beautiful trailers of this game."], ["Wawacoffee89", "User", "10", "Unbelieveable game! Took my breath away. This Ubisoft took history and video games, a told an amazing story about the hardships during World War 1 in Europe. The characters, the soundtrack, gameplay, etc., were all amazing. This game will really hit home for some people, so expect sadness at some points. Beautiful, beautiful game; that must be played for people with a heart. These indie games are really starting to make an impact in the industry of video games. A must play for only 15 bucks!"], ["retrogeek45", "User", "10", "Amazing game which compelled me to write my first review, ubisoft are fast becoming my developers of choice. Love the art style it's beautiful and shows that current gen photo realism is not always best. pick this up you won't be disappointed. By the way ignore the 0 scores they are a joke, they must have been playing an atari 2600 game or something."], ["HunterC", "User", "10", "Valiant Hearts:The Great War is a game that both inspires and encourages hope in a bleak and desolate WW1 era Europe. The puzzles were fleshed together in a way that made sense both in game and in context, you aren't superman, you are a soldier. You need to use your mind to get through situations. Decisions need to be made in seconds if you wish too keep those you love alive. The game brings a incredible amount of emotion into a time that is tragically overlooked. It puts you in the position of normal, regular day people, made to fight in one of histories most atrocious wars. Death and sorrow become commonplace in the trenches of Valiant Hearts, and the fantastic sound and art design create a atmosphere which makes you feel so vulnerable, so out in the open, that it made me shiver any time I would see a fellow soldier fall to just one of thousands of hazards that plagued the battlefield. While experiencing the levels, you will find a dynamic backdrop that shows the plight of your brothers, those who are simply following orders. The \"boss battles\" if you will are excellent and well paced as they make you lose that sense of security of abiding by your own rules and throw you into situations filled with panic and paranoia. The fight with the Baron in the bunker stands out as incredibly tense and filled with emotions that compel you to prevail in order to save those you hold so dearly . The story complements the game play in a way that few games, excluding Journey and Brothers: A tale of Two Sons, have managed to accomplish. It creates a bond not between you and the characters, but the characters themselves. Never once while playing did I feel that  I was playing a game, I felt like I was there with the assortment of character that we encounter in this journey. The ending itself suits the game perfectly and not to spoil anything, it did leave a hole in my heart. All in all, this game is another fantastic example of the rebirth in story-driven games that has come to fruition in these past 2 years. If you have 15 dollars on hand, you owe it to yourself to get a copy of Valiant Hearts: The Great War."], ["Gugabvs", "User", "10", "This is one of the games that got me more sentimnetaly attached to it you should play it.I think this game is worth every penny spent on it and also i cried several tims trough the story."], ["Chiyou", "User", "10", "Stunning visuals and incredible story, at no point was I left disappointed. A variety of gameplay mechanics make the game feel fresh and surprising from start to finish , If you're used to more difficult puzzles like in Machinarium then you might be disappointed, you won't have to search through a FAQ to get passed these puzzles but I don't think they are meant to stump you. The real reward is in the story and visuals the gameplay and puzzles compliment it. this is war told honestly and I hope its success leads to more emotional stories from the frontline and not more superhero type one man army games (Although I don't want to see all of those go either)"], ["MisterMittens", "User", "5", "Valiant Hearts: The Great War is a very interesting concept for a game. A puzzle Adventure set in the midst of World War One. While there are parts of this game that do a good job and reminding us of the price the conflict had on everyone, it's too often sandwiched between an overly cartoonish representation of war, obtuse puzzle design, and action segments that would make even Call of Duty players scratch their heads at the lack of realism. I can only recommend this if you're a history buff or a fan of old adventure games."], ["JohnConnor333", "User", "10", "Not for everyone, yet I felt this game was made just for me.  A story that gave so much emotion, which is rare.  Shadow of Colossus and The last of us are the only games I feel can compete with that.  Art is beautiful.  I despised history class, yet this game gives interesting facts that make you realize WW1 had more than death and treaties signed.  Great stuff.  Free on PS Plus, but if I knew it was this good I woudl have paid full price."], ["CzarIndustires", "User", "9", "This is why I play video games. This game... right here. Forget the gore, violence and sex and all that other jazz that gets pumped into games. This game boils down to something pure and honorable. Something that connects with anyone who has a shred of compassion for a fellow human being. The musical score and characters and the terrible situation (WWI) they find themselves in draw you instantly. Then you stay, through the puzzles and the mud, anger and tears, because you want each character to be happy. But war isn't a happy place and the game reminds you of this. \"War makes men mad\". This is a MUST BUY. The only reason that it doesn't get a 10 is because I'm selfish and it I wish they had a few more levels."], ["Demirro", "User", "10", "Straight up one of the best game I ever played. It looks amazing but more importantly the story is really good. It's emotional and gets you right in to the story and WW 1. I had goosebumps and also tears in my eyes several times. The gameplay/puzzles are very nice even though some might get bored of it, as it gets a bit repetetive (I did have no problem with it). The music is exceptional and fits perfectly to the game and it's moments."], ["BaronMonaco", "User", "9", "I played this game thanks to the PS+ subscription but I'll be reviewing it like if i paid its full price as it is no longer free to download."], ["sityoazzdown", "User", "10", "If this was trying to be the saving private ryan of video games, then this game has just hit a bomb outta the park. This puzzle adventure game has very simple puzzles, but suprisingly the characters and story kept me playing. The more I played, the more I leaned closer to the T.V not only because of the engaging story, but because of the fun/unique/intense/ and sometimes even wacky puzzles and action during the span of this game. The variety of this game kept things interesting, and how the game followed the four characters were excellent. I also loved the art-style of the game, the narration was very interesting, and the gameplay was very responsive. Having the collectibles also kept this game from being linear, which I enjoyed. The only negatives for me was the forced history lesson that pops up during the game (which I whole-heartedly ignored), and the recurring setup for puzzles (you have to finish puzzle A to get to Puzzle B to advance to the more interesting part of the story). And that ending, I legit almost cried, but held it together, it was that emotional. To end, I had a hard time deciding whether or not to give this one a 9 or 10, but settled on the latter since it's not a full priced triple a game, that everyone needs to experience."], ["TheBoredBoy", "User", "9", "from the start to the end, this game is beautiful. it works well at all at which is does, from the story, to the way the puzzles are implemented. i wont speak of anything specific of what i liked or disliked as i would recommend you see it all for yourself. its good game. a really game. a refreshing one. and im more than happy i bought it. i wouldnt say its perfect, but it has a sweet spot my heart!"], ["ndr", "User", "10", "One of the best games in it genre. Great graphics, great story. Once I started playing I couldn't stop!"], ["saulodourado", "User", "10", "Superb game, it keeps growing and growing on you, until the end, that is beautiful. The piano songs, art, camera movements, clever puzzles and a cast of very nice characters, that by the end of the game feels like they're your friends."], ["Storm1672", "User", "9", "An incredible piece of art. Emotional gaming at its best. A bit on the easy side, but enjoyable overall. Ubisoft must give us a sequel. One of 2014's best."], ["DeusXCom", "User", "8", "First World War is not covered in games as much as WWII, so this is a really nice trip back 100 years back into the heat of the war through great story told by both, beautiful hand-drawn visuals in game and real life photos with descriptions and items from that era. The game does a really good job in describing and showing you how life during that time was like on the front-line. This is one of those games that sticks in your mind and makes you care and interested. Also, the piano score in this game really helps to set the mood perfectly, the atmosphere is great. I didn't expect much, got it on PS+ for free, so I just tried it out and I was very positively surprised. Ubisoft should really focus more on interesting and unique games like this rather than milking their mainstream franchises to death. 8/10"], ["roshi82", "User", "9", "I cried.  I really did. What a beautiful emotional game. Was not expecting to love it as much as I did.  I love a good indie game that really shocks you"], ["CycoCross", "User", "9", "Valiant Hearts is one of the finest games about war ever created. War games typically involve aiming down sights and shooting folks while everything blows up around you, a cut scene starts that tries to shoe horn in some story, then you follow another guy to another place, shooting along the way, for another cut scene. Valiant Hearts does away with all of that, telling the story of multiple characters whose lives intersect during World War I, and giving you glimpse into how devastating the Great War was."], ["shootinship101", "User", "9", "This game is so unique, emotional, and beautiful, that it would be a crime for anyone to rate it low or not feel a thing when you're playing it. I mean it, who wouldn't feel a thing when it goes to the horrors of war, that war being World War 1, and the fact that it has a helpful dog companion?"], ["Maruyon", "User", "9", "Beautifully drawn and animated game, with a moving story and touching music! The gameplay is fun and simple, completing puzzles and thinking outside of the box without it being repetitive. The extra information you get about WWI is worth reading and adds to the atmosphere of the game. The thing that struck me most was that Valiant Hearts is a rare war-based game in which killing your enemies is NOT the main goal; instead you sneak your way through gas filled tunnels and ruins, avoiding dangers while trying to help the locals or sometimes even collaborate with the enemy. One of the endbosses (if you can call it that) is about healing, not murdering. This game shows you the other side of war through a very touching story, and for that it left a deep impression on me. I thoroughly enjoyed playing this game, even though it had some minor bugs and glitches. A real recommendation!!"], ["milero91", "User", "9", "I only got this game as it was free on PS Plus but I'm very glad it was. What a pleasant surprise this game is. This puzzles in the games aren't that hard but it has a good story and also doesn't seem to shy away from the brutality of WW1 despite being a cartoon. It includes lots of facts to read up on about WW1 if you are interested too. Some parts feel a little tedious but overall a really enjoyable game."], ["Araiz", "User", "9", "In a way Valiant Hearts is a challenge to everyone in the industry; it's a challenge to the publishers churning out the same old \"war games,\" and it's a challenge to all the players that continue to buy into these games without really thinking about what they are playing. War isn't fun, and it has a real impact on the people that are involved in it. It's games like this one that, critically, remind us that there is a human side to war."], ["Snadiwchhhh", "User", "10", "I've been reading history a lot, one of my favorite parts of human history is of course ww1 and it's most emotional one for me, even more emotional and important than ww2(my opinion). Reasons are different, but about the game i can say that my whole year anticipation was worth it. You know, not only the story itself is done perfect and deep, Ubisoft showed how horrible war is, what really happened on those fields of blood and pain. The great Pro of this game is that it doesn't quite chooses sides, it tells a story of people who lived at those dark times. I think that all understand that some survived , some not and not only this aspect  made me cry a bath of tears, but I even had to stop playing the game on middle of playthrough, because i couldn't just keep up with fact that this happened. Gameplay is done great and  with charm, sound sometimes just touches my heart and just whole game is beautiful experience.The characters are done excellent and you sympathize to their story, (sad part is that there is almost no George ark) In my opinion, the game is perfect and it's perfectly showing what the war did with people, what is doing write now and what sadly will do.  Valiant Hearts has now a special place in my heart."], ["xXCreepyB4byXx", "User", "2", "Idk why this game is rated so high.  I just bought it and it sucks.  It's like watching a really crappy movie, except you are the one moving the ppl around.  Every couple of screens is a small puzzle which is terrible bc the puzzles are usually as simple as \"Get the wrench in screen 1 and use it on the flashing red bolt in screen 2\".  The story is incredibly dry, besides avoiding hazards like falling bombs, there is no skill element to this game.  It really is one of the poorest interactive experiences that I have ever had.  If you enjoy this game, you might try reading a pop up book next."], ["NickRoos", "User", "4", "I didn't like the game at all because it's a very, very boring game. The graphics are really awesome on Ubisoft's Artwork engine but that's the only positive thing on Valiant Hearts."], ["Druganov", "User", "10", "This puzzle game, in conjunction with the background information about the great war that it supplies, has an absolutely moving, hearth-touching sad storyline. the graphical style is beautiful, as is the soundtrack. only the baron should be less cartoony and villainous imho, but besides that it's a great experience to play."], ["thenthomwaslike", "User", "8", "A simple game with some obvious flaws (the same somber music starts everytime you open the menu, which happens a lot as you examine collectibles, rifle through historical context, and read diary entries) but complex in its tight-knit story and well fleshed out characters. It accomplishes exactly what it sets out to accomplish."], ["Soulin", "User", "10", "First of all, I really hate most of the indie games. The fact that the game is indie doesn't mean that it has to constantly remind of my my ZX Spectrum from '85."], ["Fluxell", "User", "9", "If you're looking for a FPS type game or something with difficult puzzles go find a different game. However, if you're looking for a game that tells a story where you become invested in the characters, then this game is for you.  While the graphics aren't ground breaking, they do look quite nice.  The story and the characters are the real centerpiece to this game and I loved almost every minute of the game."], ["lordsuarez", "User", "9", "It's difficult to find a flaw with Valiant Hearts: The Great War. Featuring beautiful environments and an engaging story, the game never failed to wow me. Yes, there are some rather uninspiring levels included (such as the boss fights) but overall this game is very well polished. The puzzles are challenging but satisfying when completed. It's a good game but the main problem is it barely offers any replay value. I want to give this game a 10  but there's something inside me telling me not to. I don't know what it is!"], ["TheBlackGreg", "User", "9", "sweet art style very great story love reading about all the facts and learning about WW1 from the point of view of the trenches parts were probably the only part i didn't like"], ["MaxPayneIsGod", "User", "9", "A thought provoking side-scroller-puzzler set in and around the horrors of World War I.  4 intertwining stories about loss and surviving against all odds.  Very well written and presented, Valiant Hearts is an under-appreciated gem which should not be missed.  Some of the puzzles are a little misguided and the game does little to guide you in certain situation which occur about once per chapter.  The hint system is hit and miss, 2 out of the 4 times I referred to it the hints were irrellivant.  I thoroughly enjoyed it."], ["Give_em_hell", "User", "8", "This is a very good game, both humorous and tragic at the same time. It is not a pure adventure game with difficult puzzles, something I never liked at all; on the contrary, this is a quite easy game both for action players and puzzle solvers; so any average player can enjoy it, the best part is the story and the characters; everything about the First World War is looked from the side of humanity, human losses, nad sacrifices. In addition, you get very nice and summarized history lesson about the First World War."], ["thepedrovital", "User", "10", "The game is beautiful. Not only in appearence, but in story as well. The music, the actions, the art, create an amazing storytelling experience with so much emotion that will make your heart race and your eyes tear. Also, the game is fun, envolving and have lots of smart puzzles. The gameplay never gets repetitive. The ending could be little longer, but still make it all worth it. Great game."], ["F1v3", "User", "8", "Great immersive storrytelling and music. The story is so solid, the facts of war is even interesting and really connect to the game's story. Simple animation graphic but looks and play smoothly. Well done developer for making this nice game."], ["heberusa", "User", "9", "very good game, with excellent puzzles and much real historical content. The Narrative about the characters is well posed and the relationship between them, the way the pet inserted as is done dynamically involved in the story is an additive that makes it more addictive. Very good game"], ["5Monkey56", "User", "9", "This game was the fisrt to make me cry the way that the story is told without words is amazing and extreely emotional I did think the puzzles were tedious but they did have a rewarding feeling this game is a masterpeice and shows that not everyone can win"], ["Mosh603", "User", "9", "I haven't put in too many hours on this game yet, but I am surely enjoying it. I love the historical facts and the graphics style, those are my two favorite things. Overall, I find the game easy to play and very entertaining. The story seems very real and intimate, and I am excited to continue with this game."], ["Jollukka1", "User", "8", "This game was one of the most impressive ones 2014, it told touching story and at same taught that the war isn't fun. All the players will not enjoy this game, because they want more action or thrill. Im one of them, but i still played up to end even though sometimes i meant indeed to give up."], ["DanishDan", "User", "9", "A simple, interesting puzzle game. Enjoyable to play, very nice music, and nice story. The extra information and collectibles added some extra depth to the game too."], ["ThiouZ", "User", "9", "Soldats Inconnus : Mémoires de la Grande Guerre est un émouvant jeu vidéo d'énigme/bande dessinée interactive inspiré par la grande guerre de 1914 - 1918 celle que l'on a surnommé la der des der."], ["DJAbacus", "User", "9", "Wonderful game and it's actually possible to 100% it without cheating as the puzzles aren't ridiculously impossible. Once you get the hang of it. Switch to Veteran Mode and then go  back and make sure you get all collectables in each Chapter Section. a wonderful game that shouldn't be rushed through and currently £5.60 on PSN right now."], ["alexmanea", "User", "9", "Valiant Hearts is one of the best puzzle games I played so far. The game is different from other war games where you shoot to kill. It shows you the emotional part of the war and it shows you how sad a war can be. The soundtrack was just on spot, really reaching those emotions when it was needed. Another plus about this game is the characters, which you see evolve from before the war until nearly the end of it. Apart from these I really liked that it holds a great historical value because you have the option to read about certain historical facts in each level. Ubisoft did a great thing by making this game."], ["dohgeh", "User", "9", "I fired this game up for the free PS4 game of the month and I saw it was made by Ubisoft. Oh boy.."], ["Zoidy3942", "User", "10", "Buy this game immediately if you have not played it yet!!! Ok with that out of the table, I want to say that the game is amazing. The story is emotional, gripping and makes you care about the characters. The gameplay is pretty simple with puzzles here and there. It shows that war is not just like the war in Call of Duty but a violent bloodbath. There is not a lot of games that made me cry but this is one of them. Good job Ubisoft Montpellier! Recommend it to everyone."], ["tsakiym", "User", "6", "nice story,nice game but that you gonna play it one time and nothing more. I do not have to say anything more. But i need to write one hundred and fifty characters. i think my score can describe it."], ["prefontaine", "User", "10", "Valiant Heats is simply wonderful. It's mature and whimsical, beautifully directed and cleverly written. This is one of the rare gems in video games that at the conclusion will leave you staring at the screen and contemplating the entirety of what you just witnessed. It's sad and beautiful, and it's worth every penny."], ["LordZenan", "User", "9", "Praise be, a good Ubisoft game to come out in 2014. Honestly, if Ubisoft spent more time and resources on games such as this, the industry would be a better place. Valiant Hearts is a low budget game from a smaller subsidiary of Ubisoft, but what it achieves with that budget is what makes this game the bargain of the year regardless of the asking price. This adventure weaves intuitive story telling and an emotional roller coaster with an educational base. Seriously, if I was a history teacher I would just demand all my students complete this game while I put my feet up over a nice cup of mocha and an episode of Game of Thrones and let the A-grade essays pile up on my desk. Valiant Hearts provides a detailed description of many battles fought over the course of the First World War including items of importance to the soldiers, military hardware involved in the conflict as well as dates, locations and events of relevance to the war. My favorite aspect of this game however, is how it places several interesting characters in the actual events of WWI, discusses traumatizing and depressing subjects but somehow makes it a pleasure to play and even funny at times, aided by the comic style design and lack of speech during gameplay. All in all, if you're looking for a 5-8 hour adventure that pulls on your heart strings and fills you full of knowledge that you can show off to all your friends, I struggle to think of a more perfect package than Valiant Hearts. This is one you're not gonna want to miss."], ["Tepre", "User", "9", "I really didn't know what to expect from this game, because i didn't read anything about it before playing, and i have to say that it was a very good choice because i was emerged in an extraordinary story. I've been captured by it and played till the end just wanting to know how it unfolds. The only down side of the game is that is pretty linear. And pretty easy. Although i didn't find every collectibles in the game. But it is beautyfull. Simple but beautyfull."], ["Tirah", "User", "10", "In case you ever get into an argument about video games being art, Valiant Hearts is a definitive proof that, yes, games can be art indeed. VH can be best described as a puzzle platformer. You control five characters with different abilities and solve puzzles in a 2D environment. The controls are simple and intuitive and the game is fun to play. The graphics are beautiful and it's impressive to see what Ubisoft managed to do. Screenshots don't do this game a justice, you must see it in action."], ["sonodade", "User", "10", "A clear, inspiring and moving insight of the dynamics of the World War I. I usually like these kind of games, adventures/actions and platforms, but this one tops most of the ones I played, I don't understand the poor reviews and the 77/100."], ["L_Coops", "User", "8", "The ending of this game just might make you cry."], ["RockStarGamers", "User", "8", "If you are looking for a well written adventure game, complete with fun puzzles and even a bit of a history lesson to boot, then look no further than Valiant Hearts: The Great War."], ["DrakeGarrison", "User", "8", "The story of crossed destinies and a broken love in a world torn apart. All of them will try to survive the horror of the trenches following their faithful canine companion. In Valiant Hearts: The Great War, the lives of all these characters are inextricably drawn together over the course of the game. Friendship, love, sacrifice, and tragedy befall each one as they help each other to retain their humanity against the horrors of war."], ["arcturus32", "User", "10", "I cried...... I cried at the end of this game, I cried hard as I watched everything in the game unfold. Despite the art style of the entire game which some may thinks takes away from the realism of the game, it's perfectly fitting."], ["SCLancho", "User", "9", "I can't believe i got it for free when i paid a lot of money for some **** games (like Fifa 16)."], ["taroko", "User", "9", "Touching and stirring game that deals with real history and emotionally impacts the player. There are some pretty clever puzzles in here and you can easily redo sections if you die. It's focused on immersing you in war so you can experience what it's like."], ["fandango89", "User", "6", "Interesting story, cool historical facts, good art direction. Boring repetitive gameplay with search and find elements. You do mostly the same things every single mission."], ["Juras", "User", "7", "Hmm, i was expecting something little different, but not bad at all. Heartbreaking and real story. I think i would vote more if my nationality was one of heroes."], ["PaleNielsen", "User", "9", "I got this for free (PS PLUS) and it's really a great experience i hope i paid for it when it first came out. It was emotional and exciting experience despite the easy puzzles it's still a great game. Thanks for the game."], ["smodcast", "User", "8", "A game that tells the story of war without having you firing a single bullet."], ["Sparkticle", "User", "8", "Another game heavily focused on story telling, and it does its job well. The artstyle is beautiful, finding collectibles feels rewarding, the story itself is sad and memorable. Nice addition to have to your library."], ["DUoXsKiLLz", "User", "10", "Valiant Hearts: The Great War se suma al top de grandes aventuras gráficas de los videojuegos, en mi caso, en el primer juego. Una gran historia mezclada con puzzles y desafios que combinan a la perfección. Sin duda es uno de los juegos que hay que jugar al completo. Pocos juegos han conseguido emocionarme y Valiant Hearts lo ha hecho."], ["HaloFever", "User", "9", "If you like puzzles, story, history, and classic animation, Valiant Hearts: The Great War is the game for you. In a refreshing turn that I'm sure many will find odd, Valiant Hearts is a war game with very little fighting. Now and then you can clonk a German soldier or fire a cannon, but mostly, you sneak around solving puzzles and rescuing people. This human side of the war is compelling, and even if you despise the puzzles, the characters' stories will compel you to play until completion."], ["badgerryan19", "User", "8", "This was a new thing that Ubisoft did with the indie stuff and I think it worked out. I liked seeing didn't peoples lives during this war. Taking control of multiple people was really cool. It was a good game but lacked in some. Overall fun."], ["Nel", "User", "8", "Great story telling, fun engaging. It will grip you, and it will be hard to put down the controller. The game is  really engaging and it also brings some  world war history."], ["iCSiMarcelinmBR", "User", "6", "The game's story is touching and beautiful, but I have a problem with the gameplay. The gameplay is very boring even for a 2D game. All you need to do is go from place A to B. Sometimes you have to search stuff in the world and go back and forth, back and forth with ultimately slow speed, since the characters move quite slow. And the constant mumbling of a certain character was incredibly annoying over time."], ["mikehettfield", "User", "9", "Awesome game, soundtrack is just killer, story is epic, and the designs work, it should be at some point in as history lesson, few games can provoke emotions like this. highly recommendable"], ["dugsyu", "User", "9", "Had it in my ps4 for 6 months but didn't dare to play more than half an hour. I jumped into it last week and could 'nt stop playing until the end : this is a great game and a very good surprice , historically interesting , full of emotions, script is nice, sometimes it repeats the same game play but overall the story is nice to follow and music is also good. If you want to spend a good time with kids to entertain them, yourself while also making them learn about this period it is perfect and will last around 5-6 hours of good fun without having you stuck too much. Imagine such a game with modern 3d fps way investment and you would have at last a game with a real story !"], ["xvvolf4", "User", "10", "This is one of the few games that I got emotional at in parts. For a short, 2-D side scrolling puzzle game I actually cared and liked the characters. But not just the characters, the short (real) letters you discover throughout were quite powerful to read, even if they were just simple letters that didn't say much. Knowing they were letters written during WWI I found powerful."], ["lionheart21", "User", "9", "Valiant Hearts: The Great War doesn't bring anything fresh as far as gameplay is concerned (its basic point-and-click), but it doesn't need to. Its strengths lie in its narrative, showcasing the horrors of the war in a way that is approachable to anyone. The artstyle is minimalistic and the soundtrack is just gorgeous."], ["IONOSGAMES", "User", "8", "Un juego de puzles en 2d, que ta importancia a la forma de contar la historia, presentar a los personajes y los sucesos, la historia es buena. Un titulo que no es para todo el mundo, si buscais diversion y graficos no es para vosotros, sin embargo, si os gustan los puzles, aunque no sean una maravilla estan bien, y si os gusta la historia, esta es la historia mas emocional contada jamas en un videojuego, o por lo menos una de las 5 mas emocionantes jamas contadas en un videojuego. Por cienrto el apartado grafico es bastante bonito, en 2d y como si fuera pintado con pinceles."], ["KayVen17", "User", "9", "Deutsche Review - Kritik"], ["juankvillegas", "User", "10", "Valiant Hearts is a beautiful and really enjoyable game. I can't believe I had it available for like a year since it was given for free on PlayStation Plus and I hadn't played it yet. The historical references to The Great War (WW1) give the game a big plus while you learn a lot of history and details about each army involved. It is one of the greatest games I've played on PS4."], ["mackenzie129", "User", "8", "-Beautiful story and beautiful art"], ["xvvolf", "User", "8", "I was in need of a new game to play and Valiant Hearts happened to be the only game on sale, and I must say that it was a pleasant surprise."]], "platforms": ["PlayStation 4", "iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/7/48cfa17ea1079b0173e9f3140f53d4d2.jpg"}
{"publisher": "Sega", "genres": ["Strategy", "Turn-Based", "Tactics"], "rating": "T", "title": "Valkyria Chronicles Remastered", "release_date": "May 17, 2016", "avg_score": "84", "summary": "The Principality of Gallia, a small neutral country between two superpower nations, suddenly faces invasion at the hands of the Empire. In the face of an overwhelming military power, the Gallian army has lost all hope. However, a ragtag volunteer militia has risen up against all odds to fight off the invading Imperial Army! Through various situations born of the extreme nature of war, this large-scale strategy RPG depicts themes such as living life to the fullest and the importance of human relationships. [Sega]", "reviews": [["Digitally Downloaded", "Critic", "100", "Valkyria Chronicles is, simply, one of the best tactical games you’ll ever play. It’s serious, but doesn’t take itself too seriously. It’s emotionally compelling while never losing sight of the fact it’s also a game. It’s a popular and well-regarded game that, for whatever reason, people simply don’t talk about it enough. Hopefully with this PlayStation 4 release that will change."], ["Gamers' Temple", "Critic", "99", "All things considered, Valkyria Chronicles Remastered is about as close to perfect as it gets, and deserves all the attention (hopefully) garnered by this release. It was a godly SRPG eight years ago, and the improvements, though limited, for this remaster make the already achieved perfection even better."], ["Playstation Universe", "Critic", "95", "Valkyria Chronicles is a must-have for any tactical RPG fan,and even if you’re not a fan of the genre, the story is worth the purchase alone. Valkyria Chronicles is still one of the best tactical RPGs this century."], ["CGMagazine", "Critic", "95", "A lack of a total visual overall barely detracts from the fact that Valkyria Chronicles Remastered is a total bargain, and the definitive version of the best in strategy."], ["Easy Allies", "Critic", "90", "Although Valkyria Chronicles Remastered isn't the most fully featured rerelease, it's nonetheless an excellent way of experiencing a classic. Valkyria Chronicles is every bit as good as it was last generation and reminds us how desperately we want new entries in the series. If you haven't played through Squad 7's story yet, that's a mistake you should correct as soon as possible."], ["Critical Hit", "Critic", "90", "A compelling game that holds up to this very day and still provides one of the best strategy RPG experiences you’ll find. It’s the same game we all know and love, just prettier."], ["USgamer", "Critic", "90", "If you're a fan of turn-based strategy games and you haven't played Valkyria Chronicles, you need to remedy that. Valkyria Chronicles Remastered is a great starting point. Veterans should also consider starting up another fight to drink in Remastered's slick new visuals."], ["DarkZero", "Critic", "90", "Valkyria Chronicles received a lot of acclaim during its PS3 debut, and its praises must be sung again in this remastered port. Whatever Sega decides to do with the franchise from here on remains unclear, but at least fans new and old can enjoy one of their finest efforts in the last generation, not to mention one of the single best RPGs period."], ["RPG Site", "Critic", "90", "As far as remasters go, Valkyria Chronicles is well done and holds true to the game’s original vision with respect to elements like art style and presentation. For long-time fans looking for another go and newcomers alike, it’s still a wonderful experience from start to finish for a smart $30. Let’s just hope this isn’t the last we see of it."], ["ZTGD", "Critic", "90", "Valyria Chronicles remaster is an excellent addition to the PS4 library."], ["GameCritics", "Critic", "90", "The quality of the port and of the game itself make Valkyria Chronicles Remastered a must-play title for strategy fans who haven't cracked it yet. The proposition of a purchase might be a bit more fraught for vets who don't feel the need to revisit since there's no genuinely new content here, but there's no question that it's good to see this classic made available to new fans on a new console."], ["Brash Games", "Critic", "90", "It’s bold take on the strategy genre and beautiful presentation lends itself to an experience worth revisiting or experiencing for the first time."], ["IGN", "Critic", "90", "Ultimately, Valkyria Chronicles Remastered is a beautifully crafted and original tactical RPG. While this particular package is lacking in special features, it’s still a perfect opportunity to play a charming cult classic at a budget price."], ["Digital Chumps", "Critic", "90", "While Valkyria Chronicles always had presence of a seminal classic, its latest remaster on PlayStation 4 sets it up for a wider embrace. This is the advantage of being favorably advanced or, at least, distant from genre contemporaries; no matter when or where Valkyria Chronicles is found, it can create personal definition on its own beautiful terms."], ["PSNStores", "Critic", "90", "Valkyria Chronicles is a deeply satisfying game and one that I really only have a few minor gripes with. By the time the credits rolled I found myself completely wrapped up in a cast of like-able characters and excited to dig into the game’s New Game +. If, like me, you never gave Valkyria Chronicles a chance then there’s no better time to see what you’ve been missing out on."], ["RPG Fan", "Critic", "90", "Valkyria Chronicles Remastered polishes up one of the best strategy games in recent memory and brings it to a new console."], ["IGN Spain", "Critic", "90", "One of the most beloved games arrives to PlayStation 4 with more stable graphics and all the previous content. Do not miss it."], ["GameSpew", "Critic", "90", "Valkyria Chronicles was, and still is, one of the best strategy RPGs ever made, and this accomplished and very welcome PS4 port does it the justice it deserves. From its beautiful and timeless visuals to its engaging and often epic battles, everything about the game feels like it has been made with love and care, ensuring every moment spent with it is to be treasured."], ["Arcade Sushi", "Critic", "90", "The biggest draw about the remastered version of Valkyria Chronicles is the upgrade to 1080p resolution. However, it was already gorgeous on the PS3 eight years ago thanks to the watercolor-inspired artwork and storybook interface. Valkyria Chronicles Remastered looks exactly how I remember it looking, which is a testament to its impressive art design."], ["God is a Geek", "Critic", "90", "A great remaster of a timeless classic RPG that must be experienced by anyone looking for a great combat system and memorable characters."], ["Pelit (Finland)", "Critic", "89", "Great story and excellent game mechanics. [Aug 2016]"], ["IGN Italia", "Critic", "88", "Valkyria Chronicles is a charming and deep JRPG; perhaps not so difficult, but very funny, with strong emotion and depth. The excellent cel shading frames a truly excellent game."], ["ActionTrip", "Critic", "88", "When it comes to franchises that are worth revisiting in a new console generation, Valkyria Chronicles Remastered stands as a sterling example of how to do things right."], ["Everyeye.it", "Critic", "88", "Valkyria Chronicles lands on PlayStation 4 with the same determination that it had eight years ago. The game is still brilliant, thanks to its intense story and a solid gameplay. This current-gen version won't have a top-notch look, but includes some interesting DLCs."], ["GamePro Germany", "Critic", "86", "A timeless and fresh anime epic with thrilling tactical battles."], ["Hobby Consolas", "Critic", "86", "Exciting story told through a staged development of very successful way for the strategy and action."], ["Impulsegamer", "Critic", "86", "An esoteric mishmash of genres and with an art style that belies the more sombre elements of the storyline."], ["GameOver.gr", "Critic", "85", "While the remastered could and should have addressed some of the issues of the original game instead of adding new ones, it nevertheless remains a masterpiece. Valkyria Chronicles still is one of the best and most addictive Japanese games of the previous generation."], ["PSX-Sense.nl", "Critic", "85", "Still as much of a tactical joy as you remember. Very much worth picking up (again)."], ["4Players.de", "Critic", "85", "This was and still is a very challenging turn based tactics gem with cleverly induced real-time elements and a beautiful, timeless art design."], ["Meristation", "Critic", "85", "Quotation forthcoming."], ["3DJuegos", "Critic", "85", "Excellent port of one of the most enjoyable PS3 RTS. Magnificent in almost every aspect."], ["Multiplayer.it", "Critic", "85", "Valkyria Chronicles Remastered on PlayStation 4 adds basically nothing to the decent PC version released last year and it might look slightly inferior as well. However, it's the perfect chance for newcomers to enjoy a timeless gem."], ["Games Master UK", "Critic", "82", "Despite not enough change from the original to entice retired militia vets, there's more than enough to recommend greenhorns sign up. [July 2016, p.81]"], ["Wccftech", "Critic", "82", "SEGA has put together a simple, heartfelt tribute to the original Valkyria Chronicles that feels at home on the Playstation 4. Being able to command the Edelweiss one more time has given me a longing to play through the other two PSP-exclusive entries if they can be given the same treatment. A new Valkyria Chronicles has been a long time coming and having the entire series on one platform would be a dream if given the same high-definition makeover."], ["Playstation Official Magazine UK", "Critic", "80", "Not a lot has changed, but then not a lot had to. The characters remain the best reason to get stuck into some dastardly tactical combat. [July 2016, p.91]"], ["Playstation Official Magazine Australia", "Critic", "80", "Has aged remarkably well, and is polished enough to draw in curious newbies. Veterans should be well chuffed with all the DLC thrown in. [July 2016, p71]"], ["Eurogamer Poland", "Critic", "80", "Despite some shortcomings and impediments in the combat system, Valkyria Chronicles has barely aged at all. Sure, it's a last-gen game, but it's still charming, intriguing and forcing to use a tactical approach."], ["JeuxActu", "Critic", "80", "Eight years after it's initial release on PS3, Valkyria Chronicles Remastered come back in a new improved version that offers graphics in 1080p and 60fps, and for a very low price. A must have for Tactical RPG enthusiasts."], ["IGN Denmark", "Critic", "80", "For the quiet gamer who would rather look out the window and observe the changing seasons with a cup of herbal tea at hand than to flush energy drinks down to another team deathmatch."], ["LaPS4", "Critic", "80", "Valkyria Chronicles Remastered brings us one of the most underappreciated games when it came out to Playstation 3 in 2008. It's way to tell a story stand out of the usual, focusing on the customization options both in and outside of the battlefield. A nice price tag, all the DLCs, 1080p visuals and 60fps invite us to play it at least once."], ["Metro GameCentral", "Critic", "80", "As bizarre a mix of genres, art style, and subject matter as you could ever hope to see. But it all works together surprisingly well and this remaster is well deserved."], ["Worth Playing", "Critic", "80", "It's a little disappointing that the mechanics, story and gameplay haven't seen any noteworthy updates, but it's a great port."], ["Eurogamer Italy", "Critic", "80", "Valkyria Chronicles Remaster is basically the PC version of the game, running on PlayStation 4. The cutscenes still have the big aliasing issue, but all the other scenes in the game run with gorgeous 1080p and 60fps graphics. The gameplay is still as solid and entertaining as always. If you own a PS4 but no PC or PS3, give this awesome strategic game a try."], ["Vandal", "Critic", "80", "The only reason why you shouldn't buy this game is that you already have the original. There aren't relevant additions to the adventure, but it still is a great adventure."], ["RPGamer", "Critic", "80", "Though its new content is disappointingly shallow, the rerelease of Valkyria Chronicles is well worth a purchase for any who missed out on its first time around."], ["Twinfinite", "Critic", "80", "Valkyria Chronicles Remastered looks fantastic on the PS4, and both its visuals and gameplay hold up well today. It tells a gripping tale of difficult battles and the bonds that blossom from conflict, and it serves up a story that will keep you invested in its development and characters from start to finish."], ["Push Square", "Critic", "80", "Eight years after its initial release, and Valkyria Chronicles remains a thoroughly enjoyable strategy game. Its mix of real-time movement and tactical, turn-based decision making still feels unique, and proceedings are carried by a story that blends the harsh realities of war with more intimate, personal narratives. Parts of the remastered package do feel a little worn by today's standards, but those who missed out on joining Welkin Gunther and the gang the first time around should certainly consider enlisting for this return to the battlefield."], ["Hardcore Gamer", "Critic", "80", "There should be no doubt that Valkyria Chronicles is a modern classic that has earned each one of its fans and accolades. As the game rolls on, the battle system shows itself to be both complex and intuitive, with enough depth that hours can be lost in a blink. While some might be put off by ponderous exposition, the overall package is sublime. Players who have not experienced it before really should give it a shot, but as there is no brand new content to be found in the remaster, those who have played the original to death need to decide if a graphical upgrade and trophy support is worth purchasing again."], ["Destructoid", "Critic", "80", "Valkyria Chronicles Remastered is just as great of a game as it was eight years ago. Having it perform better and run smoother is a gift. A few things hold it back from perfection, but I'd rather have a war game strive for something new and risky like this than go with safe boilerplate action sequences. I'm happy Sega took a chance on this one."], ["Areajugones", "Critic", "80", "Valkyria Chronicles Remasterd reappears with a renewed look and a very consistent framerate. Its tactical gameplay combined with an emotional story give the game a distinctive and suggestive nature."], ["IGN Sweden", "Critic", "79", "Valkyria Chronicles Remastered looks beautiful in 1080p and 60 frames per second. The engaging and deep combat system keeps the game interesting, even 8 years after its initial release."], ["COGconnected", "Critic", "78", "This is the best version available of a great game, so if you haven’t played it, and want the most up-to-date/complete version, this is the one for you."], ["CD-Action", "Critic", "75", "A surprising, timeless mix of a visual novel, a tactical game and a shooter, spoiled by dumb AI and inescapable grind in the later stages. [07/2016, p.51]"], ["Gameblog.fr", "Critic", "70", "The remaster is a little bit lazy, but eight years after, Valkyria Chronicles is still a great tactical-RPG to discover."], ["PlayStation LifeStyle", "Critic", "70", "If you’re playing it for the first time, this is as good a version as any to get a taste of the excellent blend of turn-based strategy and real-time action that made the game such a hit on PS3; if you’re a returning fan, on the other hand, you might be slightly disappointed to learn that this “remastering” doesn’t look much different from the original version (or offer any new content, for that matter)."], ["The Games Machine", "Critic", "70", "Despite a good general quality, it's our duty to report that this remastered is just a direct porting of the cheapest PC version, without any addition: beware before you spend your money on it."], ["We Got This Covered", "Critic", "70", "While this is easily the best version of Valkyria Chronicles yet, it still doesn't quite live up to its potential."], ["Gammalad", "User", "10", "I never played Valkyria Chronicles before, but all my friends said I had to play it, so when the game came out on PS4 I decided to finally give it a shot, my only regret was not playing this game sooner. This game was a fantastic experience that had me captured from the start to the very end. I give this game full recommendations to anyone who has not played this game before and is looking for a good tactical RPG."], ["muffinman1", "User", "10", "Valkyria chronicles remastered captures the essence of the original now in 1080p, 60fps and just as new. While the remaster was done well, I expected 2 and a localized version of 3 to go along with it."], ["Abrill", "User", "9", "Valkyria chronicles is a fantastic game. Generally by the end of most RPGs I'm dashing through the last 10 hours, ready to move on to the next game, and burned out on stale mechanics. On the flip side, Valkyria chronicle left me wanting more.  The pacing was impeccable. With light innovations on many boards, the game remained fresh until the end. After sinking 50-60 hours plus on most RPGs \"new game plus\" is not usually somethings that I have any interest in doing. I will however certainly be revisiting this game."], ["NiclName", "User", "10", "Very enjoyable RPG turn based strategy game. The story is nice though not really unqiue. The characters have some depth, though they are a bit on the shallow side. The game is addicting, and makes you want to play more to find out what happens. The only minus is that enemy turn is unskipable, and with large enough enemies it takes ages for the enemy to play."], ["gamer55551", "User", "10", "My review of Valkyria Chronicles Remastered for the PS4"], ["Galbro", "User", "10", "Simply the best tactical game i ever played."], ["DMcGee2288", "User", "10", "Everything that made this game special is that much better on the ps4. Not only does it include all the DLC from the ps3 version, it also has a 60 fps and HD re-mastered quality of graphics making this game shine golden all over again. Never understood how some people skipped on this one or how very few found it boring or tiresome. This game truly innovates its genre of tactical RPGs with genuine and unique quality traits not found in any other game before it. I was impressed with this game way back when it came out on the ps3 so long ago, and I'm even more impressed that they brought it back and boosted it up to be an even better of a game then it was back then. Can't wait for the \"sequel,\" or \"spiritual successor\" if you will, that will come most likely next year. If you are a fan of tactics ogre or final fantasy tactics, this is your game! Any fan of RPGs, especially tactical RPGs, will fall in love with this title. It has so much to offer and the story and plot, as well as combat system and gameplay, will leave you begging for more."], ["Flypaper", "User", "9", "This game has good characters, good story (takes a bit  of time to get going), and good strategic slow paced combat.  The art style and music add a lot to the magic of this game. Welkin, the leader of your squad is a very likable character and most of them are likable once you learn their past and get past their shells.  Highly recommended to fans of recent Fire Emblem games and anyone wanting a good story with likable characters."], ["cesc_larenas", "User", "10", "This game is in one word FANTASTIC. I'm expecting a new one in the short term and also I'd love to see Valkyria Chronicles 2 and 3 remade for the PS4. In fact, Valkyria Chronicles 2 it's in my personal all time top five rank, even if it was only released as a minor game exclusive for the PSP. Get it, give it some time to check that lenghty tutorial and then only enjoy"], ["russianrulz", "User", "0", "The game probably deserves a good 5/10 (meaning not worth playing unless REALLY bored) but I needed to give it a 0 to bring the overall down to where it should be. I am not going to argue that the story is boring, the cutscenes are poorly done and so on. I do think that this is true, but many people seem to like it so I wouldn't focus on that very much. The biggest problem with this game is the combat and how poor the mechanics are. First of all you will go into each battle with little idea on whom to bring with you and as this is important you can find yourself in a bad situation and need to restart. You will get a B if you play well and try to enjoy yourself if you want an A make all scouts and storm the enemy camp. So let me ask you, does that seem like a good mechanic to you were most of the time most of your soldiers are useless? Also, actually attacking is a disadvantage as enemies can shoot you endlessly while you approach, hence killing you and this is automatic and happens all the time (unless you flank). Also, it says they stop firing at you as soon as you aim, but no they can still get a few many shots in before the system kicks in also helping in the killing you part. Hiding behind cover is overpowered for enemies, as what was killing an enemy after 2 hits now becomes 20 hits so good luck and basically no unit can kill them in one go (so they will return fire). I have just started this nothing yet and I assume you can see that the strategy part of this game is messed so I'll summarize:"], ["GrumpyReviewer", "User", "8", "I absolutely love this game and played it when it came originally on the PS3. The remaster is gorgeous and the game is fun as always. But I must ask: did they change the difficulty? Because I remember I breezed through it, years ago, and suddenly am facing some challenges now. Maybe I am getting old. The good news is: this game isn't. It is fresh and new as you would expect from a new release. Anyone even a little interested in RPG and real time strategy games should not let this one pass you by. It is an absolute gem."], ["hokido", "User", "9", "I remember being tempted by this game back when it was originally released back in 2008 but opted against it for some reason but it caught my eye again in the ps store and it though what the heck lets give it a try."], ["illphil", "User", "9", "Really good game that has turned me on to this type of game.  It's turn based war strategy, but with you taking third-person control of each unit.  It's really engrossing and even though the story is cheesy, you still get involved in it.  You will have your favourite troops that will die and some gritty battles that you almost lose- it's tense and fun.  Totally recommend it."], ["marykaymylove", "User", "8", "VC is a tactical FPS game which offers an in depth level of tactical combat and gameplay. Each character is unique and have its own function to complete the game. The gameplay is also innovative because it incorporates both FPS and turn based elements."], ["Avorax", "User", "10", "Uno de los mejores juegos de PS3 y de los más desconocidos, con un pequeño lavado de cara, todos los DLCs y un precio increíble( ojala todos las HD y remastered version fuesen así ) hace que aquellos que disfrutamos  hace mas de un lustro de el, caigamos otra vez en su embrujo y aquellos que desconocían el titulo.....¿ ¿¿a que esperáis???"], ["Moge4579", "User", "10", "Bueno"], ["Tallulah", "User", "10", "The game is perfect."], ["lex246", "User", "10", "seems very fun, game play is simple enough to get into but is definitely one of those games where mind counts big time, it may take time to beat at times (some more then others) but just feels that much better when you do, if you never played the game before like me then this is a pretty good start"], ["Semtex_Steve", "User", "7", "I bought this game a few days ago and its quite enjoyable, but not exactly what I was expecting. The art style is very nice and unique and the story is charming though slow paced and sometimes rather cheesy. The gameplay is fun, but it doesn't really give you as many tactical options as it should in certain missions and the mechanic of enemies being able to shoot you when you are trying to move your squad mates around takes a lot of getting used to - though it is quite difficult to have any of your team members actually killed instead of just knocked out - so the only real danger is of losing the mission entirely due to having too many of your guys KO'd, or having your tank taken out by a lucky shot to the weak spot. I think I would have enjoyed this game much more if I'd played it before Xcom, but seeing as I didn't the gameplay and tactics that you can use seem a bit simple in comparison - though I understand that the mechanics behind both games are vastly different - I just think Xcom offers a better experience for squad oriented, turn based shooters."], ["Stlat", "User", "4", "This game does strategy like brawl does competitive. Only good thing is the jiggle physics and occasional fan service, would only recommend to weebs who prefer visuals and having to figure out everything on their own through a great many restarts. Everything in this title, from the god-awful immersion of the universe—Ie what's supposed to be the Axis using Char B1's, the creators of this game thinking the blitzkrieg was done by shock troopers instead of perfect conjunction between CAS and armored divisions, and the immense amount of contrivances from the first hour for the special snowflake protagonist made me had to a break right off the bat—to the 'combat' which gives horrible flashbacks of bullet sponges from Fallout 4."]], "platforms": ["PlayStation 4"], "image_url": "http://static.metacritic.com/images/products/games/4/d9d409d1db4937ed01818fdd76cb178e.jpg"}
{"publisher": "SegaSoft", "genres": ["Strategy", "Turn-Based", "Tactics"], "rating": "T", "title": "Valkyria Revolution", "release_date": "Jun 27, 2017", "avg_score": "54", "summary": "Jutlands elite soldiers, the Vanargand, must band together to defeat the Ruzi Empire and stop death itself - the Valkyria. This grizzled anti-Valkyria squad is equipped with advanced mana weaponry and has the powerful ability to wield ragnite spells to combat this terrifying threat. The unit is comprised of soldiers who have a high affinity for ragnite, and even Jutlands own Princess Ophelia has joined the ranks. The princess carries the utmost love for her country and has answered the call of duty to liberate those who are suffering from the Ruzis tyranny. However, Amleth Gronkjaer, the commanding officer of Vanargand hides a terrible secret. Is he friend or foe to the country he has sworn to protect?", "reviews": [["Game Over Online", "Critic", "90", "Overall, Valkyria Revolution does many things differently than Valkyria Chronicles and will be quite divisive. As a fan of Chronicles, I found that game to be better overall and yet the faster pace of Revolution makes this more fun to play – the story just doesn’t hold up as well and the graphics are less impressive here than Chronicles. The action RPG shift works at keeping things interesting on the battlefield at all times and keeps you on your toes too. It does suffer from some iffy textures, but the game is greater as a whole than the sum of its parts. It’s a fantastic gateway game for the franchise for newcomers and offers veterans a completely new gameplay experience in many ways while also keeping some elements similar enough to make for a smooth transition."], ["Digitally Downloaded", "Critic", "90", "An intense, special, and downright important game, with a powerful message to share not just about war itself, but also how we also talk about, and share stories about, war."], ["Wccftech", "Critic", "80", "Dropping the tactical experience of the Chronicles series, this spinoff opts for a darker take on war, focusing on swordplay and subterfuge in a tale of revenge that will forever shape the future of Europa."], ["Twinfinite", "Critic", "80", "There’s a lot of repetition for battles, and lengthy sequences of cutscenes can certainly slow things down, but Revolution tells an engaging story with characters that grow on you over the hours of gameplay. Similarly, the combat system and customization grow, providing a much more engaging action experience in the latter half of the game."], ["Hardcore Gamer", "Critic", "80", "Valkyria Revolution is an excellent action-RPG if you’re looking for something new after playing through Final Fantasy XV."], ["CGMagazine", "Critic", "75", "Valkyria Revolution's story falters while its different, action-oriented combat shines brightly."], ["Everyeye.it", "Critic", "75", "Quotation forthcoming."], ["Impulsegamer", "Critic", "72", "Overall, I started the game with a bit of skepticism since I was only familiar with it’s turn based system which I quite enjoyed for the setting it was in, as it presented you with time to think and was more of an RTS, tactical kind of approach which I enjoyed greatly. At first it was a little odd to adjust to, but the faster pace gameplay fits the setting better than a turn based system would with all the options for combat they’ve put in and it actually gets quite addicting to play the different class roles, I miss the old play style, but I can enjoy both quite easily so I don’t feel I’m losing out. The games’ value is great too at $59.95 upon release, I’m actually quite pleased it’s not more, it’s around the average price for this kind of game, but in a world where a lot of games are $80+ for base editions and $100+ for special editions it’s a welcome bracket to fit into."], ["Hobby Consolas", "Critic", "72", "Valkyria Revolution offers a new combat system (instead of the classic turn based system) that doesn´t work well. Levels are too similar and the secondary missions become boring."], ["PSX-Sense.nl", "Critic", "70", "A touching story and decent gameplay aren't enough to lift Valkyria: Revolution out of the uncanny valley. The whole thing just feels a bit off, which is a damn shame."], ["Atomix", "Critic", "70", "Valkyria Revolution is not a bad game by any means, but fails big when trying to reflect the essence of the Valkyria Chronicles series in a genre that doesn't suit it at all like Action. Yeah, it offers a functional gameplay and interesting strategy mechanics, but in the end none of them work that well nor capture the magic that made the original Chronicles trilogy become a cult among gamers."], ["Eurogamer Italy", "Critic", "70", "Quotation forthcoming."], ["COGconnected", "Critic", "70", "If you like a deep, interesting story in your RPGs, Valkyria Revolution will deliver. There’s a compelling 70-plus hours of content her that almost justifies its Shakespearean ambitions – despite the slings and arrows of boring combat, and the sound and fury of long cutscenes. If the question is To Play or Not to Play, I would say play, but just be prepared for a few tragic flaws."], ["Meristation", "Critic", "70", "Despite having many good elements, such as the amazing story or the great characters, the game tries to be different from Valkyria Chronicles while being too faithful to it. Therefore, the result is gameplay that lacks personality and doesn't really know what it wants to be."], ["SpazioGames", "Critic", "70", "Valkyria Revolution is an experiment, more similar to a musou than to all of its predecessors, and this won't resonate with the majority of the fans of the franchise. But, taken for what it is, it's still a decent action game with light RPG and strategic elements."], ["IGN Italia", "Critic", "70", "Valkyria Revolution is a rather canonical JRPG, seeking its own identity within the SEGA gaming universe, succeeding only in part. The combat system is unreliable, and its hybrid nature does not fully exploit the interesting ideas of which the game is still dotted. The Media.Vision game stands out for the topics dealt with, the great atmosphere and the extraordinary OST. It is a shame that the heart of gameplay is not as powerful."], ["IGN Spain", "Critic", "65", "Anecdotal and experimental delivery that will not affect the annals of history and that will live in the shadow of the trunk series of Valkyria Chronicles."], ["PlayStation LifeStyle", "Critic", "65", "Those expecting the same level of depth and strategy as Valkyria Chronicles will likely end up disappointed by this spin-off. When judged on its own, though, Valkyria Revolution delivers an interesting narrative and some solid, if unspectacular, action. It’s too bad that the game never truly hits a stride, as missions are rarely memorable, and ultimately a lot of interesting ideas never get fully fleshed out."], ["Vandal", "Critic", "65", "Valkyria Revolution seems like an experiment to get new fans for the main franchise, although we don't think it's going to achieve it. It isn't a bad game, but it is far from the quality of the original trilogy."], ["GameCritics", "Critic", "60", "I can’t praise Valkyria Revolution‘s story enough. It’s a clear-eyed meditation on the horrors of war – even, perhaps especially, justified war. If the developers had found a way to make the dreary, repetitive combat as worthwhile as the story that frames it, this would have been an incredible game."], ["Game World Navigator Magazine", "Critic", "60", "Revolution has little to do with Valkyria Chronicles, as it is not a turn-based strategy, but an action-RPG, so closest point of reference would be Final Fantasy XV. Compared to it, some things in Revolution are better – like being able to control any of the four characters, – and some are way worse, like overly-simplistic gameplay and graphics that make Dynasty Warriors series come to mind. [Issue#222, p.58]"], ["ZTGD", "Critic", "60", "Valkyria Revolution is a title that undoubtedly suffers due to the comparisons to its superior predecessor. However, when viewed as a standalone title, it features an interesting story with a cast of characters well worth exploring. Even though the combat engine is dull and flawed in many ways, it’s serviceable for the scenarios that the game presents and at a bargain price, you could do worse than pick up Valkyria Revolution."], ["NZGamer", "Critic", "60", "A great deal of time devoted to very little gain. Revolution’s lacklustre action RPG gameplay is matched by a nearly complete disregard for building sympathetic characters, who exist to serve an underwhelming narrative. Valkyria Revolution fails on almost every level to recapture the qualities that made its predecessors cult classics."], ["Game Revolution", "Critic", "60", "Series newbies lacking preconceived expectations will probably have the most fun with Revolution, but it’s hard to imagine fans being thrilled with the game’s at-times confused direction even if they do fully understand its proclaimed spinoff nature."], ["DualShockers", "Critic", "60", "The attempt to make everyone happy resulted in a a battle system hindered by its duality."], ["Stevivor", "Critic", "60", "Melee attacks and a general active feel just don’t work in a tactical RPG."], ["GameSpot", "Critic", "60", "Taken as a whole, however, Valkyria Revolution just doesn't come together as well as it should. Between the poor story presentation, AI issues, and numerous superfluous systems that add little to the experience, it feels like the game needed a bit more time and planning for all of its ideas to properly congeal. While Valkyria Revolution offers some enjoyment, you're going to have to wade through the trenches to get there."], ["GameCrate", "Critic", "60", "While there is some fun to be found in Valkyria Revolution’s battle system, it’s just not worth sitting through the story bloat and excessive loading to get there."], ["Multiplayer.it", "Critic", "60", "Valkyria Revolution is nowhere near as good as Valkyria Chronicles and luckily it may be just a short detour into a hybrid musou/action territory. Story is kind of OK but plagued by overstaying cutscenes and loading screens, while everything else is shallow and very low budget."], ["Game Informer", "Critic", "60", "If you dig deep, you can find charming parts of Valkyria Revolution – the thrill of taking down a group of foes with a well-placed grenade, or the rousing music and majestic scenery combining for a memorable moment. But these bright spots are far too rare in an experience that deals primarily in drudgery, from repetitive missions to overlong expository scenes. Even if you find and appreciate the good parts, the prize is too small for the price you pay on the battlefield."], ["IGN", "Critic", "60", "Valkyria Revolution tells a decent tale of war, but the strength of that story is dulled by overlong, boring, and poorly animated cutscenes. It sacrifices the unique historical setting and art style of the Valkyria Chronicles series proper in favor of generic JRPG elements that fail to leave a strong impression, and its hack-and-slash combat offers little in the way of strategy and ruins its own flow with an poorly matched magic system."], ["Video Chums", "Critic", "57", "Valkyria Revolution is a noble effort at providing fans with a fresh take on the series but it unfortunately doesn't quite live up to its genre contemporaries. That being said, it may satisfy if you simply want to be immersed in an intriguing tale."], ["XGN", "Critic", "55", "Valkyria Revolution tries a lot of new things, but loses the Valkyria-soul in the process. The combat system is stuck between action and tactics and the style is completely different. It's only saved by an interesting story and beautiful soundtrack."], ["GamePro Germany", "Critic", "55", "It is a confused mess of superfluous mechanics, confused AI, unfinished approaches and monotonous Brawler gameplay. Valkyria Revolution is well-presented and well-written, but in the end, it is just a nice package for a game that has failed at its core."], ["TheSixthAxis", "Critic", "50", "Valkyria Revolution’s biggest crime is that it is utterly dull. The tonal changes to the narrative, and to the combat system, are completely pointless, and not only do a disservice to the Valkyria name, they render it meaningless. Such are the differences between the two titles I don’t understand why they bothered to sully the series’ fantastic reputation with this release."], ["Trusted Reviews", "Critic", "50", "It isn't clear why this real-time game was created at all, when the world would be far happier with another BLiTZ system title. It makes it tough to recommend, even for a Chronicles aficionado, because the other things that went into making the earlier game so enjoyable – a jaunty alternative history/fantasy plot populated by an interesting bunch of characters – feel half-baked here. Everything, from gameplay to graphics to the storyline, is worse."], ["GameOver.gr", "Critic", "50", "The video game monster of Dr. Frankenstein, Valkyria Revolution is a huge pile of dozens of mismatched, poorly designed systems, bland presentation and poor design choices all over the board. It bears no similarities to its wonderful predecessors apart from an interesting plot, which is unfortunately torn apart by the thousands of cutscenes and loading screens."], ["Gamer.nl", "Critic", "50", "Valkyria Revolution is a game that is just wrong in so many ways, we wonder how it could end up this way. The cutscenes are way too long, the story is bland and it is just so frustrating all together."], ["The Games Machine", "Critic", "50", "Boring, verbose and too easy to complete: Valkyria Revolution, despite its name, is a real \"involution\" of the series. Easily forgotten."], ["Destructoid", "Critic", "50", "Valkyria Revolution is constantly at odds with itself. It tries to be an action game, but at the behest of fans, more strategic elements were shoved in. You'll go into an action-packed warzone full of enemies to slice up, then you'll be rewarded with a seemingly endless amount of cutscenes lacking sound and fury and signifying nothing."], ["Polygon", "Critic", "45", "The true misery of Valkyria Revolution is how much of the series’ roots show through, and how much Revolution itself doesn’t know what to do with them. The qualities that defined earlier Valkyria games are mostly vestigial, but Revolution doesn't present anything strong enough or distinct enough to replace them. What it does do often directly conflicts with those legacy bulletpoints, making a game that feels like a bland timesink at its best and a fractured mess at its worst."], ["Playstation Official Magazine Australia", "Critic", "40", "For all its many faults, the script does at least make a valiant effort of recognising and explaining the politics of war and propaganda. That doesn’t change the fact that there’s an army of games more worthy of your money. [October 2017, p75]"], ["DarkStation", "Critic", "40", "This all may come across as overly harsh and a tad vindictive, but I really wanted to love this game. There's so many juicy elements in Valkyria Revolution that could have been molded into a truly wonderful experience, but all those pieces just never seemed to properly assemble. I appreciate that the designers tried something new with the combat, but trying to blend strategy RPG elements with a hack 'n' slash just didn't work in this case. If you're curious about the Valkyria franchise, my advice would be to pick up the HD remaster of the original Valkyria Chronicles. I can't speak for the two follow-up games released on the Vita, but I can say, with certainty, that Valkyria Revolution is not worth your time or money."], ["Playstation Official Magazine UK", "Critic", "40", "This revolution deserves to be mercilessly crushed. [Sept 2017, p.82]"], ["Gamers' Temple", "Critic", "40", "By the time I finished Valkyria Revolutions, I was almost comically over it. The most telling moment of the entire experience came as I was nearing the end, and my wife came downstairs and asked me, \"Ugh. Are you watching that game again? Play something more interesting!\" That's right, \"watching that game again.\" With so many cutscenes, only broken up by uninspired action with ideas that don't work or aren't utilized correctly, Valkyria Revolution is tough to recommend to anyone for any reason. If the alternate history angle of the story excites you, you'd be better off playing any of the Chronicles games. If action RPG combat is your thing, Dynasty Warriors, Hyrule Warriors or the upcoming Fire Emblem Warriors should scratch that itch much better than this game can. And if you are a longtime fan of the series, like I am, I can't do anything but warn you; this is not the game you wish it was, nor expect it to be. Please, Sega, let's go back to the way it was. This Revolution is not a welcome or a successful one."], ["App Trigger", "Critic", "40", "Valkyria Revolution is an extremely wrong-headed attempt to re-invent a series that needed no such treatment, and falls short on just about every level."], ["Metro GameCentral", "Critic", "40", "An inexplicably dull follow-up to Valkyria Chronicles, that jettisons almost everything that made the original interesting in favour of bland Dynasty Warriors style combat."], ["Gameblog.fr", "Critic", "40", "Valkyria Azure Revolution is the spin-off no one was waiting for. Every component which made the Valkyria Chronicles saga so famous is absent from this bad \"sequel\". The graphics look awful on PS4, the casting is generic at best and its action-RPG mechanics are some of the worst we've ever seen in the last decade. Why would an action-RPG make you pause the game every time you want to use a skill? Why, SEGA ?"], ["USgamer", "Critic", "40", "Tries valiantly to weave a tale of political intrigue, but it's undermined by repetitive mission design, poor menus, and an anonymous cast. If you were hoping for a worthy successor to Valkyria Chronicles, you will be sadly disappointed."], ["4Players.de", "Critic", "37", "Very tragic: There is actually an interesting game hidden somewhere in Valkyria Revolution. Well, sorta - there would be, if all the elements and layers would be connected."], ["RPG Site", "Critic", "30", "I do genuinely think that the story itself is serviceable, but its presentation absolutely destroyed my interest in it. There’s some merit behind constructing a band of characters manipulating an entire nation for their own purposes. It’s a nice change of pace from typical RPG protagonists and though all the story beats aren’t all that good, there were intriguing ideas behind it all. It’s difficult to recommend Valkyria Revolution if you’re looking for an enjoyable game. This was an ambitious direction to take the series to and I don’t think it was the right call."], ["Edge Magazine", "Critic", "30", "The result is a tiresome slog that proves the first casualty of war is not innocence, but brevity. Valkyria Devolution might have been a more honest title. [Sept 2017, p.108]"], ["PlayStation Country", "Critic", "30", "There is almost nothing to recommend with Valkyria Revolution as it fails to hit the mark in every aspect having, for some reason, changed pretty much everything which made the first game great. What you're left with is a very forgettable action RPG which frustrates with an overly long and dull story and simplistic and clumsy combat."], ["Push Square", "Critic", "30", "Valkyria Revolution is like a bizarre, alternate reality version of Valkyria Chronicles in which everything that the original got right has somehow been twisted into something awful. The devolution of interesting and quasi-relatable characters into eye-roll inducing stereotypes is upsetting, and the technical shortcomings of the game are disappointing. But it's the combat of Revolution that suffers most in comparison to Chronicles, and indeed, in comparison to practically anything else in the genre. Where Valkyria Chronicles was a constantly rewarding strategy game, Revolution is an action RPG so utterly devoid of any potential to challenge or delight that the only strategy you'll require is working out the quickest bus route back to the shop to get your refund."], ["Slant Magazine", "Critic", "30", "Even worse, the real-time action, a departure from Valkyria Chronicles, fails to heighten the drama of the proceedings, constantly bringing to mind the superior combat system of 1990s RPGs Secret of Mana and Secret of Evermore."], ["CD-Action", "Critic", "20", "Ladies and gentlemen, we present you “The Worst of jRPG”. [09/2017, p.57]"], ["GrumpyReviewer", "User", "4", "Despite all the bad reviews, I have so much love for this franchise that I just HAD to try this game out. I was sure I'd like it, somehow. It did not happen."], ["JagdCrab", "User", "3", "Closest Revolution comes to first 3 games is it's title. Tactical combat system completely tossed out and replaced by real-time action RPG. Alternative history WWII is replaced with swords, magic and mechas that again, more of a magical device, rather then machine powered by ragnite."], ["DJammers", "User", "5", "As a fan of the Chronicles series, this game did not meet my expectations. Ridiculously long cutscenes coupled with loading screens makes this game at times a pain to play."], ["Rangertwin1208", "User", "2", "Incredibly disappointing. This, plus Akiba's Beat and Caligula Effect are the most underwhelming JRPGs we got this year (even the SAO game released last month is far better than this, and that's just sad). Valkyria Revolution barely improvises from its preccesor. Th combat consists of button smashing, the strategy is very monotonous and lacking, the characters are absent of any charms, the bosses are very tedious, the graphics are somewhat worse than Chronicles', quests are repetitive, loading screens are annoying, and the story is very nonsensical.  I recommend that you just get the remaster on the PS4, or even on the PC (hell, even the ps3 version still holds up). Th only thing Revolution has that's salvageable is the OST. Other than that, is just a bland JRPG that doesn't satisfy any of the fans of the genre, nor the franchise. And even if you are an Xbox One gamer who is need of a JRPG (which makes no sense because why would you buy a console that barely sold in Japan, thinking it would have almost as the same amount of JRPGs as the PS4's and Nintendo's JRPGs?), then it is better off that you just get Final Fantasy 15, or just get Lost Odyssey, Blue Dragon and Vesperia through backward compatibility."], ["snakekill321", "User", "7", "If you can get past all of the cutscenes and some voice acting, you actually have a solid action RPG game. It was an enduring tale and plight. The story and sounds are so well done that I would scored this higher if not for the abysmally long cutscenes. The gameplay is where the game does great, and it may not feel like the old valkyria games, but if you take off the nostalgia glasses, this is worth the 40$"], ["joshp177", "User", "6", "I am updating my original rating after playing a little bit more, and bumping up the score.  The graphics are nice, and the soundtrack is great.  Both of them combined makes this seem like a Valkyria game.  The combat is a mix between action and turn based, but heavy on the action side.  My two  biggest complaints are the new battle system, and how easy the combat is at the beginning. I don't know if the game gets harder, but I can mash the X button and barely get damaged to achieve victory.  I want a challenge and to incorporate game strategy and this game isn't bringing those features.  The story is ok, but I haven't gotten far enough to comment on it."], ["chad_pattan", "User", "7", "For the first time, the scores aren't completely off the rocker.  They're lower than I expected but people's reasons (generally) are acceptable."], ["RazielAU", "User", "9", "I loved the original Valkyria Chronicles (and its portable sequel), and they're still what I prefer between the two gameplay approaches. Having said that, this game seriously isn't anywhere near as bad as some people are making it sound. Yes, Valkyria Revolution isn't what fans expected as they wanted another game that played exactly the same as the originals, and that's not what we got. But it really isn't a bad game and there are things I feel Revolution does better than the original games."], ["Prrgangsta", "User", "5", "Man this was a waste of $40 that I am already regretting. Alright so Valkyria Revolution is the new spinoff game of the Valkyria Chronicles series and it is very hard to like this one. Action RPG elements take the place of the strategy in this one so now there is no moving squadmates one at a time. Now you control one character while a group follows you into battle. Combat is probably all this game has going for it with the use of skills and even magic now."], ["Izzytehpwnr", "User", "10", "Dont let the haters misdirect you."], ["geiniro", "User", "9", "It's a great game, don't listen to people saying \"Not good because it's not like Chronicles''. It's a great spin-off and many more DLC will be released this year"], ["Zhei", "User", "0", "My god...I don't have words to say but this game is terrible a mess in everthing...characters, story, soundtrack and gameplay pretty everthing was poorly made..."], ["gilder66", "User", "8", "Lots of story sequence makes for a slow start and Im betting thats where a lot of the low review scores are coming from. Once you get into the meat of the game its a good SRPG/ARPG hybrid that takes some risks to be a little bit different from the pack. Some of those risks dont pay off but most of them do."], ["FanboySEGA", "User", "10", "Solo por la banda sonora magistral, y salir a precio reducido, merece un 10. Y la critica en castellano, por todos los castellanoparlantes que entramos en metacritic y merecemos que se considere nuestro idioma también."], ["Ryengeku", "User", "10", "Disclaimer:"], ["Squall81", "User", "8", "Underestimate this game is a big mistake!"], ["BrandonTjon", "User", "7", "The dead on arrival game that went out with a bang,"], ["Scritty", "User", "3", "I'm not a fan of action RPG's and much prefer turn based. I have all the VK games including the PSP exclusive and love them all. Until this one. The devs made a great play of saying, after initial fan criticism that they were moving away from TBS to ARPG that they were introducing tactical elements. Well maybe they did, but they are pretty much none existent. The world is full of action RPG's so many franchises do this, and so many more convert from turn based to ARPG (Final Fantasy just has) It's nothing to do with being an old gameplay system - it's to do with a large minority of gamers preferring it - always. Yet every game moves to the Demon Souls, God of War, Final Fantasy 15, Witcher style of gameplay. I bought it because I loved the franchise before this game and the devs said they were introducing tactical elements. The franchise is now cack - and the tactical elements are so minimal as to be not even worth considering. Not only that, but it isn't a particularly good ARPG, and the textures are really pretty poor, often mashing up \"blending#2 into each other. So even as an example of the franchise in  a different genre of game - it's still cack. Back to X-Com and Hard West etc. Much better games than this tripe."], ["h0mez", "User", "4", "the story of the game is the strong point, the combat is lackluster, and the reason why im giving it a 4 is when nearing the end you have to fight Gilouche i got bugged out twice, his hp stays at 0"], ["Bubba1235", "User", "10", "The complaints about this game are completely unjusitified. The story is truely amazing. If i had to compare it to something it would be persona 5. It has a similiar feeling of 5 people manipulating things behind the scenes to get justice. Except in this game it also has a world war 1 feeling to it. The story telling is not for most. It is very long spoken.  But if you like a good story"]], "platforms": ["PlayStation 4", "PlayStation Vita", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/4/4712b388a75bad5742ad46c9fc752f4b.jpg"}
{"publisher": "Blue Isle Studios", "genres": ["Action Adventure", "Open-World"], "rating": "T", "title": "Valley", "release_date": "Aug 23, 2016", "avg_score": "72", "summary": "Explore the vast and beautiful game world of Valley using the power of the L.E.A.F. SUIT: a fierce exoskeleton that grants exceptional speed and agility along with the phenomenal ability to manipulate the life and death of all living things.", "reviews": [["Gaming Age", "Critic", "100", "You won't be sinking days after days into Valley — but the one day or so you do spend with it will be enough to stick with you for a long time."], ["PlayStation LifeStyle", "Critic", "90", "I don’t know what I expected with Valley, but this was not it. I was not prepared to find an exploration game with a powerful story, fun exploration mechanics, a unique twist on death, beautiful artwork, and one of the best video game soundtracks in the industry."], ["PSX-Sense.nl", "Critic", "85", "A walking simulator that's very much worth playing, Valley sports wonderful environments, intuitive gameplay and a brilliant soundtrack. To top it all of, this game's story is memorable almost to a fault."], ["The Jimquisition", "Critic", "85", "Despite a few missteps, Valley is an overall rush of an experience. Taking cues from BioShock with some Fern Gully on the side, there are few games that can claim to put players into the metal legs of an interdimensional necromantic freerunner, and be bloody infatuating while it does so."], ["Shacknews", "Critic", "80", "There are layers here, and it all meshes wonderfully; the story, playing out like a radio drama as you explore the locations in which it took place; the Valley as this beautiful, vulnerable, and magical location; and the themes, which explore life, death, and purpose with surprising nuance."], ["GameCritics", "Critic", "80", "Despite a cliché story, unnecessary combat and some borrowed elements, Valley delivers a well-paced, beautifully scored, and engaging first-person adventure. At times it achieves an extraordinary sense of majestic isolation, but more peaks and less valleys would have helped this adventure truly soar."], ["God is a Geek", "Critic", "80", "Valley is a surprisingly smart and fun adventure game with fluid movement and intuitive controls, although it doesn’t last long."], ["ZTGD", "Critic", "75", "Valley is a mish mash of other games before it, but still retains a unique feeling all to itself and my time with it was pleasantly surprising with it."], ["COGconnected", "Critic", "75", "Vibration from the controller and the sheer speed and sense of losing control feels great and makes you believe you are in a powerful suit."], ["GameSpot", "Critic", "70", "Valley feels like a good first act. Despite obstacles that tend to abruptly kill your momentum, running and bounding through wilderness remained exciting. The world's history is so intriguing that I left wanting to know more. I didn't want the adventure to end, and like a jogger who's forced to slow down in the middle of a run, I was frustrated that Valley had to end so soon after it began."], ["Push Square", "Critic", "70", "Valley's heart is most definitely in the right place, and for the most part it succeeds in the execution of its gameplay mechanics. Unfortunately, the game's technical faults can't be ignored. The sloppy framerate in particular damages the experience far too much, and has held back what would otherwise be a great game."], ["Vandal", "Critic", "62", "Valley has a really good start, but it quickly fades into monotony. There are good ideas behind it, but it doesn't make the most of them throughout the adventure."], ["NZGamer", "Critic", "60", "Valley’s answer to one of its main mysteries doesn’t quite satiate the curiosity it taunts, though it wisely leaves others unsolved."], ["GameSpew", "Critic", "50", "It is unfortunate that the game is a rehash of almost every popular indie game from 2012 onwards, because it starts off fairly well."], ["IGN", "Critic", "50", "A seemingly pointless resource management system presents some interesting aesthetics, but overall, Valley very rarely presents the challenge or consequence it really needs to be addictive."], ["mrigm", "User", "10", "Great game, immersive, fun story, graphics, gameplay, you name it."], ["MonkeyMan1976", "User", "9", "I absolutely love this game! Came out of nowhere. As soon as the Valley opens up and that music starts - kind of like Enya meets Lord of the Rings - it grabbed me. What starts out like a walking simulator quickly ends the when the LEAF suit gets discovered. That's when the smile came across my face - with the epic leaps and insane running down hills at speed. The story is cool, about a WWII weapons project competing with the atomic bomb project. But the real cool aspect is the Valley's balance of life and death which forces you to be careful with the energy you use. Overall, even though its kind of short, I think its one of the real indie sleeper hits of the year!"], ["Wolfenstein51", "User", "9", "This game really surprised me.  It is a very unique game and you probably have never played anything like it.  It was very immersive and I loved how fast you could run in this game.  The jumps were really cool and the game runs quite well.  It is very intuitive in that you will always get a sense of where to go even though the game does not hold your hand.  The only drawback are a poor save system where it makes you play long sections you played before if you have to leave the game.  The indoors stages were a bit too dark for my tastes.  Other than that, everything else in the game was excellent.  I finished the game in 2 sittings which should tell you how much I enjoyed it.  It is about 5 hours long, but worth it.  I picked it up for 13.99 in the Xbox sale."], ["DrDollaryDoo", "User", "10", "This game is criminally underrated, While short, it is an example of quality over quantity.  Calling it a walking simulator is simply wrong, technically it is a first-person shooter, yet throughout the game you will easily spend more shots bringing things back to life rather than killing them. The story is primarily conveyed via audio logs which while nothing new, is used to great effect when combined with the high-speed exploration the game's L.E.A.F. suit provides. While not particularly challenging to complete, it is enjoyable from start to finish, and really, isn't that the point? While not perfect, I give it a 10 because I'd easily recommend it to anyone."], ["Evono", "User", "10", "This game i dont know what to say. i probably played around 300+ games already. and each year i think this new game is Meh or medium good only rare ones surprise me and make me really think \"wow\" or make me play it straight in one session till end ( because its so great )"], ["SuperkenGaming", "User", "7", "Valley"], ["Yanni_", "User", "10", "Incredible, visceral, awesome game feel, strong narrative qualities and an beautiful environments, Valley is an amazing experience. The soundtrack itself is worth to try it. Probably one of the best indie game I've ever played."]], "platforms": ["PlayStation 4", "iPhone/iPad", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/5/3de1c30e44dd8c21fa3dd12473610f73.jpg"}
{"publisher": "LOOT Entertainment", "genres": ["Action", "General", "Arcade"], "rating": "E", "title": "Velocibox", "release_date": "Jul 28, 2015", "avg_score": "62", "summary": "Experience lightning-fast twitch gameplay, with mind-bending flips and spins, that is sure to challenge (and maybe frustrate) even the most hardcore of hardcore gamers. Velocibox promises to test your abilities to the brink, and beyond. Advance through 80+ patterns and levels by dodging obstacles at break neck speeds. Rely on split second reactions and instincts as you flip and rotate sideways to navigate through each diabolical level. [Sony]", "reviews": [["Game Rant", "Critic", "90", "Velocibox is a a tremendously hard bit of brilliance. It’s highly replayable and it comes highly recommended."], ["ZTGD", "Critic", "80", "This game is not for the faint of heart, or those that have slower than lightening fast reactions. But if you crave a simple, fast paced and demanding challenge, then this game may be right up your alley."], ["COGconnected", "Critic", "78", "A quick thrill ride."], ["God is a Geek", "Critic", "75", "Velocibox is ridiculously challenging and painstaking, but the flip-side is that it's one of the most gratifying experiences you will ever have in a video game."], ["Worth Playing", "Critic", "65", "With randomly generated levels played at a breakneck speed, Velocibox is definitely for those who thrive on frustrating challenges. Few will have the patience to get through to the next stage without quitting in frustration, let alone fuss with online rankings."], ["Digitally Downloaded", "Critic", "60", "And no matter how much I enjoyed this game, which I did, it was hard to play, because the visuals are so jarring. As such Velocibox is not for the faint hearted, or epileptic."], ["Brash Games", "Critic", "50", "If you want to be frustrated for several hours then A Velocibox Ultimate Bundle is definitely worth your time, well at least a couple of hours of your time."], ["Push Square", "Critic", "50", "With a fairer difficulty curve this could have been a decent timewaster; instead, we'd recommend it to masochists only."], ["Hardcore Gamer", "Critic", "40", "Super Hexagon and still need your twitch fix, you might get some real enjoyment out of Velocibox‘s stiff challenge; anyone else can safely give this a pass."], ["Gaming Nexus", "Critic", "35", "By constantly running at breakneck speed, Velocibox takes a solid idea and turns it into one of the most aggravating games ever made."]], "platforms": ["PlayStation 4", "PC", "PlayStation 3", "PlayStation Vita"], "image_url": "http://static.metacritic.com/images/products/games/2/ad14003d56e7ed1b7098c0bdbb8c0cab.jpg"}
{"publisher": "FuturLab", "genres": ["Action", "General", "Shooter", "Scrolling", "Shoot-'Em-Up", "Vertical"], "rating": "E10+", "title": "Velocity 2X", "release_date": "Sep  2, 2014", "avg_score": "86", "summary": "Velocity 2X features puzzle-platforming action alongside top-down shoot-'em-up gameplay.", "reviews": [["Gamestyle", "Critic", "100", "Futurlab made a bold claim that Velocity 2X is the game of the year 2014… They are not wrong."], ["TheSixthAxis", "Critic", "100", "Velocity 2X delivers another dose of pitch perfect shoot ‘em up gameplay, but refuses the rest on the laurels of its predecessor. Taking Kai out of her Quarp Jet opens up whole other avenues for the gameplay that only gets better and better as you progress, with every other part of the game lavished with further polish and refinement."], ["Push Square", "Critic", "100", "Velocity 2X is everything that a game should be. Requiring skill and dedication, it’s been built for core gamers ready to challenge themselves; for people who desperately miss the likes of Contra and R-Type. Don’t be fooled, though, this isn’t a throwback or even a celebration – this is a modern game done right, and the new standard for which indies have to aim on PlayStation."], ["Softpedia", "Critic", "95", "Velocity 2X is a stellar 2D shooter that blends all sorts of different mechanics in a successful manner. Throw in the gorgeous visuals, the smooth framerate, and the imaginative design, and you have a winner. Sure, the controls take some getting used to and getting high scores requires dedication, but that doesn't weigh the game down all that much."], ["PSX-Sense.nl", "Critic", "95", "Futurlab doubles down and delivers a sequel that beats its predecessor in quality on every level. A must have."], ["Playstation Universe", "Critic", "95", "An action-packed shooter brimming with visual spectacle and solid replay value."], ["GameCritics", "Critic", "90", "In a game that encourages perfection to the nanosecond, having to occasionally stop to think about which button does what can occasionally cost time. It's a small issue and one that won't affect players unconcerned with high scores."], ["Level7.nu", "Critic", "90", "Velocity 2X is a lightning-fast, varied and extremely entertaining\r\ngame that seamlessly mixes different genres in creative ways. It’s a\r\nmust-own for the Playstation 4 as well as the PS Vita and hopefully a\r\nfuture speedrunning classic."], ["XGN", "Critic", "90", "Velocity 2X is absolutely worth playing. This game offers the lovely combination of platforming, space shooting and puzzling. There are a few flaws, but for the price that this game costs, we won’t even mention them."], ["Games Master UK", "Critic", "90", "An essential shooter and the perfect excuse to get your speed-run on. [Nov 2014, p.77]"], ["CalmDownTom", "Critic", "90", "All in all with the great graphic novel level intros and the nice little story and wit the protagonist displays, Veocity 2X is an engaging experience. I was glued to it till I was at level thirty six, then I realised I should really write something before I get to the end and spoil it for everyone here."], ["SpazioGames", "Critic", "90", "Velocity 2X is a small gem in the world of independent games. The title is fast-paced, intriguing and innovative. It perfectly blends many commands, creating an eye-catching end result that will keep you glued to the screen and will test your skills to the limit with goals and spurring online leaderboards, so as to satisfy even the most disengaged players."], ["Vandal", "Critic", "90", "This might not be the game you were waiting for on PS4, but it delivers loads of fun. It's better than its previous episode, and if you are a PS Plus subscriber, then it's a game you cannot miss."], ["GameSpot", "Critic", "90", "Velocity 2X is interactive poetry. All of its pieces, all of its movements, all of its systems and mechanics flow seamlessly into and out of one another to create a constant tone of movement and a feeling of endless flow."], ["ZTGD", "Critic", "90", "It still has that addicting game play, and it’s still a fast game that is easy to pick up and play. The new mechanics are interesting, and even when I found them a little daunting at times, I still had a blast with the overall game play."], ["Eurogamer Italy", "Critic", "90", "Another must-have for any PlayStation Vita owner and old-school shooter lovers. There are lots of new features and improvements from the previous episode, especially the PlayStation 4 version, which provides better graphics and special controls for the DualShock 4."], ["Polygon", "Critic", "90", "Velocity 2X could have taken the easy route, sticking with proven mechanics for a predictable sequel. Instead, it makes a big bet, adding on-foot gameplay to already-sharp ship gameplay and the entire game is so much stronger for it."], ["IGN", "Critic", "90", "Not only is it an outstanding Vita and PS4 game, but it’s the first game in a long time to give me the thrilling sense of mastery that a well-played level of Sonic the Hedgehog used to back in the 90s."], ["Hardcore Gamer", "Critic", "90", "Velocity 2X isn’t just one of the best games of the year, it might just be the best downloadable title exclusively available on the PlayStation 4."], ["Merlin'in Kazanı (Turkey)", "Critic", "89", "First thing about the Velocity 2X: It's a 2 in 1 game (Platform and arcade). I am impressed by excessive speed gameplay. Teleport and other stuffs are looking so cool. If you are a PS Plus subscriber, then it's a game that you cannot miss."], ["Multiplayer.it", "Critic", "88", "Velocity 2X is not just an improvement of the original formula, but it actually is a faster, thrilling and more interesting sequel that take great advantages from the new platform sections."], ["IGN Italia", "Critic", "88", "Two games in one and, more than that, an incredibly great sequel. This is the best possible Velocity... until the next one?"], ["Game Informer", "Critic", "88", "Futurlab’s stellar game is challenging and unusual, and its complex controls are demanding. For that reason, Velocity 2X may not fascinate novice gamers, but experienced players will delight at its varied gameplay, spare design aesthetic, and daring speed."], ["COGconnected", "Critic", "87", "I’d think you’re a bit crazy if you’re on PS+ and don’t get this game as part of your instant collection."], ["GamesBeat", "Critic", "87", "If you’re looking for a good game to play on the PlayStation 4 or the Vita, Velocity 2X is a fantastic choice, with its crisp, bright visuals and energetic soundtrack (I never got sick of it once). Just keep in mind that outer space can be an unfriendly place, and if you’re a sucker for story, you’ve got a lot of playing ahead of you if you want to finish all 50 levels."], ["Everyeye.it", "Critic", "85", "Technical, fast faced, compulsive: Velocity 2X expands the experience of the first chapter with an excellent platform twist."], ["3DJuegos", "Critic", "85", "Fun and very attractive new installment of one of the most unique games released for the Nintendo 3DS. Addictive and simple gameplay."], ["Meristation", "Critic", "85", "Fast, smooth, clever and furious, FuturLab delivers a great shoot'em up that is actually improved thanks to the platform sections on foot."], ["PlayStation LifeStyle", "Critic", "85", "They did a great job at smoothly connecting the gameplay parts of the game to the story parts so it doesn’t seem forced or unrealistic. Velocity 2X is a game that, once you play a bit, guides you into a sort of rhythm. Much like music games, it’s a very seductive effect."], ["Playstation Official Magazine Australia", "Critic", "80", "Slick looking and stupidly fast, Velocity 2X is a must-see genre convergence. [October 2014, p83]"], ["LevelUp", "Critic", "80", "Velocity 2X will appeal both, shoot 'em up enthusiasts looking for a challenge, but also newcomers who just want a bit of fun without frustration."], ["4Players.de", "Critic", "80", "Clever shooter-puzzle-mix with brain bending teleportation and interesting new platforming aspects."], ["Worth Playing", "Critic", "80", "Velocity 2X is a solid and well-made blend of shoot-'em-up and platforming action."], ["Eurogamer", "Critic", "80", "Despite the game's dipped-nose poise, its obsession with speed and clocks, it rewards those who take their time, who perfect their technique on each stage, and who savour an arcade game that's been lovingly embellished and expanded to its full and likely final potential."], ["God is a Geek", "Critic", "80", "The greatest triumph is in how the spacecraft gameplay and platforming sections feel similar in parts, while also retaining some individuality. It’s disappointing that a number of factors cause Velocity 2X to experience a little turbulence, because generally, it’s a great flight."], ["VideoGamer", "Critic", "80", "Yet another supremely playable title with oodles of replay value."], ["Gamer.no", "Critic", "70", "Velocity 2X might look and feel a bit simple, but beneath that lies a rather entertaining hybrid of a shoot-em-up and a 2D platformer. It works best in small doses rather than long play sessions, but manages to score a lot of points on charm, aesthetic and tight game design."], ["Metro GameCentral", "Critic", "70", "An impressive mix of game styles, and some of the most rewarding speed runs in recent memory, but that only increases the speed at which levels start to blur into each other."], ["stako", "User", "8", "I received the first Velocity on my Vita as part of my PS+ membership program and I didn't pay much attention to it. It looked like a cool space shooter with a gimick - nothing more, nothing less, so I didn't even play all of it.  When I heard that this month they were going to give us Velocity 2X free, I felt that I should go back and revisit the first game (to be able to competently compare the two, at least). When I took a closer look to Velocity Ultra, I found a very well thought out game with challenging gameplay and puzzles that is made with a lot of love. And with awesome minigames. I was on board and set for Velocity 2X and, with no surprise, I found a awesome upgrade to a very cool game."], ["disengaged", "User", "9", "This game is so fun!! Amazing sense of pace and great level design. Plus I got it for free through ps plus. Time to finish writing this review and go back to play some more... :)"], ["Associated", "User", "9", "Hands down my favorite sci-fi shooter game of the past few years! Extremely fast-paced, never a boring minute, and challenging too! The controls flow surprisingly well and the game itself just feels polished. Get PS+ and you get this game for free, so no reason to not at least try it!"], ["lincoln927", "User", "9", "I had a great time playing this game. I only wish it were longer. If there is ever an expansion pack with more levels I am definitely getting it. The controls are pretty easy to pick up and you can get through all the levels without too much difficulty given the infinite respawns. But if you want to take a shot at the leader board you better bring your A game. Getting a perfect badge on a level is very satisfying and I am working on them all. Really gives another layer of depth after you finish the campaign."], ["BaronMonaco", "User", "8", "I apologize for any mistakes, I'm french and my English is far from perfect."], ["themostunclean", "User", "10", "A well rounded, well designed shooter/platformer. It seamlessly integrates the mechanics in a way that encourages you to perfect your gameplay. The reviewer accusing the game if \"hand holding\" obviously hasn't played very far in to the game. It only explains things the first time you encounter a new mechanic. I don't know what they expect, it's pretty stupid not to expect a game to have some kind of tutorial. The art is great, the music is perfect and it's just an all around great game. Plus it's free if you have PS+. Anyone giving negative reviews just doesn't get good gaming."], ["RegularNick", "User", "8", "Good game. Game mechanic, level design - i liked it, but what i didn't like is that the game didn't allow me to start a new level (41 or 42) because i didn't get enough experience points on previous levels, and besides i did them not so bad, the first ones are even perfect completed but even this is not enough for this game. It seems like it wants you to complete every level's challenge with 3 stars, which i think is pretty hard and you must waste a lot of your time just to pass the same levels over and over again unless you get enough exp. points to start a new one. Why can't i just complete the game without all these difficulties. But i'll repeat - the gameplay is very good and fun. But these exp. points.. Ugh.."], ["loadstone007", "User", "10", "Exceptional indie game that every Vita owner should get."], ["oakleez", "User", "9", "No clue where hb1209 is coming from.  PS Plus is better than it has ever been.  Not sure what game selection has to do with Sony being \"broke\" or \"greedy\"... Seriously, who complains about a FREE game on day one?!  I would much prefer brand new indie games over old and stale major titles."], ["man_on_fire", "User", "10", "A treat for the hardcore gamer, maybe less so for the casuals. This is the kind of game you need to play in a certain way (in other words properly) to truly appreciate. Going for high scores makes you appreciate the game design / mechanics even more. Having said all that, the game is currently free on ps4 so the least you can do is try it and see for yourself. Nothing to lose...maybe a new favorite game to gain."], ["NauvooJoe", "User", "10", "Don't listen to the haters who have been dogging this game. It is an amazing blend of top-down shooter, side scrolling platformer and puzzle genres. I hadn't heard of this game at all until Sony put it up as a free download for Playstation Plus. I got it on my PS4 and my Vita and cannot stop playing it. It's an extremely addictive, slickly-designed game which I would highly recommend to anyone."], ["Murdocdelrey", "User", "9", "Great game, fun gameplay, exciting visuals, i just love the game's music, my favourite game music of the year alongside Hotline Miami, Highly recommended. :)"], ["allan_treebeard", "User", "8", "Fantastic, beautiful and satisfying. A really fun shooter with top down space shooting elements interspersed with dynamic platforming sections. The music is also really catchy, crossing old school arcade tunes with a more upbeat vibe."], ["Pureray", "User", "10", "This game has it's Great music, interesting story, levels, collectables, high replay value, and mechanics. The first few levels are slow to try understanding the mechanics, since afterwards things are going to get more intense, which feels so great getting through it at max speed, collecting, and destroying everything to get that perfect score. I'm not kidding, even if it sounds to good to be true. I just don't see anything broken or out of place with this game."], ["Platty20", "User", "5", "Extremely generic, even for the price of nothing this game managed to bore me after 15 minutes. Bland art style and repetitive gameplay. I'm baffled by the overwhelming praise this is getting from critics, if it wasn't an indie game I would be suspicious of cash handouts. Overall it isn't a terrible game but it isn't worthy of a near 90 metascore, completely forgettable."], ["IQ150", "User", "0", "Boring and repetitive. Non-challenging at least not in an interesting way. Meaningless story/interludes. I do like 2D platformers and shoot-em-ups, but this is just uninteresting. Got it for free with PS+, but will never play again."], ["SirTomato", "User", "5", "Okay, wouldn't buy otherwise without Playstation Plus, but for a free fun arcade shooter its average. I found level design is similar from what I've played so far as well."], ["minidelmacho", "User", "5", "Velocity suffers greatly form Hand-Holding syndrome. when you get a new ability, it tell you what it does, how to use it, and when to use it. To the point that the use of many abilities seems forced and not at all fun to use. There is almost no independent thinking. The game is constantly auto-pausing to tell you how to deal with a new obstacle instead of trying to let you figure it out. the saving graces are its clean art style, and great chill cyber wave music."], ["Dunge", "User", "6", "Nice free game, but not worth the score it currently have."], ["1234marcos", "User", "10", "This game,This game.Holy moly,this game's insanely good!It's challenging and highly replayable.The story was surprisingly good and the gameplay is smoth,top notch,not to mention gorgeous!"], ["Kastle", "User", "0", "This game looks and plays like it belongs on a Super Nintendo. From 1990. If I played this on my iphone, I might think it was ok. But how can anyone rate this game 9 or 10 as a PS4 next gen game???!!! Just Ridiculous!"], ["Phantasemo", "User", "5", "Velocity 2X a unique if rather unimpressive mixture of a top-down shooter with a 2D side-scroller. To be brief on the subject everything functions competently and the top-down portions from time to time gave a brief impression of Ikaruga with a minor dash of Galaga throw for added measure. The side-scrolling segments provide a semblance of Sonic as well. After that however the game boils down to a slew of levels that have a bad habit of melting into one another. As of this point I have played through 22 of the 50 on-hand missions available from the outset and the only response that I am able to muster is \"Meh\". There isn't particularly anything wrong with Velocity 2X it’s a game that is just lacking in ideas and creativity. Fact of the matter is that Velocity 2X runs out of ideas in the early levels and from there things just appear to be stuck on repeat for the remainder of the play time. It doesn't take to long for you to start feeling deja vu until that turns into monotony as it feels like your darting through a nearly identical gauntlet each and every time with only a cosmetic change to accompany the new levels."], ["vladdie93", "User", "5", "You know what? This game isn't necessarily bad. It's a functionally great game with a unique concept that you don't see as often nowadays, and really does have a good game mechanically."], ["VonSeux", "User", "2", "First you get the impression the tutorials will never end, then you fell you do not learn anything useful. The game is so simple it feels cheap even for free with PSN+. It's not a good shooter neither a good plataformer."], ["DigitalCaffeine", "User", "2", "Is this a big joke that everyone else is in on? Please read this to the end before judging my review."], ["Riskyreview", "User", "0", "Another side scrolling mobile game with a terrible story and boring gameplay."], ["TheDarkKnight22", "User", "7", "This game is very fun, the game mechanics feel great. My main issue is that the level design is too easy. The game is very fast paced but i would like it to have a higher difficulty from the beginning"], ["Pecheckler", "User", "8", "Simple addicting fun. It's like r-type and metroid had a baby 5 console generations later.  The game could have used a little more direct combat with quality AI though.  I was hoping for something on-par with einhander, but after 17 years it still hasn't happened."], ["Zegu", "User", "6", "This game was OK, but after a few hours I just couldn't get into it and was distracted by other things pretty easily. One pro is it seemed to be generally easy to beat a level, but much more difficult to 100% it, so for non completionists like myself I don't think it would eat up a ton of time to \"finish\" this game"], ["Atermi", "User", "2", "I honestly cannot understand a hype around this game."], ["ThiouZ", "User", "6", "Velocity 2X is pretty good with his two game modes. The music is good but the gameplay is too repetitive."], ["drlowdon", "User", "7", "A fast paced mix of top down shooter and side scrolling platformer Velocity 2x is an entertaining little title that you can play as a straight action game or spend time relentlessly chasing  high scores. As with many games of this ilk it is actually more fun on the early levels, seeing as they are shorter and more conducive to being played over and over in an attempt to improve your performance, but with concepts being added constantly throughout the 50 missions on offer it never outstays its welcome and is certainly a title I’ll be keeping on my hard drive."], ["cregor", "User", "7", "Best game that I have gotten from the PlayStation Plus subscription.  The mix of space shooter and sidescroller is truly unique.  While fun the game got repetitive and levels got long towards the end."], ["foxviewchannel", "User", "8", "Velocity 2X is a top down shoot em up and sci-fi plat-former that is a sequel that expands the experience from the first game, Velocity Ultra. The nice little story continues right from where the first game left off were main character lieutenant Kai Tena was left nearly dead.  She is captured along with her ship by an alien race called the Vokh for experimentation so they could figure out the technology behind her teleporting ship."], ["Dodozinho", "User", "5", "Fast but not fun!!! The game is super repetitive, with missions that are not enjoyable. I just do t know why critic reviews gave favoravle reviews on this."], ["Aironically", "User", "9", "A wonderful merger of 'speed-run' 2D vertical space-shooting and 2D horizontal platforming; complete with immersive, tempo-matching music. The combination of two different genres, tied together with an emphasis on racing through levels for more experience points, is just very enjoyable. Certainly a little repetitive, but the game does throw you new toys and add enemies every now and then to keep things fresh. For example, the last three or four missions involve controlling two in-sync ships side-by-side, which made for a different experience at a point in the game where usually everything has already been seen and done to death."], ["Nel", "User", "4", "The game is a shooter moving screen game, high score chasing deal. If you enjoy collecting things to move forward to the next level this might be something for you, otherwise the game controllers are fine, and the plot is fine, but the tedious collection system that makes you advance really kills it."]], "platforms": ["PlayStation 4", "PC", "PlayStation Vita", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/6/e4c3f93c1df6ab5fdbf092a4131c4ba8.jpg"}
{"publisher": "M2H", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "rating": "M", "title": "Verdun", "release_date": "Aug 30, 2016", "avg_score": "56", "summary": "Verdun is a squad based multiplayer first person shooter set in the first world war. Inspired by the infamous battle of Verdun in 1916 players are able to take part in never seen before WWI action. Made by 3 indie developers from BlackMill and M2H.", "reviews": [["Playstation Universe", "Critic", "85", "Much like The Great War itself, Verdun is rough, grim and wholly unforgiving. A perpetual lesson in patience and poise which decisively punishes fools but rewards frugal armchair tacticians, Verdun makes the player work in every way that a good shooter should. Emboldened by an impassioned take on one of history’s more overlooked conflicts, Verdun’s rough appearance is not enough to detract from one of the finest shooters on PS4."], ["XGN", "Critic", "80", "Verdun is not your average shooter, it focuses more on the realistic side of war and teamwork is a very important aspect of the game. Therefore it will most likely appeal to a different public than games like Call of Duty or Battlefield."], ["GameCritics", "Critic", "75", "While it’s far from the most attractive FPS I’ve played this year, Verdun gets its setting and tone incredibly right. There’s a moment in every match where I found myself peering out from behind cover, looking down my rifle, desperate to catch sign of any movement in a field of debris — a moment where the game completely justifies its setting and mechanics. Verdun is rough at times and only half of its modes are any good, but those special moments it offers are rare enough to deserve attention."], ["PSX-Sense.nl", "Critic", "75", "Slow and methodic, this clumsy shooter isn't for everyone. Those who persevere, however, will find a diamond in disguise."], ["Brash Games", "Critic", "70", "The game has a very different pacing to modern shooters and that’s not a bad thing."], ["Vandal", "Critic", "68", "Verdun has really good ideas, and it tries to achieve a realism most shooters discard these days, but a very poor technical side and some control issues prevent it from achieving something bigger."], ["COGconnected", "Critic", "60", "Verdun offers a unique experience not seen elsewhere on the PS4. It’s realistic, historically accurate and sometimes satisfying gameplay can’t make up for the fact that the game’s community is almost non-existent, gameplay is riddled with technical issues and the lack of a proper tutorial can make the game downright frustrating."], ["PlayStation Country", "Critic", "60", "Verdun captures all the action and misery of being stuck at the front in a war where the power shifts constantly and young lives are lost in a hopeless struggle.  Except now you're sat on a sofa.  While its more traditional modes show off its weaknesses, the main Frontlines mode seems to have captured an audience on PSN."], ["Digitally Downloaded", "Critic", "60", "Not only is the lack of tutorial and unfamiliar gameplay going to scare off casual FPS fans, but the nature of the game as a large scale multiplayer experience will mean there’s not much point in playing if you can’t get a proper 16vs16 match going. If you like the idea of a historically accurate, hardcore WWI FPS, Verdun is going to be right up your alley. I’m just not sure if the PS4 port will be the best way to experience it."], ["GameSpew", "Critic", "60", "It’s a refreshing change from the rest of the first-person shooters and goes to great lengths to ground itself in reality."], ["Games Master UK", "Critic", "58", "Verdun ignores modern FPS design for better and worse - it's distinctive, but hard to recommend. [Nov 2016, p.72]"], ["InsideGamer.nl", "Critic", "55", "Verdun is authentic, you are crawling in the trenches, waiting for the enemy to take a risk. Original? Yes, but it is not something that everyone will enjoy."], ["Playstation Official Magazine UK", "Critic", "50", "This sombre evocation of history can feel silly and contrived. [Nov 2016, p.88]"], ["God is a Geek", "Critic", "50", "A brave attempt at creating a more thoughtful shooter hindered by poor execution and messy technique."], ["PlayStation LifeStyle", "Critic", "45", "Nobody is playing this game because it’s a technical mess, and I can’t recommend it to anyone due to that. If you want to play Verdun, then pick it up on PC. Sadly, the PlayStation 4 version is an inferior version that launched dead on arrival."], ["We Got This Covered", "Critic", "40", "If Verdun had adopted a free-to-play model on consoles, I could see the beauty in its unrefined animations or crudely rendered environments. But with a superior PC version on the market, it’s best to forget this PS4 port even exists."], ["TheSixthAxis", "Critic", "40", "Verdun’s goal is an admirable one, to capture the feel of warfare on the Western Front, on occasions it manages to do that and be fun. The rest of the time, it’s an unintuitive slog. It might be a better game on PC, but on PlayStation 4, it’s almost certainly not going to be this year’s most fun or engaging WWI shooter."], ["Metro GameCentral", "Critic", "40", "Its goals are noble enough, but this low tech shooter takes its realism too seriously – as the drudgery and unfairness of trench warfare is made all too real."], ["Gamer.no", "Critic", "30", "While Verdun is a relatively intriguing experience on a computer, the same cannot be said of the newly released console version of the game. It is a downgrade in every was possible, be it visuals, audio, gameplay, or even the amount of players present. Verdun is an example of the worst console ports have to offer."], ["Duke_Nukem", "User", "6", "How I would have loved to love this game, a more realistic setting (of WW1) and a more realistic and gritty feeling of war in comparison with games like COD or Battlefield. One shot mostly kills you, which is very realistic but also very frustrating because shooting the enemy sometimes doesn't seem to connect, which is especially annoying if you shoot an enemy 4 times in the chest and then get smacked by him in the face with his gun and die... not so realistic afterall!"], ["ollyspazmoid", "User", "3", "bad port of a game which seemed promising from gameplay. The frame rate and hit detection is absolutely atrocious. Couple this with visuals worse than PS2, and you have Verdun, a let down. When it works, it can sometimes be fun to play. Unfortunately, more often than not, it is simply not fun an just frustrating"], ["TrueRevive", "User", "10", "Verdun, at launch recieved a variety of negative reviews, most relating to player base issues more than anything, there has been a well catered post launch support however, and we should expect to see a solid game by around May next year, will the game recieve the community it deserves? Perhaps but only time will tell."], ["electoblaze", "User", "8", "This game is definitely what they call \"an acquired taste\" but once you start liking that taste, you will get hooked for HOURS at a time. The strange part is that this game doesn't sound very interesting if I describe it to you like so: you spend most of the time on your stomach prone and slowly creep up to the next trenches while slowly firing rifle rounds at little dots in the distance. Doesn't sound very fun right? Actually, when you get the hang of it, the gameplay is so addicting! This is one of the few games I've played recently where I can play all day and not get tired of it. (Unlike the recent cod games or even battlefield games where I have to stop and take a break.) RULE #1: If you run and gun (like cod), you will get shot and die. Instead, focus on finding a \"power position\" and get a few long range kills from that spot. Then slowly move behind cover (a nearby sand hill for example\" and reposition. WAIT IT OUT. You're in no rush to run ahead (and die instantly.) This should be RULE #2: Play in order to minimize deaths rather than get a ton of kills. You're being suppressed by an LMG? Hide! Wait. Wait. WAIT. Then move to a new position to get more kills. RULE #3 (should have mentioned this earlier): You get kills by looking for a tiny bit of motion in the distance. At first, I played a match and couldn't see anything. Meanwhile, I was getting sniped from who knows where. There are 2 tricks: first, turn brightness up to max and raise your gamma to a comfortable level. Second, limit your movement to only as necessary and look for tiny dots running in the distance. Aim, hold breath, then fire a couple times. Reload. Reposition. Rinse and repeat."], ["pre_-cision-_", "User", "8", "Everything you know and love about multiplayer shooters needs to be forgotten as the rules of combat have changed. Verdun is a brutal WW1 experience that mirrors the horrors and pure lethality of war. Every second you are alive has and will continue to be a struggle. Simply shifting your position in the most miniscule way has the potential to kill you instantly. Shouldering your rifle and firing is easy. Having the ability to make it a deadly weapon is not. All around you are gamers whom are no longer random people playing the same game as you. They are now your lifeline to success and failure. One person can not carry you to victory anymore. There might be heroes in this battle but the war is only won with teamwork. That is Verdun, this game isn't anything that you have ever played. It might not be an experience for everyone but for those who are willing, this might be one of the best shooters you never knew you wanted. The only issues with the game are framerate related however the developer has promised swift fixes. The game also currently features a small community however finding a full game on the games featured and best mode is always possible. If you read this in the future, just reseach player population before a purchase to verify activity levels"], ["thedaarkbatty", "User", "10", "I love this game to death. The shooting is intense as crap and the gameplay is also very good plus a great story. Please buy it, it's worth it. I rate it a perfect score"], ["thoolihan", "User", "2", "This is the first game I've considered trying to pursue a refund for. It plays very stiff like a playstation 1 shooter. The controls and options are very un-intuitive. There is no indicator of who is an enemy. Apparently, I killed an enemy, and the only way I knew was when I viewed the scoreboard later. If there is a vote on your team, you are prompted to vote in huge text that covers a third of your screen. There's a squad concept, and you are prompted to stay with your NCO (lead officer), but no indications of what that is doing for you. The \"tutorial\" is 7 sentences. Save your money, this is a developer still learning to make games."], ["disobedientlib", "User", "1", "Having been listening to Dan Carlin's riveting Hardcore History podcasts about WWI I was excited to play this game and perhaps get a tiny sense of the chaos and horror of trench warfare. However, this game is a complete let down. Movement is stiff and slow. When you get shot or shoot someone else it barely registers and you either go down or take a wound soundlessly. Environments and maps are something out of a (bad) 1998 game, and the sound design is terrible. The UI is also useless. Avoid this unless they give it out for free!"], ["msg78", "User", "2", "Seriously, this game is f***ing garbage. A game should be fun, and this is so not fun it's totally not funny."], ["Lewis-Angelo", "User", "6", "buen juego basado en la primera guerra mundial"], ["GamingDrake", "User", "8", "Verdun is unique in almost every way, from the slower pace shooting to looking through gas masks through the chlorine, from the artillery fire to reloading weapons which is the slowest i've seen (but in a good way) in a game period, the maps, weapons and nationality's all feel authentic, beats Battlefield 1 by a long shot. As great as Verdun is, it does have its short comings."], ["TAPR", "User", "8", "Is a good WWI game, so realistic but in Ps4 the serves is empty. Buy it only in a promo ."], ["Aragonense", "User", "9", "Bad port for ps4, great game and awesome historical set, being one of the best shorter simulators on the market, but can't enjoy it as it is right now, the frame rate is more than terrible making it impossible to be played"]], "platforms": ["PlayStation 4", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/7/135ee1c4da68873544ac08fa46bdff3f.jpg"}
{"publisher": "Digerati Distribution", "genres": ["Role-Playing", "Action RPG"], "rating": "E10+", "title": "Vertical Drop Heroes HD", "release_date": "Feb 14, 2017", "avg_score": "63", "summary": "Vertical Drop Heroes is a procedural platformer RPG hybrid with roguelike elements, where your hero adventures through randomly generated stages. Armed with a variety of skills and traits, you must use your cunning and reflexes to survive the dangers of each stage, until you face the final boss and uncover the truth behind the game!", "reviews": [["PlayStation Country", "Critic", "80", "There is an awful lot going right in Vertical Drop Heroes HD. As a roguelike, it works really well and the gameplay loop is both rewarding and enjoyable. Vertical Drop Heroes HD is a game which is easy to recommend."], ["Video Chums", "Critic", "63", "Vertical Drop Heroes HD is a somewhat addictive yet short-lived roguelike adventure. If it wasn't for its awful AI and glitches then it would be a wholly worthwhile experience. Instead, you'll be better off just playing Rogue Legacy again."], ["TheSixthAxis", "Critic", "60", "Ultimately, Vertical Drop Heroes HD is fun for a few hours, but gets repetitive quickly. The asking price is low so it might be worth a look if it really tickles your fancy, but Rogue Legacy is only £4 more expensive and accomplishes similar ideas more effectively and with more depth."], ["The Digital Fix", "Critic", "50", "Vertical Drop Heroes is a remake of a browser-based game from the turn of the decade. It does procedural and roguelike in a quick and fun way but ultimately is only for fans of this genre. What it does it does well, but that is limited."], ["madin", "User", "10", "BOTTOM LINE: a FUN game.  roguelike 2d vertical scroller.  *great* soundtrack, fun gameplay.  procedural levels and all the varied powerups, weapons, and abilities make each run different. addictive.  seriously underrated."]], "platforms": ["PlayStation 4", "PC", "PlayStation Vita", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/7/8ac8757564db9f9dbf06fd124956b2e2.jpg"}
{"publisher": "FinalBoss Games", "genres": ["Action Adventure", "General"], "rating": "E", "title": "VESTA", "release_date": "Jan 19, 2018", "avg_score": "68", "summary": "Vesta is a witty 6-year-old girl who lives in a desolate underground maze — the ruins of a once-bright city inhabited by humans and perfect machines. Although this world can be lonely, she is kept company by her friend BOT. It advises her and encourages her to do the tasks she is assigned, although it knows much more than it lets on.", "reviews": [["COGconnected", "Critic", "70", "Taken as a whole, Vesta is a pleasant enough experience but it’s an experience that has been done so many times, and so much better, in many other games."], ["TheSixthAxis", "Critic", "70", "Vesta was an absolutely delightful way to start off my gaming year. It’s hardly ground-breaking stuff but this is a solid, dependable and, most importantly, fun game. It’s all over rather quickly, but it’s a credit to the developers that this left me wanting more."], ["Vandal", "Critic", "70", "Quotation forthcoming."], ["IGN Spain", "Critic", "68", "An entertaining -yet technically old- puzzler that does a lot of things right, but it's far from perfect."], ["Meristation", "Critic", "66", "Vesta is a puzzle and an arcade game that stands out, among others, for its graphical design and humor. Although the gameplay is not brilliant and lacks a cooperative mode for two players, it deserves to be played."], ["Video Chums", "Critic", "66", "Although it's far from perfect, if you're in the market for a cleverly designed character-swapping puzzler and have the patience to continually play through long stretches again and again then Vesta is sure to find a welcome home in your collection."]], "platforms": ["PlayStation 4", "PC", "Switch", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/4/6f9edcae1db7bb65e8720e2b36299146.jpg"}
{"publisher": "Truant Pixel", "genres": ["Action Adventure", "General"], "rating": "E", "title": "VEV: Viva Ex Vivo", "release_date": "May 17, 2016", "avg_score": "50", "summary": "Viva Ex Vivo is a game by Truant Pixel which features a unique mix of non-traditional arcade, simulation, and survival gameplay intended for all audiences. Players assume control of the \"Virtual Eukaryote Visualizer,\" or VEV: a remote-controlled nanoscale artificial organism capable of surviving in a multitude of familiar and foreign microscopic environments.", "reviews": [["PSX-Sense.nl", "Critic", "60", "VEV's low price tag is a plus, as is the unique concept behind the game. You should keep in mind though that VEV also offers extremely repetitive gameplay and controls that don't always work the way they should."], ["PlayStation Country", "Critic", "60", "Viva Ex Vivo is back. It was always waiting for PlayStation VR and now it feels like an essential purchase if you’ve got some spare change in your PSN account. It’s still a shallow, and occasionally obtuse, game but now it’s a good one."], ["GameSpew", "Critic", "50", "All in all, VEV: Viva Ex Vivo is quite a conflicted game. It gives the impression that it wants to be quite a laid back, almost zen-like experience, yet it’s frustratingly challenging. It’s also as clear as mud when it comes to explaining itself, revelling in throwing science jargon at you to the point where it overcomplicates matters; it’s essentially quite a simple survival game."], ["Brash Games", "Critic", "50", "VEV: Viva Ex Vivo is an interesting experience. In a lot of ways it’s different from anything I’ve experienced in recent gaming history. It’s also very interesting and at least somewhat educational. But it needs tuning. Someone really needs to just sit down and give it a triple-A comb over. It doesn’t need more levels or plot or anything like that. They just need to add in some goals so that you aren’t just floating around for no reason 30 minutes at a time."], ["PlayStation LifeStyle", "Critic", "30", "I absolutely adore VEV: Viva Ex Vivo‘s concept, which only serves to make me more disappointed in the final release. Exploring these different microscope slides should be exciting, but instead players are left frustrated due to awkward controls and bored by how little there is to do."], ["Narmy", "User", "3", "I thought I'd give this a go as I liked the look of the blood cells in the trailer and thought the environment and gameplay could be interesting. Unfortunately this is one of the most repetitive games I've played in years. Floating around collecting small particles is ok for 5 minutes, but VEV uses the exact same gameplay mechanic for the entire game with essentially zero change. I somewhat enjoyed the first 5 minutes, I endured the following 55 minutes, I regretted purchasing it for all the minutes since."], ["SamReynolds", "User", "8", "V.e.v. is a great experience for the price. It's a little obtuse at first because It drops you right into the thick of things and makes you figure it out on your own. This is probably the biggest criticism you can level at a game like this. The barrier to understanding things is a little high, but once things click ithe experience is incredibly rewarding. Levels are either survival or exploration, and while the game has those levels labeled clearly I think having the difficulty levels as part of the description would help orient newer players. That being said, if you can get past those issues, this game is more than worth your time and money. The graphics are among the best for PSVR, the music is reactive to the situation and is actually catchy, and it is one of the few games that enables full freedom of movement in 3D space. You start out slow, and you absolutely have to kick up your turning speed to survive in later levels, but when you do it turns into what amounts to a dogfight with other bacteria. Getting anywhere with the food collection / score building aspect relies on actually saving up your food before converting it to energy, which introduces a nice risk-reward element that can really build the tension in the survival stages. All in all, for the price, this is a must have if you have PSVR, and anyone looking for something a little off the beaten path."]], "platforms": ["PlayStation 4"], "image_url": "http://static.metacritic.com/images/products/games/1/78904b3ce9bbeb0f58104d2e3a54506a.jpg"}
{"publisher": "Wired Productions", "genres": ["Role-Playing", "Action RPG"], "rating": "M", "title": "Victor Vran: Overkill Edition", "release_date": "May 30, 2017", "avg_score": "76", "summary": "Become Victor, hunter of demons. Forge your own hero on a quest to liberate the cursed city of Zagoravia. Explore ‘Motörhead: Through the Ages’ - a wild tour through the mythos of the loudest band in the world, and enter the Fractured Worlds, a dimension formed from the fragments of broken realms.", "reviews": [["Playstation Universe", "Critic", "85", "One of the most polished dungeon crawlers in years, Victor Vran is an easy recommendation to anyone with even the slightest fondness for the genre."], ["Video Chums", "Critic", "82", "Victor Vran: Overkill Edition is chock full of action RPG goodness that'll delight any genre fan for dozens of hours. Its core gameplay may get a little repetitive but what's here amounts to a surprisingly varied and enjoyable collection of content."], ["DarkStation", "Critic", "80", "If you add in the Motorhead or Fractured Worlds expansions, and the ability to play all of the content alone or co-op and in any sequence, Victor Vran: Overkill Edition is an extremely generous package that will take dozens of entertaining hours to complete. With each mission having multiple objectives, there are plenty of reasons to revisit areas several times. Not everything about Victor Vran is new and different, of course, but its solid mechanics and strong personality go a long way towards creating a satisfying play experience."], ["PSX-Sense.nl", "Critic", "80", "We've seen better stories come to live virtually, but Victor Vran makes up for this flaw with enjoyable gameplay, that pretty much guarantees a good time, especially when you've got a friend to play the game with."], ["The Digital Fix", "Critic", "80", "Victor Vran is an excellent port of a solid Diablo clone combining solid 60fps (ish) dungeon crawling with some heavily action-oriented demon-slaying gameplay."], ["COGconnected", "Critic", "80", "A slept-on gem that needs some attention."], ["PlayStation Country", "Critic", "80", "There is a lot of game in Victor Vran: Overkill Edition and it is a great overall package. As a fun action-RPG, this really shines in multiplayer but is also able to offer a decent single player experience thanks to an engaging loot cycle and customisable combat options."], ["God is a Geek", "Critic", "80", "Taking its inspiration from some of the best dungeon crawlers out there, Victor Vran is an immensely fun action-RPG that will keep you playing for hours and hours."], ["SpazioGames", "Critic", "75", "More action than RPG, Victor Vran arrives on consoles with a rich Overkill Edition, containing both DLCs and the known humour: if this will be enough or not depends solely on if you already had a chance to play it on PC. Otherwise, we're talking about a solid alternative to Dablo III and the likes."], ["CGMagazine", "Critic", "75", "Despite its obvious presentation issues, Victor Vran: Overkill Edition is good fun."], ["PlayStation LifeStyle", "Critic", "75", "The game’s combination of gameplay mechanics set it apart and its execution, while simpler in some aspects than its constituents, is excellently accomplished, making it one of the more polished games in the genre."], ["Playstation Official Magazine UK", "Critic", "70", "An intense, brutal and gorgeous ARPG. If you've got withdrawal symptoms from Diablo 3, look no further. [Aug 2017, p.96]"], ["VideoGamer", "Critic", "70", "The high-energy fun of Victor Vran means it really is a romp, if one that occasionally stutters. While the slightly repetitive nature grates, you can easily see a few hours dissolving into Victor Vran before your very eyes. Like a vampire in sunlight."], ["Push Square", "Critic", "70", "Victor Vran: Overkill Edition doesn't revolutionise the action RPG genre, but it certainly has helped it evolve. The scrapping of class systems and skill trees gives you more control over the character that you want to make, while the hordes of collectable loot will keep you chopping and changing your loadout for a long time. While its story is a little stale and there is still something very conventional about how Haemimont Games' latest is set out, the variety of gameplay and four-player co-op will keep you coming back to Zagoravia for hours."], ["Wccftech", "Critic", "65", "While I can't flaunt the game for anything bar a broken inventory system, I struggle to find anything outstanding to say about it as well."], ["fandangouk", "User", "5", "It starts well, and you think it will be a good substitute for Diablo 3. But the ratio of \"I really enjoyed that\" to \"I turned it off because it got tedious\" is not good. Fights are long drawn out non-strategic bullet-sponge affairs, usually ending with some ridiculous insta-death fight that requires shuffling different weapons until one works. Tedious in the extreme and not a patch on Diablo."]], "platforms": ["PlayStation 4", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/9/2e8620a31d9794080c269525e7ee5562.jpg"}
{"publisher": "Iron Galaxy Studios", "genres": ["Sports", "General"], "rating": "E", "title": "VIDEOBALL", "release_date": "Jul 12, 2016", "avg_score": "77", "summary": "VIDEOBALL is an abstract minimalist electronic sport. It is casual in that it uses only one stick and one button and you can play it while hanging out with your friends who do not normally play games. It is hardcore in that if you are good at it you and your opponents will scream and you will scream too, because your opponents are screaming.", "reviews": [["PSNStores", "Critic", "100", "As long as the servers hold up and there isn’t lag during netplay, it should wind up being one of the top PSN titles of all time."], ["Push Square", "Critic", "80", "Videoball is a classy and low cost game that is manic fun in multiplayer and an okay grind in single player arcade mode. Don't let the simplistic looks put you off – have some balls and fire this up at your earliest convenience."], ["GameSpot", "Critic", "80", "With its distinctively clean retro stylings and deceptively simple set up, Videoball may blindside you with the pace and depth of its gameplay. It's reminiscent of arcade classics, and is easily one of the best multiplayer experiences of the year."], ["Gamer.nl", "Critic", "75", "Tactical, very multi-faceted, tight: the clinical style of Videoball could make you think this is some complex game, but it is actually a fantastic version of air hockey. Too bad the matchmaking does not work and there are limited users online for the game to actually take off."], ["Game Informer", "Critic", "68", "As an inclusive party game that only takes a few moments to get fun even for inexperienced players, Videoball succeeds. But for the lone player looking to partake in a different kind of esport, options are limited."], ["Marcopodomus", "User", "6", "Super fun to sit around the TV and play with friends..."], ["FriedConsole", "User", "6", "I don't understand the appeal of this game. Matches are just tedious affairs without much strategy. The screen is filled with unnecessary things that makes it hard to tell what is going on. I could never find enough people to play online to get a match going. Wanted to like it but I just cannot."]], "platforms": ["PlayStation 4", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/6/127bed87dc6ac2b3f94289f1d0dd011a.jpg"}
{"publisher": "Slick Entertainment Inc.", "genres": ["Action", "Beat-'Em-Up", "2D"], "rating": "E10+", "title": "Viking Squad", "release_date": "Oct  4, 2016", "avg_score": "69", "summary": "Grab your trusty sword, strap on a fearsome helmet, and plunge into the chaotic fray of Viking Squad! As a member of this ragtag group you must put a stop to the wildly mischievous Loki and reopen the gates to Valhalla. Work together to unleash massive attacks on foes and expand your arsenal in this three player co-op brawler.", "reviews": [["CD-Action", "Critic", "80", "A very enjoyable game that brings back fond memories of Golden Axe and looks absolutely gorgeous. [13/2016, p.71]"], ["SpazioGames", "Critic", "70", "Viking Squad is a good beat-em-up. It delivers a genuine fun experience with the rail map construction, which is a brilliant and weird idea."], ["Push Square", "Critic", "70", "Viking Squad isn't the most creative or exciting beat-'em-up on the market, but it's easily one of the most consistent. Packing a colourful campaign across a series of varied stages - complete with alternate routes that add a lot of replay value - this is a well made arcade brawler that's especially fun with friends."], ["GameCritics", "Critic", "55", "Viking Squad is one of those games with occasional highlights — pecking enemies to death with an ostrich does have its moments after all — and a slick exterior that’s undercut by not quite getting the basics right. In this case, a diverse and interesting combat system would have gone a long way towards making this voyage way more worthwhile to embark on."]], "platforms": ["PlayStation 4", "PC"], "image_url": "http://static.metacritic.com/images/products/games/7/e8831008bbf40c95067236bd36346206.jpg"}
{"publisher": "Kalypso", "genres": ["Role-Playing", "Action RPG"], "rating": "M", "title": "Vikings: Wolves of Midgard", "release_date": "Mar 28, 2017", "avg_score": "67", "summary": "Fear the wolves. They are cold, they are hungry - and they will stop at nothing to survive", "reviews": [["XGN", "Critic", "80", "In terms of story and mythology this game is not that exciting. On the other hand, it feels great to overpower big trolls and fat bosses. Vikings Wolves of Midgard is a great game for everyone who wants something other than Diablo."], ["PlayStation Country", "Critic", "80", "Vikings: Wolves of Midgard is a very competent entry to action RPG genre with few caveats. Peppered among the well detailed Norse mythology inspired locales are occasional performance issues and a formulaic story. While notable, these do not detract from a fun and satisfying hack and slash experience. It must be hard to challenge a king of the genre like Diablo, but Vikings: Wolves of Midgard is a brilliant alternative to the Blizzard giant."], ["COGconnected", "Critic", "80", "It didn’t take long for Vikings to bludgeon those expectations into a meaty, undulating pulp."], ["Hardcore Gamer", "Critic", "80", "Vikings – Wolves of Midgard takes the formula made popular by the game named after the Spanish word for devil and makes it its own. I wouldn’t go as a far to say this is a Diablo killer, but this is one of the more impressive titles that follows that game’s template. The looting, crafting and killing formula is one that has been done many times over and it is no less addictive in this title. This interpretation of Ragnarok and Norse mythology creates an interesting campaign setting that’s not often used in games, and the visual and sound design make this an engrossing title once the player gets past the tutorials. For fans of action RPGs, Vikings – Wolves of Midgard is a must play."], ["IGN Spain", "Critic", "80", "A remarkable title."], ["Meristation", "Critic", "75", "The fun gameplay makes it up for the not so inspired graphic and sound design. The game lacks the deep customisation and character evolution typical of this genre but offers gratifying hackn' slash combat instead."], ["Playstation Universe", "Critic", "75", "Shortcomings aside, hack and slash fiends who are looking for their next fix should definitely check out Vikings: Wolves of Midgard, a genre effort which more than earns its passage into Valhalla."], ["CGMagazine", "Critic", "75", "While a little unpolished, Vikings – Wolves of Midgard is over-the-top fun."], ["Digitally Downloaded", "Critic", "60", "There’s a lot to like in Vikings, even if the game’s never able to effectively articulate how it’s different to the genre’s greats. It manages - just - to be more than a by-the-numbers Diablo clone thanks to the creative energy that went into its bosses and environment design, but it relies too heavily on that, and the assumption that you’ll be playing the game in multiplayer. As a single player experience, the limits on what Vikings can offer become distracting; making it good for a lazy afternoon of grinding fun, but not something that you’ll remember over the longer term."], ["Vandal", "Critic", "60", "This title has some good ideas, but it doesn't really shine when executing any of them. It can be a good option if you love the genre, but there are better alternatives out there."], ["RPGamer", "Critic", "50", "Vikings: Wolves of Midgard manages to provide some fun for those who know what they're getting into. Simple yet serviceable combat and a competent graphical presentation make for a game that is as easy to handle as it is to look at. Its multitude of extraneous features, however, fail to add much engaging and compelling to the mix; resource management and town-building, multiple skill trees, repeatable hunt maps, and a rage combat ability can all safely be ignored. Though it has a lengthy campaign and relatively low challenge, it never really manages to rise past the basic thrill of its combat, and will disappoint those looking for a deep, satisfying story or anything beyond the hack-and-slash loot-a-thon it is."], ["GameOver.gr", "Critic", "50", "Too many technical flaws, bad design decisions and a price tag unsuitable for a game of this kind left as quite disappointed with Vikings: Wolves of Midgard."], ["Push Square", "Critic", "50", "Vikings - Wolves of Midgard takes a fair swing at the loot-heavy action RPG genre, but its middling gameplay fails to leave a lasting impression. Going up against the likes of the mighty Diablo III on PS4, its dull blade bounces off the competition, but Vikings is just competent enough to survive the scuffle and live another day."], ["The Digital Fix", "Critic", "40", "A distinctly below average hack-and-slash game with better examples of the genre already out there."], ["SuperkenGaming", "User", "7", "Vikings: Wolves of Midgard"], ["kwstas", "User", "10", "this game need more acceptance from the players because it is actually really good and its really deserve it . it is similar to diablo 3 is not better but it has some differences that make it more unique the people who have played diablo 3 and enjoyed probably are not gonna love this better but i promise that you will be amazed . it is not like anything on the market the game is really greatly made , really fabulous designed it is fun it is beautiful the graphics are amazing , the story is about the vikings and the famous gods odin thor and loki , it is  fresh it is a new brand , i am really sad cz people dont know about it because it is marvelous ! and mister who give zero you better not try to fool them cz if you can see anything but gorgeousness in this game that means you are defenetely not even a gamer and you dont have any taste so go make some comments on instagram better  !"], ["kanivalos1981", "User", "9", "People who like action rpg diablo-like games , should just go and buy this game.Gfx ,sound ,music, menu,everything looks good.Based on the North mythology and the Vikings era ..the game reminds of diablo but surely is something different.Good job."], ["Stenbocken", "User", "10", "Excellent game, sure its a Diablo clone but they have really succeeded making it feel special. Good Graphics, good music and most important very funny to play."], ["prum777", "User", "8", "This is a very good game, of course not comparable with Diablo 3. Graphics and sound are great. The most impressive is the critical hit scene. I think it deserves the price."], ["hausnes", "User", "9", "I enjoyed the game. Somre new mechanics, but in general an ARPG with the usual pros and cons. The multiplayer option is great. Not perfect, but great."], ["metac42", "User", "0", "Don't let them fool you. This is one of the worst games i've ever played."], ["kris2fur", "User", "1", "No one really speaks about the technical faults of this game a ten? are you kidding?"], ["aspentitan", "User", "3", "Yes a 3/10 from me. So I buy this game second hand and am pumped. It looks fun and awesome. Play the first level and get to the boss. Have a hard time and can't beat the boss. Go online and see that's a common problem....now I see the game is on update 1.07 so I install it. Go back to game and the graphics have changed and the game is different in speed and programming. It's noticeable so I'm glad I'm now facing a more well balanced adjusted boss. Except now it's a game breaking bug the boss now takes zero damage. What is wrong with developers these days. 7 updates and the game isn't fixed. Guess what? This studio ain't getting a second chance....I'll be avoiding their games. Completely unacceptable."], ["SensualSanta", "User", "7", "A solid action RPG that's not trying to reinvent the wheel. The action is enjoyable, graphics are decent for the genre and the Viking setting and mythos is a fresh take. The full price is a bit steep for this title as there isn't an actual endgame as of yet but it is something the DEVs are looking into. I've enjoyed my ride and I'm holding on to the game in the hopes there will be added content in the future."], ["destinyfan1", "User", "7", "As a diablo fan I can say the game is great, not amazing, just great. The game has very great graphics even better then diablo 3 which are also great. Together with the viking feeling it feels already a unique rpg . The story is also pretty good but i've seen better in rpg's like diablo . The combat is great only the enemies feel to weak , but bosses are okay. Everything else is also great except skill tree is far worse then path of exile"], ["I_StillAlive_", "User", "6", "Well, I expected much more from this game! The viking mythology can´t save the whole game ... Its not a total failure, but it will not even amaze you... And it´s not so challenging to defeat your opponents.... Its like a loop, nothing will surprise you ... But because I was missing something like Diablo III, I enjoyed it somehow.... Rating 6/10 is fair I think."]], "platforms": ["PlayStation 4", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/0/12029b48bbdd54468bd9e0d77f27971f.jpg"}
{"publisher": "505 Games", "genres": ["Adventure", "3D", "First-Person"], "rating": "M", "title": "Virginia", "release_date": "Sep 22, 2016", "avg_score": "77", "summary": "Virginia is a single-player first-person thriller set in a small town with a secret. Experience a missing person’s investigation through the eyes of graduate FBI agent Anne Tarver.", "reviews": [["RPG Fan", "Critic", "93", "Virginia is an intensely intimate, powerful and thought-provoking experience masquerading as an homage to supernatural detective thrillers, and it is one of the most important games of 2016."], ["Game Informer", "Critic", "93", "Virginia is a taut thriller that strikes a fine balance between storytelling and interactivity in a way that narrative-driven first-person adventure games have not accomplished since their inception, thanks to its blend of classic cinema and exploration. It should not be missed."], ["Digitally Downloaded", "Critic", "90", "That little technical niggle aside, Virginia is a fantastic piece of interactive fiction, and a fantastic videogame. It’s rare to see a game that truly innovates on the way a story can be told through this medium, and to have something that doesn’t only push those boundaries but does so this effectively is a real treat."], ["GameGrin", "Critic", "90", "Virginia takes you on an unforgettable, incomprehensible journey."], ["Hobby Consolas", "Critic", "90", "An original and personal interactive adventure that breaks with some schemes established in videogames. Virginia is an artistic exercise and a game to be tested, even for curiosity."], ["Everyeye.it", "Critic", "90", "What an incredible year: after Inside, here's another software taht will influence and change the way we'll experience a story.  Virginia is not a good game. Neither a good movie. It is something different: something new."], ["Playstation Universe", "Critic", "90", "Virginia takes the adventure game to new places, and while not everyone might want to join in on the trip, those that do will be rewarded with a thoroughly mesmerising experience that stays with you long after the credits roll."], ["Digital Chumps", "Critic", "84", "A perfect enigma is a perpetual struggle between tenable doubt and informed speculation. This is difficult to produce in any creative medium, let alone one that relies on personal interaction. Videogames almost never attempt to do this. Virginia does. The fallout could have been an obtuse curiosity, but it succeeds in throttling tension through subdued parlance, laying out a series of clues and challenging the player to organize them into a cogent (and personalized) picture of the story."], ["IGN Sweden", "Critic", "82", "Virginia is a wonderful, cinematic, experience that leaves a strong impression on the player. I'm looking forward to see more games from this developer in the future."], ["Let's Play Video Games", "Critic", "80", "It was only during my subsequent playthroughs that I was able to catch the game’s quiet understatement, and I’m so frustrated that I missed these the first time around. This is a game to be savored and treasured, but its blunt delivery and liberal use of codes and symbols only serve to sacrifice clarity."], ["Playstation Official Magazine Australia", "Critic", "80", "All combined, it’s enough to elevate Virginia above PS4’s typical story-led fare, divisive bow-out and all. [December 2016, p74]"], ["Playstation Official Magazine UK", "Critic", "80", "A small but mesmerising Firewalk-esque tale inspired by Twin Peaks and The Outer Limits. Just beware: unpicking the ending is a case for Mulder and Scully. [Nov 2016, p.86]"], ["We Got This Covered", "Critic", "80", "Virginia achieves a level of complex and thrilling storytelling that is difficult to achieve without any words."], ["IBTimes UK", "Critic", "80", "Virginia is astounding in many ways. The way it conveys its meaning through visuals, character tics, a few hundred written words and one incredible score without uttering a single line of dialogue is remarkable. Confident and measured use of editing lends a sense of style, but Variable State's swagger turns to over-confidence in the final stretch and leaves Virginia on a befuddling rather than satisfying note."], ["IGN Spain", "Critic", "80", "Virginia is an experience able to catch the player's attention thanks to its thriller style and its narrative resources. A good videogame with an outstanding OST recorded by the Prage Philarmonic Orchestra. One of the best indie projects of its genre."], ["IGN Italia", "Critic", "80", "Virginia is an experimental title that blends cinema and videogame in an unique mixture. The story is rich in mystery and requires a lot of ability in reading between the lines but the experience is worth the challenge."], ["COGconnected", "Critic", "80", "Virginia is a quality game that isn’t afraid to be itself. While its basic mechanics and emphasis on story over gameplay won’t be for everyone, it’s a unique ride that mature and intelligent gamers should take, especially if they happen to be a fan of The X-Files or Twin Peaks. This is something different, and it deserves to be applauded for that."], ["Eurogamer Italy", "Critic", "80", "Movies and videogames merge in an extremely interesting title which uses the lack of dialogue as a storytelling key point. Virginia is a story that pays a tribute to (and is inspired by) masterpieces like True Detective, The X-Files and Twin Peaks and manages to hold up in front of these great stories."], ["TheSixthAxis", "Critic", "80", "Virginia’s tale of intrigue and mystery quickly comes full circle. In that time, it will take you to some pretty surprising, extraordinary places, and easily warrants a second playthrough. The closing moments may not be to everyone’s taste, though the journey to get there is certainly worthwhile."], ["LaPS4", "Critic", "75", "Variable State's first game is an experiment in the storytelling field, using the cinematographic language as its plot axis. For most players it will be hard to swallow, although it rewards those daring to enter its depths, resembling successful shows like Twin Peaks. Perhaps the dream sequences are the least interesting part of the game, although it is a breath of fresh air."], ["Stevivor", "Critic", "75", "It’s a good thing that Virginia is such a neatly-packed experience, because I definitely needed to run through it twice to get a firmer grip on the story being told."], ["Vandal", "Critic", "70", "Virginia wants to tell a story, and that's what it does. It's not an unforgettable one, but if you're happy with it, it's not a bad option."], ["GameCritics", "Critic", "70", "Virginia is an excellent example of what can be done with the medium – the director’s hand is felt, the approach is unusual and the subject is intriguing. However, “Ambiguous Story” is becoming a widespread disease in videogames, and it’s hitting the indie scene are particularly hard. While occasionally appropriate, it’s a perilous shortcut that leads too many narratives astray, and this game is a victim. I recommend Virginia to examine how it moves a player through its story, but I can’t sign off on the story itself."], ["Slant Magazine", "Critic", "70", "Without a single word of dialogue, Virginia still manages to clearly convey complex feelings of friendship, isolation, and betrayal, but leaves it to the player to decipher how much to read into all the symbolism."], ["Metro GameCentral", "Critic", "70", "Some may dismiss it as just another pretentious walking sim, but this innovative Lynchian drama is one of the best story-based games of the year."], ["PSNStores", "Critic", "40", "It’s clear that Virginia is supposed to be mysterious, the absence of any dialog helps to keep things firmly planted in the unexplainable, but when there’s no payoff to any of the build up – it all starts to feel a bit meaningless."], ["Push Square", "Critic", "40", "An absolutely incredible soundtrack and great environmental art fail to lift the game from a bog of issues. There are some severe technical issues here, but real criticism should be pointed in the direction of the oftentimes incomprehensible narrative, which needed to be much stronger given the general lack of interactivity elsewhere."], ["Kill Screen", "Critic", "30", "Lord knows videogame characters could stand to be quieter, but Virginia can’t convey the necessary emotional depth to make its story stick. The ideas at play piqued my interest pre-release: two women of color as its leads, the promise of a new spin on enduring cop show tropes, surrealist touches. But Virginia is selling points all over, a mood board of ideas—some cool, some musty—that take the player’s interest as self-evident. Anyone who’s seen a movie before should probably just watch another."], ["Spidor", "User", "2", "I knew what I was in for when I got it - a plot driven interactive experience, or rather a walking simulator like the haters call them. I like walking simulators; I enjoyed Firewatch, Everyone's Gone to the Rapture, Gone Home, and SOMA, which is essentially a walking simulator with a couple of scary hide-and-seek bits interspersed, is one of my favorite games of all times.  No, that's not the problem with this game."], ["SuperkenGaming", "User", "6", "Virginia"], ["rdekoch", "User", "9", "It's a truly interesting interactive experience that rewards replaying. It didn't sate my craving for unique gameplay, but the story got my attention. It's one of the most cinematic of games I've played. That said, because there are only a few things to interact with and nor real puzzles, it can feel inert. I am impressed by the how beautiful the game is, I wished it had more challenge or interactivity/puzzles. It's still worth experiencing."], ["KamenRiderDark", "User", "0", "Speaking as a movie lover, Virginia is a pretty fascinating story. Imagine if David Lynch directed the pilot episode of The X-Files. It has some great visuals and a soild score. It's worth it to at least watch a stream if you're into this kind of story."], ["IndieFreak", "User", "9", "Virginia's story is a delight to unfold, despite the fact that you can't affect it all that much. It's powerful, unconventional, daring and it isn't afraid to leave things to interpretation. Truly a sight to behold."], ["GrumpyReviewer", "User", "9", "This game is not for everyone. It's a strange, weird, walking simulator where you become a female officer in the FBI during the investigation of a missing child. But, the moment you get this assignment, it's like the game pushes into a rabbit hole and it keeps getting stranger and stranger to a point where it becomes hard to see the difference between dream and reality."], ["Agarwel", "User", "9", "It is very interesting \"game\" (to be precise: Interactive movie walking simulator). It is story based game told in very unique style. It is without words (and yet it works). And it is very cinematic. Meaning there are basiaclly no empty filler spaces. Even when you need to go between location, there are cuts like in the movie. So the game is feeding you interesting content all the time (in this way it is very different from Rapture, where you spent most of the time walking.). The Story is very difficult and honestly I dont understand it at all (playd just one). It is like watching very difficult Lynch movie. But it is told in a way, that it glued me to the TV and I had to bing-play it in one sitting. It is short game (little over 2 hours). But the price is reasonable (under 10 bucks) so it is totally fine. Personally Im recomending this title. It is not exactly a game. But it is great experience worth the money."], ["Tirah", "User", "8", "Right off the bat I'm going to say Virginia is NOT a game. You have no choices to make, and there's absolutely no way in which you can affect what's happening on screen. All you do is click on objects and people to progress the story, which is basically an equivalent of you pressing 'play' on your remote whenever the movie decides to pause itself. Because that's what Virginia is: an interactive movie. That's not a bad thing, though - if this is the kind of entertainment you enjoy."], ["Nobilis1984", "User", "8", "Virginia recalls the great Telltale Games but in other graphics. It needs no language and also works thus 1A."], ["Trunkis", "User", "0", "Atari's ET 2600 has more narrative falling down a pixelated well than this mess."], ["gygessgygess", "User", "10", "Wow, what an experience! I played it at a friends house, have no plans on replaying it, yet went ahead and paid for it to support what the devs have done here."], ["Drekassn", "User", "1", "I'm not going to rip on this for being \"not a game\" like so many others are doing. I'm going to rip on this because it's nonsense pretending to be a deep story. I can't stand things like this. A compelling mystery gives you hints throughout and then neatly wraps up at least some, if not all, of these clues. What a compelling mystery does NOT do is hand you some bullcrap symbolism that never gets explained in the slightest and then dumps a bunch of new information on you at the very end that doesn't seem to relate at all to the rest of the story and then ends the whole thing with \"Surprise! Aliens did it.\" It honestly feels like this game took a massive dump on my free time and then expected me to thank them for it. Really not a fan at all."], ["mr_blonde75", "User", "9", "Easily my favorite game of the year so far."], ["Gurdur", "User", "4", "Interesting story. But this is not a game. You can't affect whats happening at all, you basically just click and walk your way through cut-scenes of a movie with below par graphics. I was very disappointed and even bored at times. Not worth the time or money. The plot would call for a decent movie though."], ["fEtas", "User", "0", "I think it is the worst game I ever played."], ["roo7788", "User", "6", "me gutos el diseño simple de los personajes y como interactuan se siente como ver una pelicula con algunas interaciones pero la historia se vuelve muy tripi lo cual es bueno pero llega un punto en el cual el misterio que tratas de resolver se atora narativamente y sientes que la historia y el desarrollo se detiene sevpudo trabajarse mejor en el desarrollo de la trama pero me gusto que fuera super fumado el juego"], ["Kansler", "User", "7", "Confusing, mesmerising, disappointing, beautiful... all these things could describe what it feels like to play Virginia. Even in the best of times, these kinds of first person story-based games are not for anybody. And Virginia does not represent the best of times. It is definitely a flawed experience, to say the least, and it doesn't cohere in the way that it should. Nonetheless, the awesome soundtrack, the cinematic storytelling and the beautiful atmosphere of the surroundings make it worth picking up when it goes on sale if you like artistic, indie, atmospheric, solitary and cinematic game experiences."], ["timmytime", "User", "9", "I loved this one - tells a story with a lot of depth despite being wordless and pushes the medium. The only reason I haven't given it 10/10 is I think it goes on 2 or 3 minutes too long, which may seem silly on such a short game. I think they just went a bit overboard in the non-linearity and metaphor at the end, which I understand while important and obviously part of the experiment the game is going for, made it a little less tight and focused than it could be."], ["Ivan1989", "User", "1", "Lets get to point, shall we. We hear the phase, \"walking simulator\" allot with games like Heavy Rain, etc and others, however I think for the first time, we can actually call this game an actual walking simulator. Unlike the game mentioned above, this game has no goal, no story, no voice acting, no real gameplay, nothing. Its literally just walk to a point and transition to the next scene, that's it. Virginia is an ugly mess of game with poorly designed character models, no voice acting or text to explain what the hell is going on, dumb meaningless walking gameplay, with no real story, goal or anything. It literally a game about nothing!!! Terrible, don't even think about buying this so called game, because you want find a game in it."], ["Nel", "User", "7", "Intuitive very engaging game. The game is based on a case, and it has a great story. The graphics are average nothing eye popping or anything, but if you are looking for something that will take you about an hour or so to complete this is not a bad choice."]], "platforms": ["PlayStation 4", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/1/b5182685d72c33d3cb8c68b066093245.jpg"}
{"publisher": "Mike Bithell", "genres": ["Action", "Action Adventure", "Platformer", "Linear", "3D"], "rating": "T", "title": "Volume", "release_date": "Aug 18, 2015", "avg_score": "71", "summary": "Robert Locksley is a petty thief who happens upon a device known as \"Volume\". Originally intended to be utilized as part of a secret military coup, Robert now has the ability to simulate high-profile heists, so what does he choose to do? Broadcast these crimes over the internet. Make your way through this postmodern twist on Let's Play videos with the help of Danny Wallace as the voice of the Volume artificial Intelligence. From Mike Bithell, creator of Thomas Was Alone.", "reviews": [["Everyeye.it", "Critic", "80", "It's an interesting and brave product, able to deliver a great stealth experience."], ["Hardcore Gamer", "Critic", "80", "Whether you’re looking for a story that might shed some light about where society could go horribly wrong over the next few decades, or if you just want to recapture the magic of Metal Gear Solid: VR Missions, Volume is one of those games that demonstrates how cool independently developed games can be."], ["Brash Games", "Critic", "80", "It’s not the deepest or the most challenging stealth game out there and there are times when it can feel like an additional mode for a larger, more elaborate video game, but for the most part, Volume is a highly entertaining stealth game that puts immediacy and accessibility above elaborate gadgets or mechanics."], ["PSNStores", "Critic", "80", "The story, characters, level editor, and overall aesthetic are just really cool bonuses to an excellent stealth game."], ["Playstation Universe", "Critic", "80", "Volume is not perfect, but it is a relentlessly fun, interesting and engrossing stealth game that looks to have legs thanks to an excellently simple level creator."], ["Atomix", "Critic", "75", "Volume offers us a game that combines interesting classic stealth game mechanics with fresh elements on one hundred levels with very good puzzles and brilliant design. Even it has some problems with the community generated contents, the new game from Mike Bithell is a full recommendation."], ["Playstation Official Magazine UK", "Critic", "70", "Mike Bithell's long-awaited Thomas Was Alone follow-up is a bigger, fancier puzzle game, but one in which the levels don't quite come together as much as the Robin Hood plot. [Nov 2015, p.109]"], ["Gamer.no", "Critic", "70", "Volume gives you a good range of interesting means to sneak through a hundred quite creative levels filled with sneaky puzzles. A hundred is a bit too many, but on the other hand, the game does get more interesting the further you get into it. To me, Volume is essentially a puzzle game with a stealth theme. It is a quite good puzzle game, but for a stealth game, the room for creativity and impulse is too limited to my taste."], ["Push Square", "Critic", "70", "Volume is a bit of a mixed bag. Underutilised voice performances and some really nasty technical issues stand in the way of the title getting top marks. However, it's difficult for us to deny that the actual minute-to-minute gameplay is damn fun."], ["We Got This Covered", "Critic", "70", "Mike Bithell once again unleashes another creative title onto the indie scene, but Volume's addictive sneaking and fantastic cast can't distract from the lacking story."], ["Metro GameCentral", "Critic", "70", "An enjoyable homage to old school Metal Gear Solid, but a lack of challenge and an overbearing story means it isn’t quite a stealth classic in its own right."], ["4Players.de", "Critic", "65", "An interesting take on stealth action with a flawed checkpoint system and a serious lack of challenge."], ["Kill Screen", "Critic", "60", "Volume’s strengths are primal but simple, at times feeling like a Crossy Road-style time-passer with a cyberpunk sheen. It tries but ultimately doesn’t say much of modern society or governments beyond the elementary. Indeed, it is the modern videogame incarnate, warts and all."], ["Digitally Downloaded", "Critic", "60", "Volume deserves credit for being fresh and accessible, but after a couple of dozen levels or so, it starts to grow repetitive. It was easy to pick up the controller and play, but without a lot of new innovations and a middling storyline, it was also entirely too easy to take breaks and move onto something else."], ["Twinfinite", "Critic", "60", "Volume is a solid game. Its new-age telling of a certified classic is intelligently done. Its gameplay shines every now and then, but is overall lacking during most scenarios. Yet still, it is recommended if you are a fan of stealth and puzzles."], ["Allthat", "User", "7", "The story is basically a futuristic version of Robin Hood and the gameplay is similar to the first MGS game. It's fun to play if you were a fan of the original Metal Gear games but if you weren't, then there isn't anything about this game that would appeal to you. The story is average, and there's nothing special about this game. It's not a bad game, no. But for me its just too mehh..."], ["Nel", "User", "7", "Fun game, story is simple, and it is quite short (5-6h). There is not much replay value (except from doing a better time), but this does really not reward you in anyway unless you care about the leaderboards..."], ["NihiRagnarK", "User", "6", "Don't buy it for PSVR!"]], "platforms": ["PlayStation 4", "PC", "PlayStation Vita"], "image_url": "http://static.metacritic.com/images/products/games/0/e67ea32538890b91758bab0f1c8e0669.jpg"}
{"publisher": "Badland Games", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "rating": "E10+", "title": "Vostok Inc.", "release_date": "Jul 26, 2017", "avg_score": "65", "summary": "The Wolf of Wall Street... with lasers.", "reviews": [["Playstation Universe", "Critic", "80", "While its individual parts aren’t anything particularly special, Vostok Inc. melds those parts into a unique, amusing, and compelling whole. The manner in which developer Nosebleed Interactive has fused a clicker game to a twin-stick shooter and made sense of it is impressive. A rather nice surprise."], ["Push Square", "Critic", "80", "A mental genre mash-up that fuses the best of idle clickers with actual gameplay mechanics, Vostok Inc probably should come with a health warning. This may not be the best twin-stick shooter you’ll play on the PlayStation 4, but by mixing and matching mechanics from different titles it unleashes a beast that’s greater than the sum of its parts. Play responsibly – but most importantly, play."], ["Meristation", "Critic", "70", "Vostok Inc. is a funny game where you play as Jimmy Goldmann, a true capitalist CEO. It's a good game, but it has a problem: it's so repetitive if you play seven or eight hours (or more)."], ["Vandal", "Critic", "55", "Vostok Inc. is strange in a good way and fun, but not for long. It has some interesting ideas, but it needs to be deeper to keep the player entertained for more than a couple of hours."], ["Playstation Official Magazine UK", "Critic", "50", "The shooting is fun, and there's some chuckle-worthy writing but once you realise you're doing the same things over and over again, it falls flat. [Oct 2017, p.95]"], ["Alecj", "User", "7", "A limited but fun \"non\" clicker.....clicker.  You actually fly around the solar system (and eventually half a dozen other) blowing up asteroids, and alien ships. You then land on planets to buy upgrades that will earn you an ever growing pile of money...."], ["YetiYeti", "User", "10", "Tolles süchtigmachendes Spiel. Habe am Stück 4 Stunden gespielt, bis die Augen brannten. Kann ich nur empfehlen. Die Shoot‘em Up Passagen sind nicht einfach, aber es passiert nicht viel, wenn man stirbt."]], "platforms": ["PlayStation 4", "PC", "PlayStation Vita", "Switch", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/2/878af1db82c5b7dfcf00f1a6903609c3.jpg"}
{"publisher": "MY.COM", "genres": ["Action", "Shooter", "Light Gun"], "rating": "E10+", "title": "VR Invaders: Complete Edition", "release_date": "Apr 18, 2017", "avg_score": "68", "summary": "Dive into a story-driven sci-fi shooter that pushes your PS VR hardware to its limits. Blow your enemies to pieces in frenetic shooter action. Leave a trail of destruction as you turn each of the highly detailed levels into a virtual scrapyard.", "reviews": [["PlayStation LifeStyle", "Critic", "70", "A game doesn’t always need to be flashy in order to be great. It doesn’t need the backing of a major license. Sometimes it just needs to do what it sets out to do very well to stand out above the rest. VR Invaders is a superbly crafted bullet hell VR game that is highlighted not by an ostentatious setting, but rather excellent game design. It’s just a shame that excellent game design in VR more often than not means the experience ends far too early, lacking a good balance between mechanics and content."], ["Everyeye.it", "Critic", "70", "Not revolutionary."], ["4Players.de", "Critic", "70", "It is as good and clean fun under the PSVR headset as it was with Rift a few months ago. Thanks to the tactical slow-motion and the sufficient motion tracking this remains a decent shooting gallery with a sci-fi touch."], ["UploadVR", "Critic", "65", "VR Invaders is a rock solid example of the wave shooter genre that is flooding the industry right now. It’s not original or even particularly memorable, but its mechanics are refined and its gameplay is entirely reliable (it gets extra points for a competent PlayStation VR port, too). It’s soon forgotten but appreciated while it’s there."], ["PlayStation Country", "Critic", "60", "VR Invaders offers a fun, if short lived VR shooter experience. The shooting feels good and the enemy variety keeps things interesting, but the lack of online leaderboards combined with the limited content means it won’t keep you occupied for long."], ["Devasstator", "User", "6", "I think the best way to sum this game up is \"meh\". It's okay for what it is and has some polish (though the graphics are pretty basic so that doesn't mean much) but it's very short (about an hour) and very repetitive for the hour it lasts. There is also a survival mode and training, but it's literally all the exact same thing with no variety. The bosses are basically the exact same thing as well over and over. The shield and slow down are probably the only notable things for this one and they aren't worth the price of admission alone. Definitely wait for a sale on this one, unless you love wave shooters and score-chasing. If you love those 2 things, this game is probably worth a purchase."], ["kch3691", "User", "6", "VR invaders is shooter that uses the move controller. Shooters are one best genres in VR best this one is pretty generic."]], "platforms": ["PlayStation 4", "PC"], "image_url": "http://static.metacritic.com/images/products/games/9/12de3644cf337d2efee726fc696609f2.jpg"}
{"publisher": "Viewpoint Games", "genres": ["Racing", "Arcade", "Other"], "rating": "E", "title": "VR Karts", "release_date": "Sep 12, 2017", "avg_score": "42", "summary": "The checkered flag is about to drop on a new Virtual Reality racing experience. Get in the drivers’ seat of your own customized kart and race against other players. Race through stunning environments, collect power ups and use weapons to gain the upper hand over other racers. VR Karts is a fun and family-friendly racing game designed specifically for Virtual Reality. [Playstation.com]", "reviews": [["Playstation Universe", "Critic", "65", "While lacking in the charm department, VR Karts captures the fun and chaos of kart-racing really well in virtual reality."], ["4Players.de", "Critic", "42", "While the immersion is interesting at first, you’ll soon discover that there is a lack of variety in almost every aspect: track design, visuals, challenge level, content in general."], ["PlayStation Country", "Critic", "40", "VR has been around for a while now and just being in VR isn’t enough. Like any other kart racer we want interesting levels, tight controls and fun power ups. VR Karts doesn’t deliver any of that. The VR is welcome but without it, there would be literally no reason to own this."], ["Vgames", "Critic", "35", "VR Karts features nothing but being an exclusive karts game on the VR platforms. The gameplay isn’t tight enough, it lacks original fun content and even the power-ups are totally boredom. With so many good karts game on the gaming history, it’s surprising that a game developer will deliver such a bad experience."], ["TheSixthAxis", "Critic", "30", "Even, if for some reason, you happen to take a liking towards VR Karts, it’s not worth £34.99 of anyone’s money and exposes the imaginary premium that studios are putting on games simply because it says VR in the title. It’s such a sour point to end on, but even if it were priced accordingly, VR Karts rarely peaks above mediocrity."]], "platforms": ["PlayStation 4", "PC"], "image_url": "http://static.metacritic.com/images/products/games/4/c2784a3238095d0869822a82dac1fe2f.jpg"}
{"publisher": "Reddoll Srl", "genres": ["Sports", "Individual", "Other"], "rating": "E", "title": "VR Ping Pong", "release_date": "Feb  7, 2017", "avg_score": "53", "summary": "VR Ping Pong is a simulator that thanks to VR technology, and with the help of SteamVR Controllers, brings a ping pong table into your lounge. Using 1:1 scale with virtual reality, you will have the sensation of play ping pong in reality: Virtual reality teleports you inside voxel-style environments that until today you could only dream to visit.", "reviews": [["4Players.de", "Critic", "61", "I didn’t think I would enjoy VR Ping Pong that much. But the physics and control at its core are spot-on. Unfortunately it is harmed by a serious lack of content."], ["UploadVR", "Critic", "60", "VR Ping Pong is a likable take on the popular sport that’s held back by its lack of multiplayer. There’s only so much fun you can have with the AI matches and minigames and, once you’ve had it, there’s little reason to stick around."], ["GameSpew", "Critic", "60", "Ultimately, if you’re looking for a serious table tennis game then this isn’t it; VR Ping Pong sits firmly in the casual gaming genre, but that isn’t necessarily a bad thing."], ["Playstation Official Magazine UK", "Critic", "50", "Sometimes infuriating, occasionally wonderful, VR Ping Pong has a sweet spot where it plays beautifully, but it's hard to find. A brave but flawed experiment. [Apr 2017, p.97]"], ["PlayStation Country", "Critic", "50", "VR Ping Pong may be basic in design but it is a gruelling challenge in every other way. Whether it is enduring the boring soundtrack, the based in realism control scheme or the battle with jittering move tracking it is one hell of a test of patience and skill. There are some redeeming qualities such as the arcade mode, however I couldn’t recommend this to anyone other than Ping Pong fanatics."], ["Push Square", "Critic", "30", "VR Ping Pong's a steeply priced simulation that mostly misses the mark. The presentation is rudimentary and the gameplay is awkward and unrefined. The developer may argue that we're just bad at table tennis, but we have no problem in real-life, so clearly there's something awry here. Factor in technical glitches and this is difficult to recommend."], ["Mrscrewpacker", "User", "8", "Great Table tennis sim , Ive played table tennis in real life and this the closest you can get to having a table tennis table in your house . PSVR is in need of sports titles and this is a great addition . The game may take some a while to get use to but after spending time in practice you will be fine . The area of play is bigger than usual Psvr games but that's to be expected with a game of this type . Difficulty level is set at a good pace . Ive had no tracking problems and physics have been spot on . If devs update game with more tournaments or content that would be amazing , I hope this game sells well ."], ["Rizzo41999", "User", "9", "Purchased this game as it was on sale through the PS Store for $5.99.  Indie game, bit of a learning curve in the beginning.  Give it some time and practice and this game is actually pretty fun. Just remember to change the table height etc, in the settings.  All in all, not Sports Champions level but certainly better than nothing."]], "platforms": ["PlayStation 4"], "image_url": "http://static.metacritic.com/images/products/games/6/1e77fe7d9a4f3fd8933303bef01fd760.jpg"}
{"publisher": "Cherry Pop Games", "genres": ["Sports", "Team", "Soccer", "Arcade"], "rating": "N/A", "title": "VRFC Virtual Reality Football Club", "release_date": "Mar  6, 2018", "avg_score": "64", "summary": "Introducing VRFC, the world's first Virtual Reality Football Club, bringing to life the players, teams, and atmospheres of five aside, Sunday league football. Embark on your quest to be the greatest VR football player in the world, playable online against other players or practice your game offline in a range of solo training challenges and hone your skills to hit the top spot on the global leaderboards. Enjoy fast paced football antics as you compete for possession of the ball, pass to your teammates and get that ultimate goal. [Playstation.com]", "reviews": [["PlayStation Country", "Critic", "70", "VRFC does a okay job of representing football in VR. The lack of single player, for now, is disappointing but running down the pitch with the ball at your feet and the goalmouth in your sights is thrilling. It's the infancy of VR itself that stops this becoming a true football experience but there is still fun to be had if you can find a game."], ["Multiplayer.it", "Critic", "65", "Quotation forthcoming."], ["4Players.de", "Critic", "62", "With a steep learning curve and the focus on multiplayer team duels this is not for everybody. But Cherry Pop Games managed to capture the team dynamics that are necessary to have success together. The fun you have depends heavily on the squad you are in, though, and how they treat you as a player - and as a person."], ["Push Square", "Critic", "60", "VRFC is not a good representation of football, but that doesn’t mean it’s bad. Like the table-top variety, it doesn’t need to be accurate to be entertaining, and once you embrace the insanity there’s fun to be had. VRFC is flawed and disconnected, but also spontaneous, amusing, challenging, and fun. At this budget price, we can think of worse ways to spend a weekend."]], "platforms": ["PlayStation 4", "PC"], "image_url": "http://static.metacritic.com/images/products/games/9/cfa6cde65d10e94d731ed975e32ef1c8.jpg"}
