{"publisher": "EXOR Studios", "genres": ["Strategy", "Real-Time", "Defense"], "rating": "T", "title": "X-Morph: Defense", "release_date": "Aug 30, 2017", "avg_score": "78", "summary": "Unique fusion of a top-down shooter and tower-defense strategy. You are the invader. Use destructive weapons or lead you enemies into a maze of towers. Strategize in the build mode by carefully selecting various types of alien towers or throw yourself right into the heat of the battle.", "reviews": [["GameCritics", "Critic", "90", "While X-Morph: Defense may not reinvent its wheel, nearly every decision it makes is a smart and correct one, and this out-of-nowhere project with a dull-sounding title really hums. It’s fast and furious, yet this wonderfully-crafted tower defense/shmup hybrid does everything it can to be a welcoming, player-positive experience that doesn’t sacrifice the quality of its strategy or the intensity of moment-to-moment play. X-Morph: Defense might need to spend a little more on PR, but don’t let the lack of buzz disguise the fact that it is absolutely worth the of the price of admission."], ["Video Chums", "Critic", "82", "X-Morph: Defense is one of the most impressive and addictive games that I've played all year. The blend of twin-stick shooting and tower defense is perfect for some intense gameplay and the fact that you can enjoy it with a pal is the icing on the cake."], ["CD-Action", "Critic", "80", "A great hybrid of a puzzle game and a shooter that comes with wonderful visuals and a couch co-op, but gets repetitive by the end and sometimes annoyed me with uneven difficulty level. [11/2017, p.66]"], ["TheSixthAxis", "Critic", "80", "X-Morph: Defense successfully mashes up the shoot ’em up and tower defence genres which is no mean feat. and the co-op mode is a really great addition and helps alleviate the repetitive nature of the tasks. There is at least fifteen hours of gameplay on the easiest difficulty level and as you are ranked at the end of each battle there’s a good reason to go back and try again. If you like tower defence and big explosions it’s well worth a look, especially if you have a friend to join the battle."], ["The Games Machine", "Critic", "78", "X-Morph: Defense is an interesting experiment, a hybrid formula that combines the tower defense genre with the past-paced action of twin-stick shooters. The gameplay is great, but there are still some annoying technical problems that need to be addressed as soon as possible, in order for the game to reach its full potential."], ["Cubed3", "Critic", "60", "While a great game, a fix to this is in sincere need. The gameplay is great and shows the best sides of both genres, as it mixes together in a wonderful way that helps them enhance each other, while at the same time offering a more pure experience for the respective genres."], ["Vandal", "User", "8", "Good game. Nice combination of twin stick shooter and tower defence."], ["Kaprawiec", "User", "10", "It was so good on PC that I had to buy second copy on PS4 :D Hope they will port it to N:Switch because id love portable version of it and would definitely buy to show my support."], ["Malooga", "User", "7", "X-Morph won't shatter your expectations of a twin-stick shooter or a tower defense title, but does marry the ideas quite well, with attention to detail that I did not expect from a small-budget title."]], "platforms": ["PlayStation 4", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/4/0b2470059d4f7dcb6a0f732beb7a00a0.jpg"}
{"publisher": "2K Games", "genres": ["Strategy", "Turn-Based", "General", "Tactics"], "rating": "T", "title": "XCOM 2", "release_date": "Sep 27, 2016", "avg_score": "87", "summary": "Earth has changed. Twenty years have passed since world leaders offered an unconditional surrender to alien forces. XCOM, the planet’s last line of defense, was left decimated and scattered. Now, in XCOM 2, the aliens rule Earth, building shining cities that promise a brilliant future for humanity on the surface, while concealing a sinister agenda and eliminating all who dissent from their new order. Only those who live at the edges of the world have a margin of freedom. Here, a force gathers once again to stand up for humanity. Always on the run, and facing impossible odds, the remnant XCOM forces must find a way to ignite a global resistance, and eliminate the alien threat once and for all.", "reviews": [["Metro GameCentral", "Critic", "100", "A superb sequel that improves on every aspect of the already excellent originals, and offers one of the most absorbing and unpredictable strategy experiences ever seen."], ["Telegraph", "Critic", "100", "Every choice, every death and every shot feels like it counts in XCOM 2 and it is this feeling of real consequence that makes for a truly remarkable strategy game - one that goes beyond its clever design decisions and the odd technical hiccup to create a tangible sense purpose and real emotion to your squad’s story. As an experience that puts you in control, lets you relish victories, forces you to truly mourn mistakes, and allows you to grow as a tactician against insurmountable odds, XCOM 2 is near faultless."], ["The Games Machine", "Critic", "94", "Despite some fps issues, XCOM 2 is as perfect as the PC version. The best game of this year, no doubt about it."], ["Playstation Official Magazine Australia", "Critic", "90", "While it’s a shade short of perfect, there is no comparison: you will find no finer strategy game on PS4. [Christmas 2016, p64]"], ["Playstation Official Magazine UK", "Critic", "90", "No mere sequel, XCOM 2 reshapes everything with lots of success. It won't coddle you, and the invisible dice hate you, but overcoming these odds is as sweet as ever. [Dec 2016, p.72]"], ["Hobby Consolas", "Critic", "90", "Firaxis gives us a master class about how to make a strategy game with good visuals and being accessible while remaining complex, challenging for the player and with a lot of deep gameplay elements."], ["COGconnected", "Critic", "90", "It’s a well-founded mix of strategic turn-based battles, resource management, and customization that makes each gameplay unique to its very own player. While XCOM 2 does have some issues with its framerate and loading times, its gameplay overshadows its imperfections and becomes a very small disturbance in a largely enjoyable game."], ["3DJuegos", "Critic", "90", "XCOM 2 is an example of “more and better”, until you’re surprised with some of its new advanced features and missions, becoming an excellently planned title."], ["Playstation Universe", "Critic", "90", "XCOM 2’s PS4 port is hobbled by some turgid technical issues, but it’s a testament to how magnificent a game it is that it still rises above them. Outstanding, brutally challenging and endlessly enjoyable, XCOM 2 is a legitimate triumph."], ["Gamer.no", "Critic", "90", "XCOM 2 brings all of its strategy-goodness to the consoles. Despite a few performance issues and long loading sequences, the deep strategy mechanics and customization options create a tactical classic that console gamers might finally enjoy."], ["Push Square", "Critic", "90", "While the occasional technical issues might hamper the experience somewhat, XCOM 2 remains a superb strategy game that expertly weaves stellar mechanics and emotional story-telling into an engrossing campaign in which every choice that you make feels genuinely important. It can be both brutally difficult and depressingly ruthless, but the scant moments of joy that you'll experience in your attempts to overthrow the alien regime should provide more than enough incentive to keep fighting the good fight."], ["Worth Playing", "Critic", "90", "Like the first game, XCOM 2 is a little sluggish on the PS4 — likely because it was designed with PCs in mind."], ["Multiplayer.it", "Critic", "90", "It might not be a stellar porting, but XCOM 2 on consoles is, nonetheless, one of the best strategy games available."], ["Atomix", "Critic", "90", "XCOM 2 expands all the great gameplay mechanics that we enjoyed in past games of the series. All kinds of emotions await you in this great tactical game about making hard decisions. No major problems with the console version, a few framerate issues and maybe longer loading times but nothing that really hurts the core experience."], ["LaPS4", "Critic", "90", "XCOM 2 launches on PS4 with the same strength and virtues as its PC counterpart did less than a year ago. It's an evolution of XCOM: Enemy Unknown, but with a harmony in each of every new mechanic that further enhances the positive aspects of the first game. A must for every strategy, turn based combat fan out there."], ["GameSpot", "Critic", "90", "Some technical issues have migrated from this year’s PC release: characters sometimes freeze in place while the turn progresses; soldiers can take almost 10 seconds to execute commands; and cutscenes have a tendency to drop frame rates throughout campaigns. But the layered tactics, impactful meta-game, and deep character-building are all intact on PS4 and Xbox One. XCOM 2 remains a superb strategy title."], ["LevelUp", "Critic", "89", "XCOM 2, the turn-based strategy masterpiece is now available on current generation consoles. The core experience remains untouched thanks to well-established controls and little to no technical difficulties. A must have for any gamer."], ["Everyeye.it", "Critic", "88", "Technicalities aside, XCOM 2 is an amazing game, a great strategy game, and we strongly recommend you to try it out."], ["Gaming Nexus", "Critic", "88", "If you can take punishment as well as you can dish it out, then XCOM 2 strikes the right balance. Its tactics are hardlined, its urgency is persistent, and it will wear you down even as it builds you up. A beautiful, brutal beast of a tactics game. But do what you can to clean up these graphical and gameplay hitches, Firaxis; this game deserves it."], ["InsideGamer.nl", "Critic", "87", "Xcom 2 offers the same challenging turn-based gameplay and tactical possibilities on consoles as it does on pc. It is such a thrill to lure aliens in your trap, while connecting emotionally to the soldiers that work for you. It is too bad the loading times are a tad long."], ["PlayStation LifeStyle", "Critic", "85", "Great strategy games are few and far between, and XCOM 2 is an absolute treat for anyone craving a challenge on every level. Marred only be a few technical presentation hiccups and slow loading times, XCOM 2 is a deep mental and emotional experience that tests each player’s resolve to triumph against overwhelming odds and failure."], ["IGN Sweden", "Critic", "83", "XCOM 2 will drive you mad with its challenging gameplay, but don't give up - this is a well designed and entertaining experience."], ["RPGamer", "Critic", "80", "XCOM 2 doesn't reinvent the wheel, which is a good thing. It takes the lion's share of the gameplay from the last game and embeds it into the new game's foundation, shifting around some pieces to support the new gameplay fixtures without really altering the heart of the experience. With new soldier classes, enemy types, mission objectives, an all-new base, and a story built on losing the invasion the last time around, the new game provides the same intense combat experience and resource management series veterans expect. It ups the ante in terms of difficulty, and the result is a nail-biting game of close calls and narrow victories. While this may turn off some, it provides an amazing feeling of victory when one finds the sweet spot between keeping troops alive and advancing the long-term narrative-driving projects."], ["PSX-Sense.nl", "Critic", "80", "It's addictive and fun, even if it lacks innovation and any real graphical prowess."], ["XGN", "Critic", "80", "XCOM 2 on consoles looks and feels almost as great as the pc version. The only thing is that the custcenes stutter somethimes and the loading times are a bit long. Nevertheless this is a game you must play. Especially if you like a challenge."], ["VideoGamer", "Critic", "80", "XCOM 2 is more tense and thrilling than a turn-based strategy has any right to be. There are some great additions to the original gameplay, but the port to console is an imperfect one."], ["We Got This Covered", "Critic", "80", "XCOM 2 has received a solid port here, albeit one with some bugs. Those who can't play on PC will still have a good time, but there's really no reason to pick it up if you already have a solid gaming rig."], ["GamesRadar+", "Critic", "70", "Impossible to recommend ahead of the PC version because of some issues with the port, but nonetheless one of the most unique experiences on console."], ["CGMagazine", "Critic", "60", "XCOM 2’s console version is a buggy mess cobbled together from a far better game, and the worst possible way to experience the game."], ["jstevo", "User", "10", "Initially this game was frustrating; being quite a good gamer, but having not played the original XCOM, I selected “moderate” difficulty. This was a huge mistake; not only was the game punishing every SINGLE error I made, I was aimlessly wandering a map and dying often. Losing key staff members. Eventually rage quitting."], ["OortCloud", "User", "3", "I played and loved all the original XCOMS plus the first reboot and loved them.  I've played this for 20 hours now and am going to sell it because..."], ["Johnnybont", "User", "9", "This is an amazing game, a great advancement on the previous instalment. A must play for everyone who owns a PS4 and is looking for a strategy game! yes, it is a little buggy and yes the camera can be a little annoying, but the game play is king here and massively makes up for these points."], ["drlowdon", "User", "8", "X-Com wasn’t exactly an easy game but this sequel takes things up another notch right from the start in terms of difficulty, and I’m sure that will put a fair number of people off (I came close to giving up after my 3rd restart). It’s worth sticking with and taking the time to learn how everything works however as you’ll be rewarded with a genuinely deep and rewarding strategy game."], ["Dattwood7", "User", "10", "If you liked XCOM: Enemy Unknown/Within, you'll like this game. You might have to get used to the new classes (the biggest change, in my opinion), but there are enough improvements in this game to win you over (one of the biggest is undoubtedly the improved character customization options: You'll get so attached to your crew you'll want to restart every time one of them gets hurt.) There might be some bugs, and you might gripe about some other little things, but the core game is there. This is an excellent strategy game, simple as that."], ["Pureray", "User", "10", "The fight for Earth, just became a whole lot harder in Xcom2! A simply great addition for any strategist fan to have for their Playstation 4! It shares the same game mechanics from the original, now with better visuals and more new enemies and equipment to experiment with in the battlefield!"], ["fallouts", "User", "9", "Great game. Must own for fans of the first two on last gen of consoles. The graphics are crisp, clean and stylish. The game play is improved with lot of new features and new classes."], ["Malooga", "User", "10", "Did you like/love X-Com Enemy Unknown? Buy X-Com 2. That's the basic gist of things, but I still have like 50 characters to go for a minimum review...so...aliens."], ["azog", "User", "10", "Elapsed strategy game with turn-based system."], ["countofhell4321", "User", "8", "The mood of this game is unforgettable, brand new rethought strategy, new features and renewed, stronger alien units are going to bring this game even for a higher level, however the graphics are not improved, only  minimal, it is clearly the same engine as the XCOM 2012 and the soundtrack, few sound effects are reused as well."], ["thj1188", "User", "5", "I wish we had more strategy games on console. Enjoyed it as much as the original xcom but as the original on console it is littered with graphical glitches slow down also had to sit through some cut scenes twice as they repeated for some reason and multiple crashes. Lost progress from crashes is generally minimal due to the auto save but it is unacceptable. If  a game can not be ported properly it should not be ported. Due to these problems and my personal scoring system  I can not rate it higher than a 5."], ["spadePerfect", "User", "9", "This game is satisfyingly punishing and hard as hell, but the constant tension makes you want to keep going anyways."], ["midniteblues", "User", "9", "XCOM 2 is one of the best experiences I've had on the PS4. The game is actually harder than XCOM: Enemy Unknown, however it manages to feel more rewarding. I felt excited every time one of my soldiers gained a promotion and the feeling of satisfaction when beating a difficult mission is something that not many other games provide. The only bad thing I can say about the PS4 port is the super long loading times. I think the further you get in the game, the longer the loading times become. I experienced loading times of up to 3 minutes when I was close to the end of the game. However, even with that said, this game deserves all the praise and it is a must play. Hopefully 2K will patch the game and make it run smoother. Other than that, this game is nothing short of amazing. 9/10"], ["mikepatyaev", "User", "6", "Great game. Must own for fans of the first two on last gen of consoles. The graphics are crisp, clean and stylish. The game play is improved with lot of new features and new classes."], ["Wigglesbury", "User", "2", "I really wanted to love this game. From UFO Defense to the new Enemy Unknown I've played them all over and over, and although the games have gotten worse over time, this one is the bottom so far. The idea is solid, and the research and engineering is good. Combat is cool, aliens are well designed. Even the learning curve for combat is excellent. The game itself is a buggy mess. It freezes, crashes, Ironman is almost unplayable. Near the end of the game I'm seeing a consistent 2-3 minute load screen after a level, followed by another screen with a mission summary with loading again. I might be a bit biased because I think the first few games killed the idea of overwhelming alien superiority and sent you into combat with 14 soldiers against 4 aliens and it was a tough go. Now alien superiority is 4 of you rolling 11 aliens right off the hop and it keeps getting easier. Anyway, all said and done, gameplay is solid, graphics are alright-ish with terrible collision and clipping problems, and wait times are disgusting."], ["horrorsparadise", "User", "10", "Welcome back commander."], ["BigMatchu", "User", "2", "It's not fun. This game is a steaming pile of **** and a waste of money. Gonna sell it...Game mechanics are sinply messed up and its not fun when you see youe team destroyed in just one turn"], ["pelotasDePiedra", "User", "10", "Fantastic gama that improves on the first one in every aspect. The difficulty has been ramped up though so you need to be prepared to lose more people this time around. Delicious game regardless!"], ["Atilla1456", "User", "10", "Incredible game, exactly what I bought it for. It holds true to the XCOM Franchise, and presents new challenges while adding new functions. A great story also comes along with the great gameplay and \"athmosphere\" of XCOM 2. A game that is worth buying."], ["hokido", "User", "9", "After both Valkyrie Chronicles and The Banner Saga this year i was more than happy to jump into another turn based strategy game, this time the follow up to the very good XCOM Enemy Unknown/Within."], ["Heisenberg93", "User", "7", "XCOM 2 grew up in my thoughts with a lot of trust, hype, but also some doubts. I was expecting great things from Firaxis. I expected that they could overcome the first chapter. I won't talk about this game as the others want me to do it; I'll talk about this game for what I think. And what I think is that it was a disappointment, already anticipated in part by the PC audience."], ["Eretik", "User", "0", "This game is not playable on PS4 due to terrible loading time 1:30 - 1:40 required to load your save! Unbelievable, just unbelievable. XCom 2 is strategy games and save/load is the only method to understand complicated game mechanics. Unfortunately for us, in XCom2 your gameplay almost exclusively consists from loading screen."], ["thrill747", "User", "10", "Oh man, such a great game!  This review is for the benefit of anyone who might be \"on the fence\" about getting this game.  Basically, if you already played the crap out of XCOM:Enemy Unknown/Enemy Within and are looking for more then you gotta get this game.  It does have a few glitches in gameplay and cut-scenes but nothing that ruins the game, stops the game, or ever takes you out of the game.  All-in-all it remains a super-challenging and immersive XCOM experience.  Highly recommended!  Just be sure to save often 'cuz it is not easy!"], ["GamerJosh0137", "User", "7", "I picked up Xcom 2 on ps4 the day it was released last Tuesday mainly for something to play until this fall's flood of games I have been waiting for.  I'm not a RTS fan at all really.  I don't have anything against RTS games I just don't think consoles are an efficient way to play them, which might be why you don't see many RTS games on consoles.  The last time I had a gaming PC was when the original Command and Conquer Red Alert came out lol.  Anyway Xcom 2 is an real time strategy game based on guerrilla warfare against an Alien race that has almost completely taken over Earth and its inhabitants.  You must build up your base along with weapons, armor, and soldiers in order to become a formidable foe against the Advent (the aliens).  I was not expecting to like the game as much as I did.  I really wish though that I could have played Xcom 2 on a PC because the only problem I have with this game is the amount of technical issues I had while playing.  Otherwise, my score would have been a 9 or a 10.  First off you will see that sometimes your enemies completely ignore some of the rules of engagements that are supposed to apply to them as well as the player.  Hit chance is also a problem.  After running in to a few hit chance problems I started recording my skirmishes.  A lot of times my soldiers would have a 90% chance to hit the intended enemy but most of the time would miss.  I found that Soldiers that had a 40% chance to hit their targets did so much more often that the times my soldiers had a 90% hit chance.  I also came across some instances where I would have my soldier ONE tile away from an enemy and after giving the fire command the soldier would raise his rifle several inches above an enemy's head and completely miss!  I could even see he would miss before he even fired.  Imagine being in combat and your enemy standing right in front of you says \"I'm gonna kill you, you sob!\"  Then raises his rifle to point at a cloud, fires, then says in his mic \"I missed him!?\"  WTF?  Yet the Advent NEVER misses when they fire at me lol.  Either way though the game is definitely worth the price.  Dying or failing missions actually matter. If you lose a soldier in the field he or she is gone forever which adds to the excitement of completing a mission with 0 casualties.  The AI in this game is pretty impressive giving it a certain kind of challenge.  Don't get me wrong, I know they are both completely different games but when I finally beat a difficult mission or enemy it makes me feel the way Dark Souls does after beating a boss after several hundred tries.  The difference is Xcom only gives you one chance to get it right.  Unless you want to be a wimp and use previous saves so that you don't fail.  I highly recommend you don't do that though.  You will lose interest pretty fast if you make it too easy."], ["WrenOz", "User", "6", "I picked up Xcom 2 on ps4 the day it was released last Tuesday mainly for something to play until this fall's flood of games I have been waiting for. I'm not a RTS fan at all really. I don't have anything against RTS games I just don't think consoles are an efficient way to play them, which might be why you don't see many RTS games on consoles. The last time I had a gaming PC was when the original Command and Conquer Red Alert came out lol. Anyway Xcom 2 is an real time strategy game based on guerrilla warfare against an Alien race that has almost completely taken over Earth and its inhabitants. You must build up your base along with weapons, armor, and soldiers in order to become a formidable foe against the Advent (the aliens). I was not expecting to like the game as much as I did. I really wish though that I could have played Xcom 2 on a PC because the only problem I have with this game is the amount of technical issues I had while playing. Otherwise, my score would have been a 9 or a 10. First off you will see that sometimes your enemies completely ignore some of the rules of engagements that are supposed to apply to them as well as the player. Hit chance is also a problem. After running in to a few hit chance problems I started recording my skirmishes. A lot of times my soldiers would have a 90% chance to hit the intended enemy but most of the time would miss. I found that Soldiers that had a 40% chance to hit their targets did so much more often that the times my soldiers had a 90% hit chance. I also came across some instances where I would have my soldier ONE tile away from an enemy and after giving the fire command the soldier would raise his rifle several inches above an enemy's head and completely miss! I could even see he would miss before he even fired. Imagine being in combat and your enemy standing right in front of you says \"I'm gonna kill you, you sob!\" Then raises his rifle to point at a cloud, fires, then says in his mic \"I missed him!?\" WTF? Yet the Advent NEVER misses when they fire at me lol. Either way though the game is definitely worth the price. Dying or failing missions actually matter. If you lose a soldier in the field he or she is gone forever which adds to the excitement of completing a mission with 0 casualties. The AI in this game is pretty impressive giving it a certain kind of challenge. Don't get me wrong, I know they are both completely different games but when I finally beat a difficult mission or enemy it makes me feel the way Dark Souls does after beating a boss after several hundred tries. The difference is Xcom only gives you one chance to get it right. Unless you want to be a wimp and use previous saves so that you don't fail. I highly recommend you don't do that though. You will lose interest pretty fast if you make it too easy."], ["mikehettfield", "User", "10", "I was having my doubts, but at the end this game Is such a epic one to me, i love the character customization and the setting, is just how strategy games should aim for, I-m so glad it-s on ps4 now so more people get to know thhe series and keep it growing, STOP READING ANYMORE AND GO GET IT!!!! XD"], ["megapro", "User", "3", "The game is awesome. Great graphics, music, sound, characters... Fun to upgrade and fix with your base. Good enough story. But, it really tests your patience when it comes to waiting. It's fast in the beginning but a few hours in it takes forever to load a mission. This really lowers the score. Also, the controls are not the best, but they work."], ["thedaarkbatty", "User", "0", "Why is it getting such good reviews? It's nothing original AT ALL. It's basically Call of duty but with aliens this time. Shot an alien, rinse and repeat. NOTHING FUN."], ["GABRIEL1030", "User", "9", "It´s a nice strategy game, the maps are aleatory and the experience is well balanced."], ["Tallulah", "User", "7", "Honestly, this game deserves better than my 7. I gave it a 7 because quite frankly I strongly dislike Firaxis. Their incompetence and arrogance knows no bounds."], ["shiftyman", "User", "9", "XCOM 2 is the hidden gem on PS4, anyone who is unsure whether to purchase it, like I was, will not be disappointed after a few hours of gameplay. The amount of upgrades and customisations available is amazing and fun. The turn base stragery at times is extremely unforgiving, but rewarding. Just a great game all round."], ["kernowtom", "User", "10", "This is my favourite game of 2016. Would highly recommend to anyone who loves turn based games. It is very challenging but never too difficult. The game is a good length and is perfect for multiple playthroughs."], ["Incubation", "User", "0", "Buggy as hell, takes an age to load, frustrating gameplay that requires save/loading frequently, stupidly difficult. Play the original much more fun and better gameplay."], ["jasonsalley", "User", "5", "THE LOADING TIMES ARE NO JOKE. At first they aren't so bad but later on we are talking 5 to 10 minutes at the end of a mission. This is not an exaggeration. And believe me when you are sitting there staring at the blue spinning XCOM logo it feels like it's 30 minutes every time. It completely ruined the game for me. It is completely unacceptable, they should be giving out refunds."], ["illphil", "User", "8", "Really good game.  I would give it a solid 8.  It has bugs and really long loading times which can be annoying if you make a big mistake and need to reload a save.  I had never played the previous games so I found it difficult the first time I played because it was encouraging me to push through the main story missions.  You should not do this if you are new to the franchise- look at some of the advice online and focus on powering up and expanding and your team and territory early on or you will get destroyed later."], ["Meeerkat", "User", "6", "THE PROS"], ["Dano1871", "User", "9", "X-com 2 isn't an RTS. It is a turned based strategy game, not real time so I don't see how someone who has played it is writing that down as a review."], ["PS4allday", "User", "9", "Wow, most of the reviewers are right, this games even better that the previous XCOM. Love the satisfaction you get from progressing thru the game. Building your squad, building new facilities, researching for new gear and items and exploring the map for new adventures. Love the deep strategy required from the gamer to get the most reward from the game. My PS4 version did kick me out to main menu once but due to auto-save feature only lost 10 minutes. I have had the game 4 days and already have 20 hours in. Love it!"], ["GlobalNightmare", "User", "4", "Enemy unknown was a fantastic game. Though not being the greatest player of turn-based strategy titles, I made it through to the end, and enjoyed every minute."], ["Bringo69", "User", "8", "I am changing my score from 6 to 8. This is actually a very decent game but you will need to invest time into to understand the mechanisms. Also if you are new to the franchise, you will need to play it on easy."], ["Thrice_Bitten", "User", "8", "Having never played an Xcom game, I wasn’t sure what to expect other than a turn-based action game and I tend to enjoy those. The plot is simple and quickly gets out of the way so that gameplay can take center-stage. Combat proved to be engaging and challenging. Sometimes a scenario would put me in a bad situation, but that felt less like being screwed over and more akin to how real war might throw you a curveball. Some might disagree with me, but I enjoyed that Xcom 2 had a shallow level of customization spread across various frontiers. I never got bogged down trying to choose between a dozen different skills for my soldiers, research paths, weapon upgrades, or facility-builds like some resource management games focus on."], ["marykaymylove", "User", "8", "This is the best top down turn based strategy I have ever played but some elements are holding it back and these are:"], ["Naiv", "User", "6", "Love this game, better than the previous in a lot of respects, however theirs a lot of pop in graphics after a load and those loading times are really long, i have noticed a few glitches and bugs some of which helped me out in the game, but others which just took the realism away, theirs no explination in the game to how to play or how thigns work in detial, apart from tips in a loading screen, where it is too small to even see. the game on the easiest setting feels way too hard, and i cant help but feel that the game is very unbalanced and not at all fair. i feel like theirs not enough explained to me about how the game works, sure i get theirs consequnces and time and resources matter and you can lose out, but to what extreme, and to what detrement to my playthrough, its trial and error and one playthrough of a long ass game that loads slowly just to get the jist is not good enough, especilly when its a game you save and reload constantly which is what ppl do."], ["EEKtheratbat", "User", "8", "As a fan of the original game i really liked that they brought this to console again, The only downside of this game is that the missions feel repetitive so they have to work on that for a sequal and the loading times are just terrible ( even on the pro )."], ["TraceSkipper", "User", "10", "Frustrating, stressful and not enjoyable.  I played it on easy and I raged quit a few times until i had enough and deleted it. Then I spent a day thinking about what I did. Am I too sensitive to handle these types of experiences? What has happen to me?? So I redownloaded it and for better or worse I am all IN! To make an experience difficult  as this is the only way that this game could be made. An Alien race has taken over earth and they are better than you and they know it. So go ahead play it show yourself you can."], ["nismo10", "User", "10", "Lo mejor que ha jugado en años, es un juego dificil, pero gratificante cuando ganas, es al principio dificil de entender, pero una vez entendido pasarás horas y días enteros disfrutando, lo recomiendo ampliamente."], ["Rox22", "User", "9", "I was so happy when I heard this was getting a PS4 port. So was it worth the wait? H3ll yeah!"], ["MT_Tombs", "User", "4", "I love these types of games. I wanted to love this. Seriously. Unfortunately it crashes over and over. The load times are INSANE. Seems \"rookie\" difficulty is actually \"extreme\" difficulty and it's gets worse from there. Progress become nearly impossible and you have to reload old saves to fix stuff. What's the point? Endless frustration?"], ["raccoondaddy", "User", "7", "Many years ago, I sat myself down in front of my brother's TV and watched him played X-COM UFO Defense for the PS1.  There were moments of extreme frustration and every so often a controller would go flying.  All veteran X-COM players know that feeling, but they also know what it feels like to upgrade, adapt and whoop some serious E.T. ass!"], ["nickojeda612", "User", "4", "Really fun game to play but way too difficult and relentless even on the rookie setting. I spent a ton of hours just trying to get by certain levels just to have my character one shotted by a boss or to have them crippled for a whole month. The gameplay is great, the story is interesting, character creation is fun, I enjoyed the time between missions, but the only thing I couldn't stand was how difficult it was to win a battle. NOT TO MENTION THE HIT RATES THAT DIDN'T MAKE ANY SENSE! It was the vipers and their tongues that could go through walls and over buildings that ruined the game for me."], ["pongkrit03", "User", "8", "XCOM 2 is surely a great game, however whether it surpass XCOM1  or not is still uncertain. I am XCOM's veteran and I really have good time with XCOM2. While the battle system is still as satisfying as the same, the management system is changed a lot. Last time, you was in the underground base and intercepted alien UFO with your crafted combated airplane, now your base is within the huge airship, you choose the place to attack instead. It is quite opposite from original and I want to praise the team who come up with this fresh new idea. The graphic looks nice. Difficulty, however, is surely harder than XCOM 1. High cover is not as reliable as it was because most enemies have some skills that can hurt you in some way even you are in cover. Moreover, almost every mission has timer. Therefore, the most effective way to fight in XCOM2 is to go on full aggression, kill enemies before they have chance to retaliate. It is not bad concept but I prefer the old way to have balance in attack and defend. I believe Overwatch got nerfed as well."], ["sandroide", "User", "9", "Finally a nice game with a fair mechanic although not so deep but ok."], ["KAKAOSKOS", "User", "1", "Had fun at first, but then small bugs began to appear before my ironman run save file got deleted. This was right before Fireaxis openly stated that they will not be patching Xcom2 anymore... Fine, so I began a normal run, just to get some value back at least, but now suddenly the playstation 4 console freeze entirely whenever I startup the game.. This is a huge disappointment and wouldn't recommend it to anyone."], ["thatcoolguy222", "User", "9", "Amazing game! I just finished the game on easy (since im a noob), and it was an awesome experience. I really liked the fact that every step you take matters (when fighting, but also when upgrading/building). One wrong decision can really screw you up, which makes the game very interesting and tense. In addition there is tons of stuff to research and build. A wide variety of enemies, and a wide variety of classes for your team. Each class is very different and can really add something unique to your team. I bought the expansion immediately after finishing :). Only reason i did not gave a 10 is because the game on the PS4 has some bugs and frame rate drops which can be kinda annoying on bigger maps. Also the load times can be pretty long. But for the rest it is an awesome game! If you like a mix of strategy and rpg; BUY IT!"], ["kobb", "User", "4", "'Normal ' difficulty is next to unplayable. Meta Game has terrible pacing for events demanding that you react to a contstant stream rather than actually making choices and planning. Massive disappointment."], ["xephnid", "User", "8", "I wanted to like this game, I really did, and I did rate it an 8 despite how much it annoyed me. XCOM 2 contains a whole lot of improvements over the first one. Even more if you also buy War of the Chosen..."], ["Schplatt", "User", "4", "Could have been a great xcom game, but the turn limits ruin nearly every level. If it’s not a turn limit, then it is some enemy destroying some  equipment in a few turn, that you need to advance."], ["MaxsterChief121", "User", "8", "XCOM 2 is a fantastic game, filled with lots of fun as well as pain. Although this game is good, the console ports left a little bit to be desired, from glitches, bad frame rate, long load times, and some low textures here and there. Although these are problems I still didn't think it was enough to bring the game down to far, and I believe that XCOM 2 (PS4) is still a very good game, even with these flaws."], ["siphus007", "User", "8", "It's hard to say why, in XCOM 2, Earth has inexplicably lost the war, when you swear you remember a positive ending sequence for the first game."], ["SrPepe", "User", "9", "Un tremendo juego que hace muy buen honor a la primer entrega, muy divertido. Ansioso por el tercero!"], ["djbarker", "User", "8", "I love and hate this game. The tactics you need to succeed are very deep, but the RNG makes me want to scream! The game is improved in every aspect over Xcom, especially as now enemies don't suddenly teleport onto the map and totally disrupt your plans."], ["MagVinAnc", "User", "6", "These turn based strategy games, i despise almost every single aspect of it. And that's just my opinion. It is so dumb that in a bloody war against aliens, the dudes just stands still and watches them get hit, and the scream. It doesn't make any logical sense."]], "platforms": ["PlayStation 4", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/7/e47c254b6e8be1269a80857ae8ff41ac.jpg"}
{"publisher": "2K Games", "genres": ["Strategy", "Turn-Based", "Tactics"], "rating": "T", "title": "XCOM 2: War of the Chosen", "release_date": "Aug 29, 2017", "avg_score": "94", "summary": "XCOM 2: War of the Chosen adds extensive new content in the fight against ADVENT when additional resistance factions form in order to eliminate the alien threat on Earth. In response, a new enemy, known as the “Chosen,” emerges with one goal: recapture the Commander. This expansion includes new Hero classes to counter the “Chosen”, new enemies, missions, environments and increased depth in strategic gameplay.", "reviews": [["Metro GameCentral", "Critic", "100", "An exceptionally good expansion that adds in a mountain of new content that specifically addresses the few flaws there were with the original."], ["Game Informer", "Critic", "93", "War of the Chosen contains so much new content that it could almost have been called XCOM 3. Every mission dishes out a new enemy, mission type, or environment, which allows the game to remain fresh for several dozen hours. War of the Chosen’s wealth of interwoven systems might overwhelm newcomers, but strategy nerds willing to master the nuances will be treated to one of the most rewarding strategy games in years. I don’t know how Firaxis could make a more complex yet gratifying strategy game, but I can’t wait to see them try."], ["Playstation Universe", "Critic", "90", "War of the Chosen overhauls the already fabulous XCOM 2 and turns it into absolutely essential fare. The introduction of the Chosen, the soldier bonding system, and the photobooth mode, are perfect additions in that they amplify the base game’s best qualities. It’s just a shame the shine is dulled ever so slightly by a bunch of needless technical issues."], ["IGN Italia", "Critic", "90", "An old-school expansion pack, improving the game all-around in ways no simple DLC could have achieved. XCOM 2 was great to begin with, and the new content brings it straight to the Olympus of turn-based strategy games."], ["PSX-Sense.nl", "Critic", "85", "Developers worldwide, pay attention: this is how you do DLC. As innovative as it is addictive, XCOM 2: War of the Chosen not only manages to meet expectations... It thoroughly exceeds them."], ["jdawg135", "User", "2", "This has the potential to be the greatest iteration of XCOM that was ever made. Then proceeds to drop the ball, only it's a bowling ball, right in your lap."], ["shiftyman", "User", "5", "An amazing update with so much content it's unbelievable but totally ruined by bugs and glitches and painfully slow loading screens and some of the worst frame rate drops, but when you see 2K then you know trash isn't far away, shame I couldn't give this a 9/10."], ["dariuszppl", "User", "9", "This is how You make addon. This addon add so much to this game. Too bad to owners of classic game that performance fixes wont apply to You but everyone else will be trully happy with what they got."], ["CccyrussS", "User", "10", "I thought the vanilla XCOM 2 was awesome and I finished it. I bought this expansion and started playing it again and yeah it's better. I don't think I'm going to finish playing it again but this is a top-notch game before and it's even better after. Also I don't have any performance problems at all on the PS4 Pro."], ["wolfkingdom", "User", "9", "outstanding tactical game.the amount of content and customization is a lot.weapon,characters,skill,class and etc.the chosen add new challenges and make the fight more entertaining.the only bug i encounter is save error;reinstall and spare at least 5gb free space on the HDD make the game run smooth.simply one of the best tactical rpg game."], ["Winterpsy", "User", "2", "Absolutely love the game. Stunning new maps, exciting new mission types."], ["Metempsychosis", "User", "3", "Amazing new mechanics, enemies and allies. I would give it a 9 or 10, but it's abysmal performance and glitches ruin the experience."], ["Brutal1ty512", "User", "1", "War of the Chosen is amazing add-on to already nearly perfect turn-based game. And god I’m  trying hard to enjoy it. Game performance is beyond terrible. Very long loading times, framerate drops all the time, graphics glitches, bugs, etc, etc. Studio, responsible for the port, should be disbanded for total lack of competence, along with the genius, who suggested using their services after fail with original XCOM 2. I just hope patches are coming soon."], ["lastevil8462", "User", "0", "that was very awful game I don't understand why xcom2  has been produce very bad action and very bad  when I played this game I laugh that was very awful"], ["rodericrinehart", "User", "8", "Basically XCOM 3, which is a great thing. I've really been enjoying the new mechanics, maps, and chosen. Just like Civilization xpacs, this really updates the entire game and genuinely is almost XCOM 3. It still has some minor performance issues (even on my 1080ti), and the hit percentages thing is even worse now because of the random pop-ins of super-powerful aliens that are nearly impossible to beat."], ["brewistmonk", "User", "0", "Game was somewhat stable for half a campaign then crashed about every other turn. Don't bother getting this. it is not playable to the end as far as I can tell. Will wait to see when it is fixed. Complete garbage for now."], ["LordMOrion", "User", "8", "XCOM2 WOTC is a game I want to give top marks. Firaxis/2K have really gone back to XCOM2 and created a 'special expanded edition' with new features, content and graphical style. The game is addictive, challenging and full of customisation options. It is fair to say that no two playthroughs in the world will be the same. However despite all of its efforts, the game mechanics and engine really struggle. Graphics issues are very common (even running on a PS4 Pro) and although not game-breaking can really break immersion. However the bigger problem lies in the games mechanics where the game will set up scenarios that are literally impossible in missions. For example in one mission where the task is to extract 'VIPs' by defending them from a horde of monsters, the game spawns a recurring villain right next to them. On the first turn he wipes them out, before any of your troops are even close. I have replayed this mission 10-15 times and I cannot find a way to win. What's the point of the mission? If it is to demonstrate the concept of 'impossible' missions, why not at least create risk for your troops? As it is, I can just evac my troops in turn two and fail the mission. OK I fail a mission and some bad stuff happens, but not enough to justify it as a design concept so the reality is that it is just a mistake on the game's part and that is truly disappointing."], ["Smartgamergirl", "User", "7", "Now this is what i call an expansion. This made me replay the game almost completely. You could say its more like XCOM 2 2.0 actually. I did not experience bugs like other players seem to have so i cant take that in account of my review. The new classes are fun and add depth to the game and it helps with the repetitiveness to. I only wish it wasn't so damn expensive."], ["metaldog", "User", "3", "Let's get positives out of the way first. Nice graphics, good atmosphere, believable characters and plot, some game mechanics and above all else, customization."], ["Lasthonestman", "User", "4", "I played the first xcom on PlayStation now over the last week and loved it so much I went out and bought xcom 2. I don't know what happened to the game from then to this, but it's too difficult to be fun. I love chess and grew up on Warcraft 1-3. I'm no stranger to strategy and am pretty good at these types of games. But this game is just dumb luck, and the loading times break the game. People say the first is harder, but some of these enemies in this one are ridiculous. The lizard guy who grabs you through walls.... why? If you liked xcom but thought it was insanely easy and you should've had a timer going to make sure your strategies are rushed then this is the game for you."], ["bobobolas", "User", "7", "As an XCOM fan, I had to buy. I am ashamed to say I had to stop playing. I play it on PS4. I honestly dont care about the graphic issues. Dont really mind at all how goor or bad it looks. However, what I cant stand is the loading times."]], "platforms": ["PlayStation 4", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/5/271351f2c8b37ba09d482d36df58c04f.jpg"}
{"publisher": "10tons Entertainment", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "rating": "E10+", "title": "Xenoraid", "release_date": "Nov  8, 2016", "avg_score": "65", "summary": "Xenoraid is a vertically scrolling shoot'em up with a unique feel driven by a great combination of features.", "reviews": [["PSX-Sense.nl", "Critic", "80", "A nice homage to the classic Shoot 'm Up games from the golden age, that only falters in its repetitive enemy design."], ["GameSpew", "Critic", "80", "Despite a couple of niggles, Xenoraid is an excellent example of how a modern top down spaceship shooter should be done, purposefully going out of its way to do something a little bit different."], ["ZTGD", "Critic", "75", "While it has aspects of a roguelike and the progression of an RPG, it still sticks to its guns as a shooter. It works and works well in that part. The shooting is tight and when learning the proper way to aim, it felt very satisfying. It has a few issues here and there, and while the look is not really fantastic, it offers up a rather fun experience, if even for a few hours."], ["Video Chums", "Critic", "70", "A fresh take on a decades-old formula. Even though it has its problems, it's definitely an enjoyable challenge that any genre enthusiast will be happy to add to their library."], ["Push Square", "Critic", "60", "Xenoraid does do a lot to try and stand apart from the deluge of similar games out there, and it should be commended for that effort. But with its lack of refinement, progression resetting, and fairly bland overall presentation, it's unlikely we'll be looking back on this one a year from now."], ["Everyeye.it", "Critic", "60", "A traditional vertical shooter with a single good idea but many gameplay flaws, restrained by an anonymous and unattractive look."], ["Twinfinite", "Critic", "60", "When there are games out there like Rez and Geometry Wars that reinvent that chassis, it’s difficult to play something like Xenoraid and feel… well, much at all."], ["PlayStation Country", "Critic", "60", "Xenoraid hides some good gameplay deep in an initially weak-looking package and it hides it well but fans of the genre who want some cheap, but different, shoot ’em up action may well end up enjoying the game."], ["GameOver.gr", "Critic", "50", "Xenoraid is yet another game by 10tons that you’ll have fun playing it, but also looks poor and empty in the final sum. There is definitely talent behind that studio, but they should stop choosing quantity over quality."], ["Impulsegamer", "Critic", "50", "Xenoraid is competently built but lacks any real reason to actually compel you to play it. The gameplay loop quickly becomes monotonous and, aside from quick bursts here and there whilst waiting for a download, I can’t see many gamers putting much time into conquering the alien attackers."]], "platforms": ["PlayStation 4", "iPhone/iPad", "PC", "PlayStation Vita", "Switch", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/0/587bf6c3cbfff6fc1af3141508dc8ca6.jpg"}
{"publisher": "Renegade Kid", "genres": ["Action", "Platformer", "2D"], "rating": "E", "title": "Xeodrifter", "release_date": "Sep  1, 2015", "avg_score": "77", "summary": "Drifting through the stars. Xeodrifter is the story of an interstellar drifter traveling the stars on a simple mission of exploration. We join our nomad as he embarks on the investigation of a small cluster of four planets in the omega sector, after a collision with a rogue asteroid damaged his warp core. Blast your way through alien landscapes, seek out valuable secrets, and defeat ancient guardians to unlock powers from a legendary supreme culture in this exciting journey of mystery and adventure.", "reviews": [["CGMagazine", "Critic", "95", "Its retro inspired aesthetic and difficulty make it a blast for anyone who grew up playing Metroid, and its straight-up fun factor make it a great time for anyone else."], ["PSNStores", "Critic", "90", "There are some genuinely cool skills given and the later one I wish could have been used a little more before finishing the game. I’d rather not spoil any of them, because one of the early skills is truly cool and really helps give this game a single unique aspect. Instead of hearing me describe them, go take a few hours and collect them, you’ll love the run ( and may think about playing through it again right after)."], ["Playstation Universe", "Critic", "90", "Renegade Kid took to Xeodrifter with the retro scene in heart, and the end result reflects that. The charm of exploring each planet far outweigh that it’s all over a little too quickly."], ["Gamers' Temple", "Critic", "88", "Retro 8-bit platforming at its best."], ["The Digital Fix", "Critic", "80", "Renegade Kid’s throwback to yesteryear in both style and gameplay make for a rather difficult, but ultimately rewarding game that perfectly captures the tone of pulp sci-fi."], ["Hardcore Gamer", "Critic", "80", "Anyone who enjoys Metroidvania gameplay will enjoy this; even if its repetitious boss battles stand out as a glaring weakness, the core game is a blast to play and surprisingly diverse as well."], ["GameCrate", "Critic", "75", "While Xeodrifter could've benefitted from more levels and a bit more boss diversity (are these guys related?), it's still an enjoyable Metroid clone that fans of the genre will certainly want to venture through. Here's hoping that, if we get a sequel, it's bigger and better."], ["4Players.de", "Critic", "72", "Xeodrifter is pure minimalism: A steady running pace and a unchangable jump height is enough to take you on a charming, albeit short journey."], ["COGconnected", "Critic", "72", "It’s an homage to a game that I absolutely love, and Renegade Kid did some truly commendable things here. On the other hand, I didn’t get much excitement from exploring its worlds"], ["Push Square", "Critic", "70", "A five month development cycle has resulted in a focussed and succinct sci-fi action adventure, which sets a fast pace to flow through its bright pixel art presentation, and waft along to its atmospheric chiptunes."], ["Hobby Consolas", "Critic", "70", "A fun (but very short) metroidvania -like experiencie, now on PS4 and PS Vita."], ["GamingTrend", "Critic", "70", "While the game suffers from a handful of glitches, the overall design and outcome of Xeodrifter is well worth a look for anyone in the market for an old-school experience in a brand new package."], ["ZTGD", "Critic", "70", "So long as the player expects nothing more from Xeodrifter than what it is very upfront about providing in terms of content, retro-aesthetic and gameplay, then it will be hard to feel disappointed after playing this game. It’s not perfect, but there is a sincerity here that is likely to charm even the most skeptical of gamers."], ["DarkStation", "Critic", "60", "While not pushing the boundaries of the genre in any significant way, Xeodrifter is a well made game which is sometimes all we need."], ["dubloon7", "User", "7", "Xeodrifter relishes on the 1980's retro gaming style. It is a highly enjoyable game for the roughly few hours it will take to play through to completion. Traversing each and every world like a metroidvania with a number of hidden areas and upgrade items is fun to explore but becomes repetitive if you want to 100% with full health and full weapon upgrade by the end of the game."], ["NickyLeGentil", "User", "7", "At first sight, Xeodrifter seemed pretty lame. But here's the deal, with it's pixel-art style that clearly remind a minimalist metroid and some well inspired mechanics, the game is a really good surprise. In fact, the game look like metroid in the way you play it too. You chose one of the four planet to start your journey and you explore. And BAM! your first boss, then an upgrade. And a secret path. And you're stuck in the game and don't want to quit it."], ["leventguller", "User", "1", "I like indies. I do not have any problem with indies. In fact, I want to encourage indie game developers by buying their games. Indie games are a huge opportunity to give a chance to fresh ideas without the support of mainstream game developer companies that controls financial power in gaming industry."], ["Dal_ReviewedDat", "User", "1", "PS+ September 2015"], ["fandango89", "User", "3", "It's like megaman....if it used terrible overly pixelated graphics that make it hard to distinguish anything, if you fought the same 3 guys the entire level (some requiring 15 shots to kill), had no saves during entire planets, gave you no health at all during the level, and forced you to replay entire 10 min segments due to lack of saves and not a single enemy dropping health......so a megaman that does nothing right in game design."], ["drlowdon", "User", "4", "A 2d platformer/shooter that is so old school you can’t even fire at angles Xeodrifter isn't completely unplayable but it does absolutely nothing that hasn't been done (better) thousands of times in games dating all the way back to the late 80’s. I don’t expect these indie titles to have all the bells and whistles of bigger budget games but if they’re not even going to try to do something a little different they’re kind of pointless."], ["Tryntius", "User", "10", "Xeodrifter gave me a polished 2-D experience that reminded me of some of my childhood favorites. It was a pleasantly short game that I would recommend to anyone who enjoyed Megaman or Metroid as found on the NES."], ["Pureray", "User", "6", "Xeodrifter must've really wanted to get old school in terms of visuals and controls. There are only 4 worlds that you can explore in, but you wouldn't be able to progress any further without a certain upgrade or equipment that would allow for you to travel deeper. You could only get them by defeating bosses that all end up being the same creature, just being more tanky and at a different color each time you face it. This game requires a lot of backtracking, remembering what each world had what and where that location was that you could probably now open."], ["TSapper", "User", "1", "I'm trying to give 'indie' games more chances, especially because of the glaring lack of available PS4 AAA exclusives and even fewer I want to play."], ["Melonpanic", "User", "9", "I tend to be a bit skeptical about the free PS+ games and I went into this with my guard up, but before long it had its hooks in me and I was grinning at the screen. Classic \"metroidvania\" game play, the retro art and sound design grew on me too. Real gem and well worth playing."], ["pauloredline", "User", "2", "This game he has a cool nostalgia look like platform games like Mega Man, but the nostalgia ends there, the game is very limited and nauseating and even having 8-bit retro graphics, is very ugly games like Shovel Knight and Gun Galvolt are much better."], ["Sparkticle", "User", "6", "This game is very small both in content and in vision. If you've played Mutant Mudds or Metroid or even both, then this game has absolutely nothing new for you. You verse the same boss over and over with slight upgrades which will make for slightly interesting battles, but other than that, there really isn't nothing in this game. Not even the artstyle holds up."], ["JudasKiss12", "User", "8", "An 8 feels right for this one. It's an old-school Metroid-inspired type of game, where you work your way through a handful of levels that you can freely travel to, and collect powerups along the way that give you new abilities. These powerups are required to reach some of the later, more hidden areas of each level, similar to the type of retreading you'd do in a Metroid game. It's very, very short (took me 5 hours to finish) and a bit easy, but for what it is it's a very fun, charming, and enjoyable experience. Just don't expect a 20+ hour game like Metroid Prime."], ["Nel", "User", "6", "Xeodrifter has some neak perks, and is an enjoyable  game for old school gamers. The game  is fairly short, but if done the completist way, it will take sometime."], ["seriimac", "User", "8", "When it came for free in PS+, I played 10 minutes and drop it. I though it was just too hard and elaborated."], ["Tailynd", "User", "7", "Fun easy game. A  throw back to retro NES games. I had a good time 100% this game and getting all the trophy. I love collecting all the upgrades and becoming more powerful.  Just wish it was a little bit longer."], ["KayVen17", "User", "5", "Deutsche Review - Kritik"]], "platforms": ["PlayStation 4", "3DS", "PC", "PlayStation 3", "PlayStation Vita", "Switch", "Wii U"], "image_url": "http://static.metacritic.com/images/products/games/5/9859d3bf7cb19aa233401080ea61732e.jpg"}
