{"publisher": "Sega", "genres": ["Action Adventure", "Open-World"], "rating": "M", "title": "Yakuza 0", "release_date": "Jan 24, 2017", "avg_score": "85", "summary": "The story follows Kazuma Kiryu as a junior yakuza member who finds himself in a heap of trouble when a simple debt collection goes upside down and his mark ends up murdered. Meanwhile, Goro Majima is living a \"normal\" life as the proprieter of a cabaret club, but is doing whatever it takes to rejoin the yakuza. What that entails isn't exactly easy.", "reviews": [["LEVEL (Czech Republic)", "Critic", "100", "Mood, pathos, emotion, humor ... and helluva fights. This is a combination that makes Yakuza zero the one of the most entertaining game in the whole series. For lovers of Japan Y0 is a must-have. [Issue#272]"], ["Digitally Downloaded", "Critic", "100", "For all its humour, its intelligent noirish thriller narrative, and the sheer amount of stuff to do, Yakuza’s real strength forever remains in the little details that it gets right about its representation of Japanese cities... Every Yakuza game to date has been a genuine classic, and Yakuza 0 continues the fine form for a series of JRPGs that is right up there with the best of the genre. It’s completely essential."], ["GameCritics", "Critic", "95", "Yakuza 0 is a magnificent achievement that should be experienced by anyone interested in lecturing people on the importance of money, then blowing ten billion yen on a horrifically tacky golden statue of themselves. Or those curious about winning a chicken in a bowling competition, then installing it as the manager overseeing some of the most financially lucrative real estate holdings in Tokyo. Or those inclined to beat fifty knife-wielding thugs to a pulp in a back alley before heading off for takeaway and wasting the night playing Outrun. Or those wondering why that man in the convenience store is walking around in his underpants, and being unafraid to forge an unexpected friendship with him."], ["GameCritics", "Critic", "95", "Yakuza 0 is a magnificent achievement that should be experienced by anyone interested in lecturing people on the importance of money, then blowing ten billion yen on a horrifically tacky golden statue of themselves. Or those curious about winning a chicken in a bowling competition, then installing it as the manager overseeing some of the most financially lucrative real estate holdings in Tokyo. Or those inclined to beat fifty knife-wielding thugs to a pulp in a back alley before heading off for takeaway and wasting the night playing Outrun. Or those wondering why that man in the convenience store is walking around in his underpants, and being unafraid to forge an unexpected friendship with him."], ["CD-Action", "Critic", "95", "Yakuza 0 is a diamond that no gamer should ignore irrespective of whether they’re drawn to Japanese games or not. Grand Theft Auto has a much larger budget, but Yakuza has a much bigger heart. [03/2017, p.50]"], ["GameGrin", "Critic", "95", "If there is one game you decide to take a chance on this year, please let it be Yakuza 0 - a game that is as fun and intelligent as it is silly and violent."], ["Playstation Universe", "Critic", "95", "A wondrous melting pot of Japanese cultural excess distilled into a relentlessly compelling synergy of RPG and action elements, Yakuza 0 arguably represents the consummate entry point for newcomers to the series. Without a doubt, Yakuza 0 is a masterpiece and the first must-have title of the year."], ["The Jimquisition", "Critic", "95", "If Yakuza‘s always been this magnificent, I’ve got a lot of catching up to do and a lot of “friends” to chew out for not recommending it to me sooner."], ["COGconnected", "Critic", "95", "With such a dynamic and interactive interface, Yakuza 0 will keep you coming back for more and even catch you off guard when you least expect. It’s a game everyone should experience or at least try out."], ["Wccftech", "Critic", "94", "Whether you’re visiting Kamurocho for business or pleasure, be prepared to sink another eighty hours into a crime epic that only Sega can deliver."], ["InsideGamer.nl", "Critic", "93", "Yakuza 0 shows how unique Yakuza actually is. Drama and humor come together in a setting filled with violent street fights. We all know the concept, but Yakuza 0 takes it to perfection."], ["Game Informer", "Critic", "93", "Yakuza 0 tries a ridiculous amount of things, and I’ll be damned if it doesn’t almost always succeed in its own weird way. The Yakuza series has established a cult following in the West, but it hasn’t managed to break through to the mainstream. If there’s any justice in this world, that’s about to change."], ["Meristation", "Critic", "92", "The best entry so far of the saga released in Europe, with a brilliant plot, a breathtaking atmosphere that will makes us feel like we're back in the 80's, and solid and improved gameplay (including new fighting styles, and steal gameplay sections). Only the fact that it comes only in English and its roots as a PS3 game can be mentioned as issues."], ["Hobby Consolas", "Critic", "91", "Yakuza is one of the most beloved sagas by a legion of fans who appreciate the good work of SEGA in terms of atmosphere, gameplay and narrative. Yakuza 0 is the best of the saga and one of the greatest games on PS4."], ["PLAY! Zine", "Critic", "90", "Yakuza Zero is a fantastic game. Spectacular main story combined with great diversity of sub-stories  and solid gameplay create a rather unique game."], ["Games Master UK", "Critic", "90", "A fantastically bonkers open-world gem that finally opens up the magic of the series to everyone. [March 2017, p.64]"], ["games(TM)", "Critic", "90", "One of the most detailed open worlds to date. [Issue#184, p.83]"], ["Playstation Official Magazine UK", "Critic", "90", "With a wonderful story that actually makes sense to newcomers to the series, brilliantly varied fighting and a world packed with things to do, this is the best Yakuza yet. [March 2017, p.90]"], ["DarkStation", "Critic", "90", "Thanks to its outstanding writing, acting, cinematography and animation, Yakuza 0 tells an effective and surprisingly nuanced story of one man and his early journey through the complex world of organized crime. Although it marginalizes women to the role of cliche props and some of the dialogue -- in translation, at least -- rings a little hollow, Yakuza 0 is still a great introduction to both the series and its long-running characters. With an almost impossibly large number of things to do and combat that is brutal and entertaining throughout, Yakuza 0 has to rank as one of the most memorable and successful entries in the franchise."], ["GameOver.gr", "Critic", "90", "An excellent, unique, packed with content and replayability game, that will keep you hooked for hours upon hours."], ["PSX-Sense.nl", "Critic", "90", "SEGA tops itself with Yakuza 0, a highlight of an already beloved franchise that manages to succeed in every single way."], ["The Digital Fix", "Critic", "90", "It’s a truly wonderful trick that Yakuza 0 plays, and rather than work out how it does it, just sit back and let this video gaming alchemy entertain you."], ["DualShockers", "Critic", "90", "If there is a game that fully embodies and actually easily overcomes the definition of “complete package,” that’s Yakuza 0. It’s a rich, colorful and engrossing experience that I can wholeheartedly recommend to anyone who loves the genre, Japanese culture, or simply a very, very good story with some of the best and most genuinely likable characters you’ll ever encounter in gaming."], ["Game Over Online", "Critic", "90", "Yakuza 0 is everything fans of the series want it to be. It contains its trademark style, enhanced graphics, smooth framerate and an excellent story. By design, it is also a throwback to older gameplay styles and tropes and is not only proud of the fact, it’s downright smug about it. It is a game to be enjoyed, savored and explored, warts and all, for as many hours as possible. While not perfect, it is definitely an instant classic and worthy of your time and money (which you can always earn back by stomping on street toughs in Kamurocho)."], ["Arcade Sushi", "Critic", "90", "With Yakuza 0, Sega's managed to give the long-running series a shot in the arm, re-invigorating it for longtime players, and making it accessible to anyone that was turned off by jumping in so late in the series before."], ["Worth Playing", "Critic", "90", "Yakuza 0 is easily one of the highlights of the PlayStation 4's lineup. An engaging story mixed with zany humor and over-the-top brawler gameplay, the title hits all the marks. It has its flaws, including a potential overreliance on non-brawling minigames, but they're not enough to drag down the game. Fans of the franchise should be delighted, and newcomers should find this title as a great place to dive in. The plot, characters and setting are instantly accessible, and the gameplay holds up extremely well."], ["RPGamer", "Critic", "90", "While I completed Yakuza 0 in roughly thirty hours, I didn't feel like I had done everything the game had to offer. This is a game that is completely bursting with content just begging to be uncovered and explored. With each successive Yakuza game, it's clear that this series is growing in a variety of ways, and it makes my heart so happy. Yakuza 0 has risen to the top of my favourite games of all time, easily pushing past Yakuza 2, which had held the spot as my favourite Yakuza for many years. Whether you are a newcomer to the series or a veteran of it, Yakuza 0 offers so much to gamers with its spellbinding storytelling and plethora of content. Enchanting until the last chapter, Yakuza 0 is the pinnacle of the series and it looks to be difficult to unseat."], ["ZTGD", "Critic", "90", "Fans of the series will likely love it, but for newcomers this is the best time to jump in. I am happy to have finally taken the plunge, and over time I can see myself returning to the series, especially with two more games already scheduled to hit PS4 soon. There is plenty here to enjoy, and I guarantee there is nothing else quite like Yakuza."], ["Atomix", "Critic", "90", "Yakuza 0 is, simply put, the best game of the series and one of the best examples of how a franchise should evolve through the years. It offers an incredible story, fantastic and fresh gameplay mechanics, a rich and lively world plagued with ton of things to do and enjoy. You cannot pass this one by any means."], ["Trusted Reviews", "Critic", "90", "Despite the shallowness of the combat, you’re always being pulled towards something new, and you can’t help but be carried along by it. Whenever you tire of one thing, the next distraction or big set-piece is just a few minutes away – just be prepared to be offered pocket tissues, have a few scraps, and become someone’s agony aunt."], ["CGMagazine", "Critic", "90", "A novel twist on familiar gameplay elements, Yakuza Zero once again delivers a unique blend of real-world immersion, humanistic storytelling, and some of the best action gameplay on the market."], ["GameSpew", "Critic", "90", "To play Yakuza 0 is to deeply fall in love with its characters and world; a challenge that many games try to conquer, but only a handful ever manage to actually achieve."], ["PSNStores", "Critic", "90", "Yakuza 0’s story is full of twists and turns that’ll keep you guessing and make it exceedingly hard to put the controller down. The final few hours of this game are absolutely phenomenal. I’m not sure words can properly do it justice, there’s plenty of major events that cause you to shout out to no one in particular in the middle of the night just from pure excitement."], ["RPG Site", "Critic", "90", "Yakuza 0 is a game that demands the audience's full attention, and it’ll get that whether it’s through a heart-stopping revelation or a quiet moment that leaves the player with misty eyes. If a compelling narrative is what you look for in a videogame, then you’d best get ready for a night on the town with the Tojo clan."], ["Digital Chumps", "Critic", "90", "Even after a dozen years and seven (or eleven) games, Yakuza 0 is an impressive and easy invitation to its namesake's adrenalized world."], ["GamingTrend", "Critic", "90", "Yakuza 0 is a great entry into the series, with plenty for old fans and newcomers alike.  Its story is cheesy and melodramatic at times, and the graphics are a bit outdated, but between a nearly perfect melee combat system and a city bursting at the seams with activity, anyone looking for a sandbox crime game should definitely pick this one up."], ["IGN Italia", "Critic", "90", "The second best Yakuza game ever after Yakuza 3 and a breathtaking mix of mini-games, fighting, mob plots and Japanese craziness."], ["Destructoid", "Critic", "90", "It features all of the best aspects of the series with very little of the negatives, making for a game that I’ll probably still be digging through by the time Kiwami releases over here."], ["We Got This Covered", "Critic", "90", "While it still suffers from the same flaws as its predecessors, Yakuza 0 is a great reminder why Sega's series is so special."], ["Hardcore Gamer", "Critic", "90", "Yakuza fans are in for a massive treat with Yakuza 0."], ["Merlin'in Kazanı (Turkey)", "Critic", "88", "Yakuza 0 is a great point to enter the series. It has a lot of content waiting to be explored and while at its fullest, it manages to tell a great, dark and gritty story with some really charismatic characters."], ["Gamers' Temple", "Critic", "88", "You'll certainly get your money's worth out of the game in terms of gameplay, and if, like me, you've never played a Yakuza game before, Yakuza 0 is an excellent opportunity to see what you've been missing."], ["Everyeye.it", "Critic", "88", "Yakuza 0 is probably the best episode of the series. A gaming experience which you should try once in your lifetime. A great crime-story which will not disappoint you."], ["Multiplayer.it", "Critic", "88", "Yakuza 0 is a terrific game, packed with a simple structure but extremely rich in content. The campaign tells a long, deep, violent story, with two charismatic characters and a whole lot of enemies to fight."], ["The Games Machine", "Critic", "88", "Yakuza 0 is the perfect prologue to an underestimated - at least here in Europe - yet rich and complex saga. The story is really intriguing, albeit dedicated to hardcore Japan fans, with its dialogues in Japanese (English-subbed). The gameplay is genuinely, and truly, \"Japanese\". If you love Japan, this is a game you shouldn't miss."], ["Critical Hit", "Critic", "85", "As an origin story, Yakuza 0 is a perfect starting point for series newcomers, and a wonderful look in to the past for those already familiar with Yakuza. While its combat can become a slog, soaking up the sights and sounds of a 1980s Tokyo criminal underground is enchanting."], ["XGN", "Critic", "85", "Yakuza 0 has so much to offer, even though some aspects are a bit outdated. Look past this and you'll see a great game with a perfect combination of action, storytelling and RPG elements."], ["Impulsegamer", "Critic", "85", "Yakuza 0 starts 2017 with a very enjoyable gaming experience that takes elements from a variety of genres and then blends them together like some Iron Chef of gaming!"], ["Vandal", "Critic", "85", "Yakuza 0 is one of the best episodes of the series, and a great choice if you haven't played it before. It polishes the gameplay and delivers a great adventure you rarely find in other RPGs."], ["GRYOnline.pl", "Critic", "85", "Yakuza 0 is not for everybody but it the perfect game to introduce you to this series. Over the years lots of unique elements became better and better and Y0 is a prequel - that means an easier transition. There are some technical issues, and some cut-scenes could be shorter but overall this crazy, colorful adventure is worth your time."], ["3DJuegos", "Critic", "85", "Yakuza 0 is one of the best games in the series so far. It goes back to the origins, leaving behind the high number of locations and characters, but thanks to it is also more focused in the plot and the development of deep and complex mechanics around the money, the great protagonist of this new entry."], ["Video Chums", "Critic", "85", "Yakuza 0 may not have the best visuals or the biggest game world but its outstanding gameplay and amount of content make it a must-buy prequel for fans of the series."], ["PlayStation LifeStyle", "Critic", "85", "Yakuza 0 feels a bit like an anime that also happens to be an action/fighting game. The only problem is that the fighting feels dated, though the environmental options and multiple fighting styles to master help to spice things up a little. A genuinely entertaining and captivating story lurks in the seedy underworld of Tokyo, where a miniscule empty lot somehow sparks a massive conflict."], ["God is a Geek", "Critic", "85", "If you’re a fan of the series, you’re going to want to play this--Yakuza 0 encapsulates the zaniness of Japanese culture with spectacular side missions, and is aided by it’s own satisfying combat and recreational activities."], ["IGN", "Critic", "85", "While its melee combat may lag slightly behind modern genre standards, Yakuza 0 still hits far more than it misses and is a big, bold and bruising tour through the Japanese underworld."], ["New Game Network", "Critic", "83", "Yakuza 0 is a fantastic journey through the seedy underbelly of the '80s in Japan. The game’s strong narrative core, filled with memorable characters, is the perfect driving force between engaging combat, memorable sidequests, and time-devouring minigames."], ["GameCrate", "Critic", "83", "There’s a lot to do in Yakuza 0, but it may take you some time to get through the game. While the story is very compelling, there are so many side activities that are equally entertaining, it may be difficult to pull yourself away to continue with the main story. If you have a history with the Yakuza series, there are even moments when you see where these characters began that will make you feel even closer to the grouping of polygons on your TV screen. Almost everything about Yakuza 0 is well-done and exceeds expectations."], ["LaPS4", "Critic", "83", "Almost two years have passed since Yakuza 0's original launch and it has its impact on visuals. However, it is leveraged with a superb plot, addictive gameplay mechanics and the usual and humongous array of minigames at our grasp, in order to fill around 60 or 70 hours of play."], ["Playstation Official Magazine Australia", "Critic", "80", "Newcomers, Yakuza 0 is the perfect entry point, and is therefore worth paying the full pinky price (RRP). Veterans will be captivated by these origin stories and a ridiculous amount of minigames. [March 2016, p74]"], ["Edge Magazine", "Critic", "80", "Such steps forward may seem at odds with the time period, but that late-'80s setting is put to brilliant use in the story. [March 2017, p.98]"], ["PlayStation Country", "Critic", "80", "The best way I can describe Yakuza 0 is that it is a jack of all trades. None of the particular aspects of the game could be considered special in their own right. In a lot of cases the various aspects of the game shouldn’t even gel together. However, the mastery on show is just how well that Sega have managed to assemble all of these parts to make an excellent video game. It is a well realised drama, incredibly diverse and has plenty of fun things to do. You can’t ask for more than that really."], ["DarkZero", "Critic", "80", "Yakuza 0 is a strong testament to the level of detail and the amount of content the series is known for. The writing is equal parts a compelling crime thriller and a hilarious spoof of Japanese culture, the combat is simplistic but unobtrusive with some satisfying hard hits, and the numerous amounts of side activities, unlockables, mini-games and extra modes will keep players satisfied and busy before the next game rolls around."], ["Gameblog.fr", "Critic", "80", "Even though the Yakuza series is more than 10 years old, Yakuza 0 feels like a fresh new start on PS4. The fact that the story takes place before Yakuza 1 makes Yakuza 0 the perfect starting point for new gamers. The game takes place in an incredible recreation of Japan near the end of its \"Bubble Economy\" and makes gamers feel as if they are in Japan during that time. The game manages to be both very serious and incredibly funny and, cherry on the cake, gives players a ton of things to do. Yakuza 0 is truly one of the better episodes of the series."], ["Eurogamer Poland", "Critic", "80", "Yakuza 0 is a specific game that demands turning a blind eye on some elements, like mediocre graphics, technical shortcomings, long cutscenes and slow story. If we can accept these issues, Yakuza offers a rich world and hours upon hours of gameplay. Seems like the best moment to check out this Japanese fenomen."], ["NZGamer", "Critic", "80", "If you can endure the clunky combat that pervades much it – and if I can, you certainly can too – you’ll find a wonderful game in Yakuza 0. It tells a captivating story in its own right, and it’s also a perfect jumping-on point for the series, especially with Yakuza Kiwami, a remake of the first game, due out later this year. If nothing else, do it for the karaoke, hostess clubs, and the chance to make a difference in the life of an up-and-coming dominatrix."], ["Metro GameCentral", "Critic", "80", "The most entertaining Yakuza game so far, that’s part gangster epic and part surreal Japanese nightlife simulator."], ["Easy Allies", "Critic", "80", "Since its debut in 2006, Yakuza has been relegated to a niche audience in the West, which is more heartbreaking than ever after finishing Yakuza 0. It's a game that offers an abundance of varied activities and memorable stories. Even with a lack of difficulty and a few minor pacing hiccups, Yakuza 0 demonstrably proves that this long-running series has so much bite left in it."], ["TheSixthAxis", "Critic", "80", "Yakuza 0 is not only an achievement in video game storytelling, but it’s the best this franchise has ever felt, looked, and played."], ["Polygon", "Critic", "80", "The problem with tough guy heroes isn't that they're done too often, it's that they're so rarely done well. In that regard, Yakuza 0 felt like a revelation — even in spite of some significant shortcomings. It keeps a consistent, strong pace, and it doesn’t meander through side streets you’d rather avoid. But more importantly, it’s just so damned cool. It's vicious and grand, but bears its heart and soul. It has fun without completely sacrificing its gravitas."], ["SpazioGames", "Critic", "80", "It's easy to recommend Yakuza Zero to all fans of the series, as it tells a brilliant origin story that shows unseen sides of both the Kazuma and Majima personalities, and, at the same time, it's easy to dismiss this prequel as \"another Yakuza game\" for those whio never got to like the series. All in all, it's a solid and well written debut on PS4."], ["IGN Spain", "Critic", "80", "Yakuza 0 is the perfect game for those who never played any Yakuza to enter in this epileptic and violent world of madness made in Takashi Miike's best dreams."], ["GamesRadar+", "Critic", "80", "While a bit disappointing on the mini-game front, Yakuza 0 remains as strange and charming as ever, with the best story and combat the series has seen in years."], ["GameSpot", "Critic", "80", "By weaving a complex web of relationships and alliances, Zero's story grows ever more fascinating, proving to be equal parts surprising and exciting from beginning to end."], ["Push Square", "Critic", "80", "At this point, the property's trademark formula is seriously starting to wear thin, but when it comes down to it, there's nothing quite like Yakuza 0. It combines unapologetically mature themes and violence with brilliantly dumb minigames and hysterical side quests, resulting in a thoroughly memorable experience. Bolstered by a gripping story that's packed with great characters, fans of Japanese games or even Japanese culture owe it to themselves to give this a prequel a shot. Yakuza 0 is fantastic place to start a love affair with Kamurocho's finest, and what's more, it's one of the best entries in the series to date."], ["Game World Navigator Magazine", "Critic", "76", "“As is always has been” is a major problem for the series. Just to list a few issues that it lovingly keeps since PS2 era: unwieldy save system, clumsy camera, a separate loading screen for every shop and venue even though the “open world” is so small they could’ve been easily integrated into it, and, of course, abrupt transitions from lovingly rendered cutscenes to plain text dumps. Still, it you can stomach all that, Yakuza is worth a look due to its uniqueness. [Issue#217, p.78]"], ["Gaming Age", "Critic", "75", "This is a game from the '80s, for the '80s and should be enjoyed as such."], ["4Players.de", "Critic", "74", "Slight changes in the fighting system, and slightly rearranged visuals: Even 30 years in the past Yaukza is the game it always was. The concept is still cool – but feels slightly overused."], ["Riot Pixels", "Critic", "70", "Yakuza 0 is a compact slice of modern Japan with one difference that in real Tokyo and Osaka they actually have street traffic."], ["Gamer.no", "Critic", "70", "Yakuza 0 offers a great story and loads of side activities, but dated mechanics keeps it from being considered a true stroke of genius."], ["M3", "Critic", "70", "In all its weirdness Yakuza 0 is as charming as the series ever has been. It isn't a game for everyone, but for those who fall for this there will be tons of stuff to do, wonderful settings to visit and well-written characters to meet."], ["Attack of the Fanboy", "Critic", "70", "Beyond the era and location-specific authenticity strived for and achieved in this title, both the dated combat and graphics leave something to be desired."], ["Eurogamer Italy", "Critic", "70", "Yakuza 0 is one of the best entries in the entire series. Unfortunately Nagoshi's work needs a strong technical upgrade to bring Yakuza series to the next level and to be suitable to a broader market."], ["JeuxActu", "Critic", "70", "The best of Yakuza Zero is actually not the part you're playing, but the part you're watching. It can seem harsh, but that's a feeling you can't deny as the former is far from being as good as the latter. It's still a great storyline though and the game developers have the talent to make it alive."], ["Stevivor", "Critic", "65", "I’d never played a Yakuza game before this one, much to the dismay of certain friends. While it’s definitely a daunting franchise to enter into, Yakuza 0 is simultaneously the best and worst starting point for newcomers like myself."], ["Twinfinite", "Critic", "60", "It has the challenging combat and wacky humor that you’d expect, and the story is top-notch. Also, who can pass up on a chance to see Majima while he’s still relatively sane? If you’ve never tried one, it may be a bit weird to you at first, but if you’re willing to wade through it all, there’s an enjoyable experience to be had."], ["EGM", "Critic", "50", "Yakuza 0 takes it back to where it all began, but a mildly interesting setting and story don’t quite make up for the game’s more tedious elements."], ["fungz84", "User", "9", "Pure fun and nice tats.  It's like playing a traditional Yakuza movie film with you in it as the main character.  I bought this game on day 1 with Resident Evil 7 and Tales of Berseria, and I am always conflicted as to which to spend more time on.  So fun and funny at times with a good story (one of the few games where I don't pause to \"skip\" the story scene.)"], ["Jus7ice", "User", "10", "It hasn't been a long time since Yakuza 5 released on NA. And Yakuza 0 improves it in a lot of ways. Nagoshi-san is one of those developers that knows how to improve a franchise over the years."], ["fantasticknight", "User", "10", "Yakuza - this is one of the best series of games for all the existence of the gaming industry! This game is simply gorgeous. Not nearly turned bad, but on the contrary has become more colorful and better."], ["BrandonTjon", "User", "10", "Bringing back the fun in video games"], ["kojishindo", "User", "10", "One of the best games in the \"Yakuza\" series."], ["GamingNinja", "User", "9", "There are some dissapointing and tedious moments when playing Yakuza Zero..."], ["sorawild", "User", "9", "There's a reason why even in Japan Yakuza 0 is considered the best game in the series by far. Yakuza 0 improves on all the gameplay mechanics from the previous games and has by far the best story out of all of the games in this franchise. And since this game is a prequel to the series it is also the best starting point for new comers. The only issue I have with this game is that it starts off very slow both story and combat wise, but once the story starts rolling and you unlock new moves it becomes a blast."], ["ANITEC20", "User", "9", "Great flashback Yakuza game, Glad to see this game on the PS4. I've played others series to understand this game. But I gave it a 9 because of the same repetitive enemy spawning and same fighting. I'd pay $60 if you like the series."], ["ripperroo9977", "User", "10", "My first game in the Yakuza series, and fortunately one that is basically the first in the canon. Setting up the characters and the overall story for the other games which are supposedly being re-mastered for PS4 (and possibly PC?). This game was absolutely exceptional. It was a mix of 80's nostalgia, coupled with old school beat 'em up gameplay, and an edgy story which borders on ridiculous and painfully real at times. The game is entirely in Japanese, so if you don't like reading subtitles this might not be for you. I didn't mind, though, due to the exceptional voice acting and translation work. Despite being a fictitious rendering of the Yakuza, I found myself doing a lot of reading about the real-life Yakuza after playing this game and found that the game doesn't hit too far away from home in that instance. I'm definitely looking forward to playing the other games in the series."], ["oldschoolgamer7", "User", "8", "This Yakuza is well paced and has a great story to follow once you get in to it, as always with this franchise there are tons of mini games to get stuck in to some of which I spent hours on just by them selves. its set in the 80s so its a nice change from the normal Yakuza games as well as is probably one of the better written Yakuza games on the story side of things. That said there is only really two locations and after Yakuza 5 I was expecting a larger and more diverse game."], ["Akuaku17", "User", "10", "Great game. For any newcomers to the Yakuza series on the fence about trying this game out, go for it as this is the most fun i have had with a game in years and you will not at all regret it."], ["Dollface45", "User", "10", "The Japanese renaissance continues. Along with Persona 5, Nier: Automata and Nioh, Yakuza 0 is another fantastic purely one of a kind experience from Japan. It is a true job well done from Sega. There may not be anything completely new here if you've played other games in the series, but even judged on it's own or as a prequel. Yakuza 0 is bonkers, pulp nonsense. And it is downright artistic more often than not. While not truly an open world game - it's often very linear, the game delights more with the details and side activities than with the overall game design. There may be a peppering of long in the tooth JRPG random battles as you walk through the streets. There may be Guitar Hero style karaoke sing alongs. And there may be button mashing combat encounters, all of which you may have seen hundreds of times in dozens in other games, but none with the dry humor or atmosphere of Yakuza. I could make a list of all the small frustrations you could encounter in the game too, but this game is almost above any sort of focused criticism. Yakuza is just a good time and it maybe even one of the best gangster tales told in the last 15 years too."], ["Daxter297", "User", "10", "A brilliant action game with rpg elements which requires levelling up by spending money earned through selling and completing missions and side quests aswell as being dropped by enemies."], ["Monokuma6677", "User", "10", "I played Yakuza 1 on the PS2 during the team it released and it was quite an unusual game for me. It differs a lot from your stereotypical Anime influenced Japanese games and followed a realistic art direction. It was enjoyable, fun and then story was quite interesting. I never played any of the other Yakuza games that followed despite hearing great things about them. Releasing almost always on the west at least a year after their Japanese release, the games followed the familiar but successful formula."], ["shiftyman", "User", "9", "Having never played a Yakuza game before, I was expecting your typical shoot n up and everything that goes with it, but much to my surprise, Yakuza 0 is a strongly story driven game, with a very good combat system, a great main story with funny and clever sub stories, and a host of other actiivities to keep you more then entertained, easily one of the best titles of 2017."], ["Grodd885", "User", "10", "A brilliant action game with rpg elements which requires levelling up by spending money earned through selling and completing missions and side quests aswell as being dropped by enemies."], ["Darkin20", "User", "8", "Amazing game, love the franchise. They really know how to entertain with storytelling, dialog and minigames. However, the engine they use is getting rather dated and they really need to update it to meet higher standards of gameplay and graphics."], ["Skitzofreniq", "User", "10", "Wow. I had never played a Yakuza game before and after finishing with Yakuza 0 I kind of realised I've been missing something great my whole life. The main story is so well written, the Japanese voice-acting is amazing, the cutscenes are beautiful, the sub-stories are hilarious. I can't remember the last time I was laughing my ass off this much with a video game. The gameplay is superb as well since you have six different fighting styles to choose from which gives you variation."], ["Uncledeath2277", "User", "10", "This game is a full on masterpiece and one of the most underrated games on the ps4 as this has some of the most fun I have experienced in years with an engaging story that knows how to handle it's tone so well. If you see this buy it and you will not regret it."], ["Maddog5511", "User", "10", "Just amazing. I have just finished this game and honestly I am now wanting to play the whole series because this installement was just so good. The story is one of the best in a game I have played, with some very well done characters and the gameplay is so fun. Just give it a chance when you have the time it deserves all of it."], ["ehcab", "User", "8", "I give Yakuza 8 cause i loved the experience of playing in Tokyo and Osaka during the 80's. Stories (main and side quests) are awesome, as well as the characters interacting in them."], ["No1Livz4ever", "User", "9", "I like Ryu Ga Gotoku series, and this one is one of the best games of it. Ryu Ga Gotoku 5 was a good game, but there was too mush management, it was casual (substories markers on the map for example), and Haruka part... Ryu Ga Gotoku 0 shows us how characters become who they are now and doing it the right way."], ["badgerryan19", "User", "9", "Great game. The 2 main characters are so likable and charming. The dialogue and the writing is spectacular and the soundtrack is fantastic. There is a lot to do in this game as well. With so many side quests and a campaign that will last anywhere from 30-40 HRS. The combat is pretty good too aside from getting a bit repetitive near the end. All in all great game. I'm excited to see what's next."], ["Troubleman244", "User", "10", "This is the game that made me realize I don't need a new Shenmue. Sure I'm looking forward to Shenmue 3 but the truth is, the Yakuza series is what Shenmue was but with even more to do...maybe even too much to do."], ["ByYuxiSs", "User", "9", "I wish I could go further in this great saga which with us for very recently with this game recently released and for my opinion if the Ps4 continues to receive exclusive of as much quality as the games of this year will be an incredible year."], ["Chaotic_Zombie", "User", "10", "Games like these where you actually be very happy to pay $60"], ["RagnarokMike", "User", "9", "While 2 still has the best story, 0 is otherwise the best Yakuza game to date."], ["Pauboman", "User", "10", "One ofthe best in Yakuza series and a must have for 2017. A thrilling experience that combines both drama and action in a cinematic experience and updated with a superb and renovated fighting style."], ["Bolkie", "User", "10", "It's hard to explain how special Yakuza 0 is, I'll try though."], ["Fishyfishy", "User", "10", "As someone whose never played a Yakuza game before, I've been completely blown away. The story is gripping and intense, the combat is fun and satisfying, and the side missions are incredibly goofy and entertaining distractions from the main story. Don't hesitate to jump into the series with this game, it is well worth it."], ["H1s6n", "User", "10", "YAKUZA 0 is really a 10Anniv Project from YAKUZA studio (RGG Studio)"], ["tkgnus", "User", "9", "I had to make a metacritic account to review this game. This game surprised the **** out of me. It's hilarious and so much entertaining to play. The story line is top notch!"], ["Chillywilly23", "User", "10", "Great game. The story will have you hooked and the fighting is so satisfying. Plenty of activities too many to name them all. For anyone new to the series its a beatem up with a Japanese mafia storyline. Karaoke,batting practice,classic arcade games like outrun,rc car racing and so on. Def worth it with many hours of fun."], ["Hellome7", "User", "10", "I have played practically all Yakuza games and by far this is my favorite! Not only because technically speaking it's objectively the best but also the story and the characters are top notch. The game feels a bit silly at start but trust me, wait until it catches up and hey, you'll be in for a treat!"], ["Chapa9dj", "User", "10", "For those of us who loved Shenmue I & II, this is a must. It is exceptionally good, the story is so well written and the characters so good. I really like Kiryu, it reminds me or Ryo from Shenmue in some ways, but Majima is amazing."], ["SofaTrooper", "User", "10", "Yakuza 0 is one of the most surprisingly brilliant games I have played in recent years. Amazing story with some of the best acting in gaming. Lots of content and crazy fun.  Absolute Gold.  10/10"], ["BeerNinjaUK", "User", "10", "I loved this game, it's a lot fun. Sure it isn't the best graphically but I believe it is a port of a PS3 game anyway and in my opinion, graphics aren't the most important thing."], ["VivaLaMayo", "User", "10", "Fun,Fun,Fun and more Fun.Probably one of the best Yakuza games in the series.A crazy but intriguing storyline that keeps you glued to the game,never a dull moment in the game apart from the old silly objective lol.But besides the storyline what you can do within the world of yakuza 0 is very interesting and extroadinarary i was left speechless but in a good way.I dont want to spoil anything by mentioning some of stuff you can experience with the game but going to say,this game is must buy,this is a real gangster game with tonnes of fun to be had and will put a smile on your face everytime you indulge into the world of Yakuza 0.(10//10 for pure fun and thats what gaming is all about!)"], ["c25ha2U", "User", "10", "Played Yakuza 1-4, did not played Yakuza 5, and based on my experience this is a huge improvement. Stationary bystanders do not move like robots by moving their head and not their body. Not going to lie since a lot of features have been implemented, it took me awhile to get used to the game like the stance change between rush and brawler. Also seems that they \"nerfed\" the weapons being picked up and increase the fighting damage."], ["PaleNielsen", "User", "9", "My first game of the series and I can't wait to play more. The story is incredibly amazing but it just starts very slow and the battle system gets very repetitive, just be patient and if you don't like it when you're already at chapter 5 or even chapter 4, the game is not for you but you'll miss out a lot of humor, drama and awesome boss battles. Yakuza has a lot to offer for its price. It will be an awesome movie if its not a game. It actually saddens me that I was not able to play the series on my PS2 or PS3."], ["Turbodowg", "User", "9", "Yakuza 0 is a great game. It reminds me of when I first played the fantastic Shenmue on the dreamcast. In fact they are pretty similar games in comparison. I love the beautiful open city full of culture, neon lights, restaurants, arcades, clubs, bars, casinos and erm porno theater's! There is so much to see and do in Yakuza."], ["Gordo6677", "User", "10", "For the record this is my first Yakuza game and I'm officially a fan of the series now. I picked this up primarily for the sheer content and humor, but of all things the story has grabbed me from the very beginning. This is all the more surprising considering that it's Japanese VA with English subtitles but the characters really shine through and draw you into the world of 1980s Japan. As interesting as the main quests are good luck focusing on them as you will be pleasantly distracted by the numerous side quests and mini games (oh look the Sega arcade, maybe just a little more Space Harrier...). Bottom line, if you're at all interested in this game after watching the trailers and reading reviews do us all a favor and pick it up so we can continue to receive future titles in the series here in the states."], ["xabbott", "User", "8", "Great characters, excellent side missions, decent story however due to the tone of other parts of the game it does feel out of place at times. There is a lot of story to it so don't expect a \"GTA in japan\" experience. Think more Shenmue with more street fights."], ["LINKTJT", "User", "10", "Yakuza 0 is an absolute blast that is full of content start to finish. Those who solely complain about the graphics clearly never even gave it a chance."], ["RuslanDZE", "User", "9", "This is my first game in Yakuza series. I did not expect anything awesome from a game. I picked this game up because I am tired from the western games and their business models. So I was hoping to find new game with soul lets say."], ["SuperJamaican", "User", "10", "Wow what can I say...1st would be if you are a fan of old school arcade brawlers like final fight or streets of rage this will be right up your alley.  I've never played a yakuza game before and the only reason I took interest into this game is because of Angry Joe.  That being said while 60 bucks being spent I decided to give it a go.  Its been a while since I've felt so overwhelmed with joy while a play a story driven game.  The story while boring at first is excellent,  and its great how the sub character Majima literally outshines the main character Kiryu, makes for some great balance tho."], ["abraham_b", "User", "9", "I really like the Yakuza series; being a huge Shenmue fan I had to try it out and I have to honestly say, if I'm ever in the mood for the whacky, rather than the grounded Shenmue-esque, experience then Yakuza is the way to go. And my goodness is Yakuza 0 whacky. In the best way possible."], ["Kakarot26", "User", "9", "This game is a lot of fun. It´s a weird combination of many elements: A very intense and dramatic story with compelling cutscenes, funny and sometimes touchy side quests, engaging minigames, and a sort of simple but still exciting battle system. None of its elements are great on their own, but they combine so well in a way that is hard to describe, that it makes it hard to stop playing."], ["TheT800Warrior", "User", "10", "Where do i even begin with this game! It is just absolutely amazing there is no other game that delivers that ultimate badass feeling you get when you fight your way through an entire bulding and dropkick a dude out of a window while epic music plays, it is truly a one of a kind and an absolute blast! Yakuza 0 is a prequel to the entire series so it's great for newcomers and long time fans alike. The entire game is 60FPS which makes for very smooth gameplay which  feels great to play. The minigames are tons of fun and addicting especially the cabaret management. The story is absolutely amazing as well as the soundtrack. it is jam packed with so much great content a single play is easily 50-130+ hours of gameplay.  i highly recommend this game to anyone who wants a fresh revitalizing gaming experience!"], ["kekocukeko", "User", "9", "Maybe yakuza is best game series for me this game series is masterpiece for me because all yakuza games are perfect for me so i can recommend all yakuza games and start 2 review    Graphics= very gut %85    Gameplay=awesome %95    History=super %95    voices= good %80    Overall= 87   pls dont miss this masterpiece"], ["Felice_Enellen", "User", "9", "Excellent storytelling.  A good prequel for the rest of the series and a good entry point for new players.  Fighting feels tight and upgrades are plentiful.  Lots of collecting for OCD folks.  The graphics suffer a little for being a cross-generation title (PS3/PS4) but you really don't notice once you get into the game.  The small but open world is tightly packed with activity and goals.  It'll keep even the most focused players busy and entertained for days, maybe weeks."], ["draifu", "User", "9", "My first yakuza game and I should say this game makes me want to play the old ones. Good balance between the extremely hilarious side quests in contrast to the serious main story. The characters are interesting too and the game really lets you experience Japan in the 90s, from karaoke to being a pocket circuit racing and punching jerks in the face."], ["edermath", "User", "10", "The story, voiceacting, characters, side quests, soundtrack, minigames and tons of hours of content make this game worthy, there are a few issues with some textures and invisible walls that I hope they patch them, it's a 9.5 for me"], ["ZicX", "User", "9", "A fantastic game , its a comedy+gang related theme game+hentai+anime+++++"], ["megabear", "User", "10", "I bought three GTA series, and didn't enjoy any of them.  After a while everything felt like a chore.  In Yakuza 0 I found myself actually caring about the main character and look forward to the story progression.  I wish I pre-ordered it and saved myself some money but oh well, it was worth my $60."], ["Bitrip", "User", "10", "This is the best RPG I've played on the PS4 so far. The combat mechanics are solid and the story is good. The real draw however, is the city itself. There is so much to do and most of it is really fun. There are minigames galore, secret/hidden sidequests, and so much more. If you are on the fence like I was, hopefully this is enough to push you over!"], ["waatwaat", "User", "10", "Easily one of the best game this year. Many fun mini games and side quests. Master piece plot and story telling. You can't miss it! Get much more fun from this than GTA 5."], ["Jtbone417", "User", "10", "This is my introduction to the Yakuza universe, and it did not disappoint.  This game is an absolute masterpiece in every way.  Fantastic story, hilarious interactions, fabulous mini-games, and enough distractions to keep the attention of an ADHD patient who skipped his meds.  Everything about this game is perfect and I cannot wait to be introduced to more."], ["Chiyou", "User", "10", "My favorite in the series, it has storytelling like no other game. The combat system has come a very long way, there are so many styles. The mini games are really good too, and whenever i have a chance to be in 1980's japan to play some outrun at the arcades you can bet i'm interested."], ["kaminokaz", "User", "10", "story is well planned and very unpredictable. it even made me cry at one of the cut scenes. the voice acting is amazing and the town is just packed full of distractions that you can just spend hours n hours doing."], ["Leenat40", "User", "10", "This was my very first Yakuza game. I watched a lot of gameplay and reviews, and because I like deep narratives and anime, I decided to buy it. Got home, put the disc in and I didn't even understand how much I was enjoying it. The deep and intriguing narrative, a fun combat system!"], ["ob1foru", "User", "8", "I am new to the Yakuza series. Yet after I saw a trusted YouTuber review this game, I began to dive into the game history and lore before deciding to give it a try."], ["havoc94", "User", "10", "Easily the best game I've played in about two years, comparable with the likes of Folklore, Drakengard 3, and other true auteur titles - yet somehow Yakuza 0 lacks the flaws those games had. Combat? Great, Writing? Even better. Music? Perhaps the best I've ever heard in any beat-em-up. Pacing, Length, Sidequests are just ridiculously fun to do. This is a true video game."], ["Elite74", "User", "10", "Pros:"], ["Neerolyte", "User", "10", "First Yakuza game for me, and it is one of the best game I ever played. The story is absolutely fantastic, and thrilling. Combat, while repetitive, is very over-the-top and fun, with different styles to choose from. While it is strictly an open-world, the map is quite condense, but with LOADS of activities. The dark story combine with humorous side-quests, running real estate, run a cabaret, fishing, bowling, gambling, watching sexy girls catfight, and watching money fly everywhere, makes this game the best experience I ever had in a long time. Platinum will take easily 150+ hours."], ["bunnyofthesea", "User", "8", "As a newcomer to Yakuza I must say that this has been a great experience. This game does a great job of engrossing you into the story from the first 30 minutes to the ending. The story is one of the best I have experienced in a while and I feel is the best part of the game. The 3 parts of this game are the story, the main brawling gameplay, and the massive amount of minigames. The minigames are wacky and fun and act as a great diversion to the serious main story and compliment the game very well, my only issue is that along the main story you are forced to do most of these minigames at least once which at some points when i wanted to just get to the next piece of story were quite annoying. My main problem with Yakuza 0 is the brawling main gameplay. The fighting system in this game is satisfying and very fun at first, with multiple styles and upgrades. The issue comes in when you are 30 hours in and each segment of fighting takes forever and you are spamming cheap moves just to get to the next piece of story. By the end it gets old and you will be doing TONS of it. Besides the repetitive combat this game was very enjoyable to play and I would recommend it to anyone who likes good stories or enjoys having lots of variety of side content."], ["mac_s1", "User", "10", "Fantastic game, it has amazing presentation, a story that is completely unpredictable, and satisfying gameplay. At times the game may seem a little slow however when it gets going, it booms. You can be sure when there's a cutscene **** about to go down, first 5 chapters alone and I am already loving it and very much into the game."], ["MrBurger", "User", "8", "First their is great lip syncing It is also a super fun brawler where you caojafokwndscfcnvsrdzxnvdonvokwsnxfvknwrspkfnpierdnpvnreoxnvreifnviendoinvwoinvinvoins inoifnionfdionvfniofinfnidfviofvdinfvd its a good game alright"], ["Kinokee", "User", "7", "I really want to rate it higher but the sour taste after many of the minigames and combat never exactly doing what I want it to prevents it from ever being a truly good game. At this point, I can get better value out of a novel and a game designed around only weird minigames, as then both would have the proper quality and not just **** around in the middle."], ["Rustaman", "User", "9", "A fascinating story with dynamic and spectacular battles, intense boss battles,varied and well designed mini-games. There is no localization in Russian - for it is minus one point."], ["BN333", "User", "8", "One of the few worthwhile Japanese exclusive titles. Better combat then previous open world games, fun world. Campaign could have been a little better. Shed some of the gtaness, hopefully a little more with future entries."], ["YourMumWashes", "User", "5", "Another disappointing japanese game."], ["VanDerGame", "User", "3", "This game is absolutely horrible apart from the story and fighting."], ["klemenhe", "User", "0", "Being an all time fan of the yakuza series I was deeply dissapointed with this long awaited sequel. The graphics are downright horrible and the gameplay is not only boring but feels nothing like its successor. Do not waste your money on this horrible milking cashgrab"], ["Thetruegamer", "User", "0", "This game is a sick joke, playstation 2 graphics, terrible character modelling and boring gameplay, its 2017, not 1998, possibly the worst game ever made, poorly, glitches, crashes the console also, it is also extremely sexist and derogatory to wimen"], ["rscl", "User", "7", "Story-wise a really awesome game.  I would recommend playing it on easy just as a movie of sorts. Visuals are average yet pretty. The combat mechanics are bs."], ["YamadaSan", "User", "10", "amazing game amazing well written story & hilarious substories, i cant wait till Yakuza Kiwami 2 get release in west whoever vote negative can suck it"], ["tbouniverse", "User", "10", "I had so much fun every moment with this game. Kiryu and Majima are such awesome mains. The story is so interesting that I found myself pulling off 5-hour sessions because I could not contain the hype."], ["Kenmei", "User", "9", "Equal parts soap opera drama and absurd craziness, Yakuza 0 is a terrific entry point into the long running and very popular Japanese underworld drama. As a starting point for the two main lead characters of the series, Kazama Kiryu and Goro Majima, it shows what lead up to the first game and the causes for how they became the people they were at the very beginning of the main story. As a newcomer to the series, it was nice to see the characters in almost their base form and see what drove them towards the events that will happen in the first game."], ["RJX74", "User", "9", "One of my favorite games on PS4. Slow start but it explodes in an awesome adventure. Love the setting"], ["hazartas", "User", "10", "My personal GOTY of 2017, Yakuza 0 is probably the peak of human creative genius. This game is the best gift you can buy for yourself, don't even hesitate, just buy right now!"], ["don_tim", "User", "10", "Excellent story! Addictive gameplay!!! This game was a hell of a ride and such a great experience. This was the first Yakuza game i've ever played. Now I'm up for the challenge to complete them all."], ["Nel", "User", "8", "One of the best games in the serie for sure. The game has  several of hundred of  hours of gameplay if you desire. The game is really enjoyable, and  it has a little bit different way of earning money than in the other games. It's fun, but after a 50 plus hours it starts feeling a little bit repetitive."], ["scruffy_77", "User", "10", "Well what can I say, I refer to metacritic for game reviews based on user opinion rather than corporate reviews, the latest call of duty reviews showed the country mile of difference between user and company reviews on all platforms! Based the reviews below I delved into this new world of Yakuza. At first I was apprehensive, thought perhaps I had made a bad decision, but I kept on... and oh my days, this game has immersed me beyond reproach. The story is epic, I could have never guessed the way it would turn out. The side stories, the mini games, the club management, the real estate.   The laughs I had at the telephone dating. Sega have outdone themselves, it is such a shame a game of this calibre has no media coverage in the west. Yes the graphics are not the best and not cutting edge... But if you want pointless eye candy that looks good with no substance then purchase one of the many other titles currently available. For a newbie Yakuza player, this has been amazing, entertaining, funny, addictive and immersive. Sega, a hat tip from my childhood with Sonic, and a hat tip as an adult for Yakuza... In a word, brilliant!! This game can only deserve a 10/10 from me."], ["eyelidsz", "User", "10", "Yakuza 0 is another great entry in the series, and may just be my favorite so far. Like previous Yakuza titles, it features memorable characters, strong writing, funny side stories, and fun mini-games. The addition of 4 fight styles for each of our playable characters Kiryu and Majima improves the gameplay from previous entries. Simply put, fights have never been better in the series. Also, the soundtrack is once again fantastic and enhances the experience in its own way. Yakuza Kiwami is next!"], ["vgm", "User", "8", "I’m new to the Yakuza series and I have to admit I was expecting more after all the good reviews I’ve seen. This game has a really slow start, to the point I considered quitting the game a few times during the first 10-15 hours, but after that is when things start to open up."], ["BlakDak666", "User", "9", "Yakuza 0 is a excellent demonstration and throwback to not just the entire series, but also a nostalgic reminder that games can still be fun and not rely on graphics and size to make it a selling point. On the surface, Yakuza 0 can look quite negative: its graphics and textures look awful, the stiff animation models, the sometimes buggy AIs of bystanders, the lack of way points or proper labels of properties and places, the invisible walls and objects, etc. This alone could spell disaster for any game sold on modern hardware, so it speaks volumes that this game not only holds its ground with its limitations, but drop kicks expectations sky high. That's the greatness of this game; it soars above so many modern titles for keeping the core foundation of satisfying gameplay, great stories ripped right out of action and mafia films with its own originality, metric tons of activities (all surprisingly fun to do) and so much respect for its players that even for $60 this is highway robbery and would have been assaulted by most game companies in the worst of ways. Thankfully, this is a 2 games (you could even argue 3) in 1 that is absolutely worth your time. Let me briefly explain the game more to not mislead."], ["MetroidDime", "User", "10", "This game is so damn good, man."], ["Lotap", "User", "8", "+The story is great"], ["ryderbro", "User", "10", "this was the first yakuza game I played i loved it to the point where i wanted to play the campaign again which is strange for me because even with games like GTA5 and god of war I didn't want bother playing them anymore because they just bored me with doing the exact same thing over again and giving me nothing to do after i completed the campaign but yakuza somehow gives me more content with a low budget than a game with a ridiculous budget like destiny. point being you have to try this game its just that good"], ["Lilahkiz", "User", "10", "Great entry into this awesome franchise so much content though Yakuza 5 has the biggest amount in the series a great story though 2 is good and 2 ctities and you can now play as Majima :)"]], "platforms": ["PlayStation 4"], "image_url": "http://static.metacritic.com/images/products/games/1/8e1fea31e9b9d1a0f37d9dcc37555501.jpg"}
{"publisher": "Sega", "genres": ["Action Adventure", "Open-World"], "rating": "M", "title": "Yakuza 6: The Song of Life", "release_date": "Apr 17, 2018", "avg_score": "83", "summary": "In Yakuza 6, Kazuma Kiryu will find out exactly how much people are willing to sacrifice for family -- be those ties through blood or bond -- when he investigates a series of shadowy events that involve the ones he holds closest to his heart. Fresh out of a three-year prison sentence, an older and weathered Kiryu comes to find out that his surrogate daughter, Haruka, has gone missing from the orphanage he looks after. The trail leads him to his old stomping grounds in Kamurocho, where he discovers that she has been struck by a car and now lies in a coma. To make matters worse, Kiryu learns that Haruka now has a son that he must look after. With baby in hand, Kiryu journeys to the seaside town of Onomichi, Hiroshima to unravel the truth about Haruka, her son, and a sinister secret that the Hiroshima yakuza are harbouring.", "reviews": [["DarkStation", "Critic", "100", "Yakuza 6 offers one of the finest, most realized crime stories of the medium. It also marks the conclusion of Kiryu Kazuma’s story, granting him an ending befitting such a well-rounded character. And the best part is that you don’t have to be a Yakuza expert to appreciate how it all ends."], ["Digitally Downloaded", "Critic", "100", "If there’s any justice in the world Yakuza 6 would sell millions of copies. It’s smart, sharp, often surreal, and always hugely entertaining. The game maintains the series’ penchant for reproducing the experience of being in a Japanese city to exacting details, and then overlays a brilliant, labyrinthine, wildly funny B-grade yakuza drama over the top. It’s the kind of game you just “live” in, and the perfect example of open world game design done right."], ["CGMagazine", "Critic", "95", "Yakuza 6 has so much to offer and every moment of it is a joy, even if you can’t always read what they’re saying."], ["Playstation Universe", "Critic", "95", "A rip-roaring conclusion to Kiryu's tale and the best entry in the Yakuza series to date, Yakuza 6 is a triumph that effortlessly cements its place in the pantheon of all-time JRPG greats."], ["ZTGD", "Critic", "95", "What Yakuza 6 meant to me as someone who has followed the series from the very beginning is a true culmination of 12 years worth of characters and story. It’s an absolute emotional rollercoaster ride, packaged together with some of the best content the series has offered to date and polished to an absolute shine. “The Song of Life” may very well represent the final chapter in the legendary chronicles of the Dragon of Dojima. However, as is the case with every great legend, his story will live on, having left an indelible mark in gaming history as one of the most memorable and important characters to have ever graced the medium."], ["Hobby Consolas", "Critic", "93", "We love Yakuza´s story, its locations that seem \"alive\" and its many minigames (including classic Sega arcades such as Puyo Puyo, Virtua Fighter 5 or Super Hang On). The song of Life is the perfect ending for this saga."], ["Game Informer", "Critic", "93", "One of my favorite things about Yakuza 6 is that it delivers surprises at such a steady clip."], ["God is a Geek", "Critic", "90", "Yakuza 6 is a fitting end to a great saga, with fantastic combat and lots to do outside the main story."], ["Meristation", "Critic", "90", "Good graphics, new and improved battle system, engaging plot... SEGA has made, once again, a superb title that moves away from some of the conventions of the franchise (such as the experience gathering and progression system, the possibility to save anywhere...) but keeps the essence of what makes Yakuza, Yakuza."], ["GameSpace", "Critic", "90", "When the title credits roll, you’ll be hard pressed not to feel bittersweet to know this is the end of Kiryu’s long tale. Where the series goes next is anyone’s guess, but it’s hard to imaging it without our scarlet-shirted protagonist. Yakuza 6: The Song of Life is not only a great game, but a fitting closure for the long and turbulent story of Kiryu Kazuma."], ["GamesRadar+", "Critic", "90", "A touching finale for Kazuma Kiryu, Yakuza 6 manages to surprise and delight in equal measure."], ["Gameblog.fr", "Critic", "90", "We could not have thought of a better way to end Kiryu Kazuma's adventures. More than a simple GTA clone, Yakuza 6 is a generous game which will provide you with a hundred hours of an amazing gaming experience. You will never be bored with the never-ending amount of content available in this game. Moreover, Japanese culture enthusiasts will have a great time hanging out in a very well modeled versions of Hiroshima and Kabukicho. A must have."], ["Trusted Reviews", "Critic", "90", "A wonderful crime thriller that embraces everything that made the series great, refining it further with new technology – it blew me away. I’m not ashamed to say that the closing minutes of Kazuma Kiryu’s final chapter brought me to tears, acting as the culmination of a story in which I’ve lost myself for more than a decade."], ["Push Square", "Critic", "90", "Yakuza 6: The Song of Life tells a truly gripping tale – a story that blows most games out of the water. Combine that with a refined combat system and a new engine capable of making the game's world feel more alive than ever, and you've got a stellar Yakuza title. Although the experience does feel a little stunted in places outside of the main plot, this is still a fitting final chapter. Yakuza 6 is a gloriously dramatic send off for one of the greatest characters in modern gaming."], ["Game Revolution", "Critic", "90", "I could go on and on about how utterly incredible Kazama Kiryu is as a character, and how the Yakuza series has broadened my horizons when it comes to Japanese games. If you've played Yakuza in the past, I think you'll get a tremendous amount of enjoyment out of this game."], ["EGM", "Critic", "90", "It’s taken me a long time to experience the Yakuza series, but Yakuza 6 makes me so thankful that I finally have. The insurmountable badass Kazuma Kiryu is surrounded by a fantastic cast of characters and some gripping drama—it’s just a shame that the “game” portion of this video game isn’t quite what it could be. Still, this is a superb adventure from beginning to end, and further proof of the magic that Japanese developers can weave when they put their minds to it."], ["PlayStation LifeStyle", "Critic", "90", "Song of Life is Kiryu’s story and focusing on something larger would only be a disservice to one of gaming’s most fully realized characters. It’s only fitting that he bows out in Ryu ga Gotoku Studio’s most mature and focused game."], ["Hardcore Gamer", "Critic", "90", "Yakuza 6 isn't just one of the best entries in the series to date, it's also one of the most fulfilling experiences you'll find in 2018. A game bursting with content and character alike, it takes its rightful place alongside some of the best releases of the year not just on substance or style, but on its ability to balance all its attributes yet pace it in a way that's both manageable and inviting."], ["Twinfinite", "Critic", "90", "It's definitely a more condensed experience than the content-stuffed Yakuza 5 or 0, but the trade-offs are worth it. Whether you've been following this series for years or only have minimal experience with it, Yakuza 6 is an entry worth playing."], ["XGN", "Critic", "90", "For the past few years players had the chance to enjoy the beautiful story of Yakuza. Unfortunately, this story comes to a close with Yakuza 6. While you assume the role of Kiryu for the last time, the beautiful ending is in sight."], ["Gaming Nexus", "Critic", "88", "Yakuza 6: The Song of Life wraps up the story of Kazuma Kiryu with the same sense of style and attention to quality the series has always maintained. By alternating erratically between deadly serious crime stories, and wildly goofball side activities, Yakuza strikes an entertaining sweet spot that few other series manage. Players should set aside a lot of time before engaging with Yakuza, because like the mob, this is a game that will keep pulling you back in."], ["Wccftech", "Critic", "87", "One step back and two steps forward; Yakuza 6 changes up some of the core elements for Kiryu's last adventure and give new life to a series that's become a cult classic for JRPG fans."], ["Everyeye.it", "Critic", "87", "There is still something that drags him into the past, such as the atavistic static nature of the characters waiting for our input, but the leap in quality is clear, in every single aspect of the game."], ["RPG Fan", "Critic", "85", "There's murder, intrigue, babysitting, and thoughtful contemplation on what it means to be a man and a father in these changing times."], ["GameCritics", "Critic", "85", "The overall story does come up short when stacked against the incredible Yakuza 0, but it’s still a joy to take Kiryu out for a stroll in the most meticulously-crafted and comically-dangerous rendition of Japan ever offered."], ["GamingTrend", "Critic", "85", "Yakuza 6: The Song of Life is a beautiful game, plays smooth, and has a story that is genuinely compelling and driven by top notch dialogue and dynamic characters. The fighting is complex but easy to learn, and the game provides tons of great content in the form of mini-games, town exploration, and side storylines. There is lots to look at and take in as you play, and the game packs a lot of good into a nearly flawless package."], ["4Players.de", "Critic", "85", "Yakuza 6 sure has some weaknesses. But it also is a fitting finale for an underappreciated franchise, where storytelling, compelling minigames and above all, beautiful visuals craft one extraordinary experience."], ["Vandal", "Critic", "85", "Maybe it isn't Kazuma's biggest adventure, but it's the most espectacular and personal. Yakuza 6 is the swan song fans of the franchise can't miss."], ["The Games Machine", "Critic", "85", "Like its predecessors, Yakuza 6 is a beautiful, engaging and deep title. Nonetheless, after seven main chapters, countless spin-offs, remastered versions and remakes, a slight whiff of deja vu is almost inescapable. Having said that, The Song of Life is a great conclusion to an unforgettable saga."], ["IGN Italia", "Critic", "85", "Yakuza 6 does not invent anything new compared to the previous installments, and the lack of many iconic characters from the saga shouldn't be understimated, but despite this, the final chapter of Kazuma Kiryu's adventures remains one of the best Yakuza installments ever."], ["IGN Spain", "Critic", "85", "The Yakuza series is again founded on three main pillars in The Song of Life: myriad activities and mini-games, deep combat, and wonderful storytelling that ends the era of Kazuma Kyriu and serves to draw the new horizon toward which Sega will go."], ["DualShockers", "Critic", "85", "Despite the few shortcomings, Yakuza 6 is a worthy successor for the franchise and an absolutely fantastic experience that will keep most enthralled from the beginning to the end, with a whole lot of extremely welcome detours due to the wealth of side stories and additional content."], ["Polygon", "Critic", "85", "Yakuza 6 succeeds because its core story is so compelling. Every seemingly disconnected part serves a purpose: Without fights, it’d just be a movie; without cutscenes, it’d just be a series of contextless fights; without exploration, it’d be an on-rails punching simulator. All of those unexpected pieces and the (oh-so-long) cutscenes interact to make an equal parts story- and punching-driven game that is heart-wrenching. This is so much more than that game about a crime guy that I had expected."], ["Easy Allies", "Critic", "85", "Yakuza 6 is undeniably one of the best entries in the long-running series. Memorable side quests and engaging mini-games offer countless diversions and emotional encounters. The combat becomes routine, but the personal struggle of Kazuma Kiryu brings a satisfying and remarkable conclusion for the legendary Dragon of Dojima."], ["Multiplayer.it", "Critic", "84", "Quotation forthcoming."], ["New Game Network", "Critic", "82", "Yakuza 6 is a fitting end to the journey of Kazuma Kiryu that will not disappoint long-time fans, while also providing an accessible journey to newcomers. Though it does not reach the heights of previous entries in its narrative and optional content, it does deliver a touching tale with a strong thematic core that has even stronger combat chops."], ["COGconnected", "Critic", "82", "For the most part, though, Yakuza 6: The Song of Life gives fans of the series what they want, plus a new level of polish and smoother gameplay. And if you’re new to the series, this is one of the better titles to start with, and you’ll catch on to what you’re supposed to do pretty quickly."], ["JeuxActu", "Critic", "80", "Yakuza 6 The Song of Life is clearly one of the best works in the series offering a great finale for Kazuma and greatly improved visuals thanks to the Dragon Engine and one of the best casting of characters in the entire series."], ["InsideGamer.nl", "Critic", "80", "This is the biggest Yakuza addition until thus far, but it does not really know how to amaze us like Yakuza 0 did. We appreciate the way Kiryu's story comes to an end. Even after many chapters this game still surprises us."], ["TheSixthAxis", "Critic", "80", "Yakuza 6 is a beast of a game, and it sends Kiryu off in style. The graphical upgrades are mouth-watering, and the seamless interior exploration makes an already immersive world even more engrossing."], ["MMORPG.com", "Critic", "80", "Yakuza 6: The Song of Life is a game I keep going back to. Even after finishing the main quest I want to keep playing and exploring the world of Yakuza. It also inspired me to get into the larger series, and as a result I just installed Yakuza 0 to start playing."], ["Guardian", "Critic", "80", "The Yakuza games have always balanced brutality with tear-jerking sentimentality: it’s a curious mix, but they commit so wholeheartedly to both that they somehow pull it off. It’s no surprise when the final act launches a full-blooded assault on your heartstrings. Yakuza 6 may not be subtle, but few players will be left dry-eyed as the curtain on this tale is finally drawn."], ["Digital Chumps", "Critic", "80", "Yakuza 6 applies themes of fatherhood and masculinity as coping mechanisms for intense interpersonal drama. While it surrenders the sweeping ambition that defined Yakuza 0 and Yakuza 5, it feels sharper, more focused, and more honest about its intentions."], ["3DJuegos", "Critic", "80", "The Dragon Engine is certainly a welcome upgrade, creating a gorgeous Karumocho and Onomichi. But this visual change does not come without sacrifices, which can be seen in the other aspects of the game, equally or more important: combat, exploration and secondary content."], ["Eurogamer Italy", "Critic", "80", "The sixth installment in the Yakuza franchise diligently completes its task: it brings the series to a new dawn of modernity and allows the fans to say goodbye to the legendary Dragon of Dojima. Even with some small flaws in the script and less epic boss figths, The Song of Life is a thrilling experience and one worth buying."], ["RPG Site", "Critic", "80", "Yakuza 6: The Song of Life has an incredibly bittersweet ending, and the narrative twists and turns that brought me there, left me feeling satisfied with the close of Kazuma Kiryu’s story."], ["Gameplanet", "Critic", "80", "Yakuza 6 delivers the series' signature poignant story, and is probably the best Yakuza has been narrative and production-wise. However, the game's trademark diversions have been trimmed back."], ["SpazioGames", "Critic", "80", "The story, content and gameplay are unquestionably of a good standard, but it was not what we wanted from the final game of Kiryu Kazuma, who we were so fond of during these 12 years. In our opinion it was reasonable to expect something more, especially in the combat system that instead of going forward took a step back, especially if compared with Yakuza 0, which on that front (but not only that) was the pinnacle of the series. The purchase is still recommended in an essential way, especially if you are a historical fan, in the meanwhile we'll waiting to find out what'll be the future of the brand without Dragon of Dojima."], ["VideoGamer", "Critic", "80", "Fighting and exploring is more free than ever, and the story, while wanting in certain areas, introduces a few great characters. Some activities and side missions lack a punch, but how many games do you get to wear a giant orange on your head?"], ["Worth Playing", "Critic", "80", "Yakuza 6 is a solid entry in the franchise. It's carried by a strong story and excellent visuals that make up for the fact that it's a fairly bare-bones Yakuza title that has less content than other titles in the series. Fans of the franchise should find a lot to like in Yakuza 6. It's not the best entry for a newcomer due to it being the end of Kiryu's story, but it's a solid and enjoyable game."], ["USgamer", "Critic", "80", "Yakuza 0 is simply the better game overall, leaving Yakuza 6 as just a great game. Of course, a number of games aspire to be \"great\", so Yakuza hitting that benchmark even on an off year is a testament to the development team and the strength of the franchise. Yakuza 6 is well worth your time, but remember to manage your expectations."], ["GameSpot", "Critic", "80", "The world is dense and rewarding to exist in, the dynamic combat system stays exciting even after you’ve kicked the crap out of five thousand enemies, and perhaps most importantly, Yakuza 6: The Song Of Life serves as a fulfilling conclusion to the turbulent, decade-long saga of its beloved icon, Kazuma Kiryu."], ["App Trigger", "Critic", "80", "While Yakuza 6 takes a small step backward in its combat, sidequest content and presentation, its attention to detail with its engrossing, dynamic story paired with its near-infinite replayability makes this a thoroughly enjoyable, if only slightly disappointing, chapter of Kazuma Kiryu's life."], ["Edge Magazine", "Critic", "80", "Yakuza 6's narrative builds to one of the finest climaxes in the series - perhaps, in fact, the best of the lot...When the dust settles, the series fan is given something that no previous Yakuza game, bound as it has been to an inevitable sequel, has ever offered: closure. [Apr 2018, p.108]"], ["Gamer.nl", "Critic", "75", "Yakuza 6: The Song of Life offers amazing storytelling and world-building, but when it comes to gameplay mechanics and technique Yakuza 0 and Kiwami 2 are way ahead."], ["IGN", "Critic", "75", "Yakuza 6: The Song of Life presents the most detailed virtual chunk of Japan the series has managed to date, and its story provides a satisfying end to the Kizama Kiryu saga. However, as far as gameplay goes, Yakuza 6 doesn’t make enough of an effort to break new ground, making it weaker overall than last year’s Yakuza Zero."], ["GamesBeat", "Critic", "75", "Yakuza 6 has an ambitious narrative, alternating between lighthearted and dramatic. Unfortunately, it doesn't give its characters enough love and care to truly pull off the pathos."], ["Metro GameCentral", "Critic", "70", "A slightly underwhelming end to the legend of Kazuma Kiryu, but the changes in gameplay and graphics do hold a lot of promise for the future."], ["Attack of the Fanboy", "Critic", "70", "Yakuza 6: The Song of Life brings a satisfying end to Kazuma Kiryu's story, but it's not quite the send off I expected. Between its convoluted systems and cut content, it didn't feel like the saga ended with a roar, but with a whimper."], ["Destructoid", "Critic", "70", "Given more development time, this could have been the definitive entry in the series, but what we’re left with is good enough."], ["IGN Japan", "Critic", "70", "For a story-driven game, there are just too many inconsistencies in its story. Yet despite this, Yakuza 6 comes with undeniable charm."], ["Slant Magazine", "Critic", "60", "Yakuza 6‘s thematic consistency is impressive, though the game scarcely gives women the space to be more than props or damsels or to speak up when they’re shamed for having lives outside the constraints of possessive men. The game wants to be about parents in general, but in a series steeped in the kind of male bravado where expensive suits are cast off in one swift motion to reveal extravagant back tattoos, it’s mostly just about fathers."]], "platforms": ["PlayStation 4"], "image_url": "http://static.metacritic.com/images/products/games/6/b86ac3c41c456646c9b489f23e84889d.jpg"}
{"publisher": "Sega", "genres": ["Action Adventure", "Open-World"], "rating": "M", "title": "Yakuza Kiwami", "release_date": "Aug 29, 2017", "avg_score": "80", "summary": "In 2005, a legend was born on the PS2 – the legend of Kazuma Kiryu, the Dragon of Dojima, in his video game debut with Yakuza. Now, 11 years after that release, a new generation of players is be able to experience the action and drama of the Yakuza series with the rebuilt-from-scratch HD remake exclusive to PlayStation 4, Yakuza Kiwami.  “Kiwami” literally translates to “Extreme”: Kiwami adds new story depth over the PS2 original, new distractions around the in-game setting of Kamurocho, added side quests, updated mechanics and combat, and more. [Sony]", "reviews": [["Gaming Age", "Critic", "100", "I think Yakuza Kiwami, and the original game in general, had one of the best Yakuza plots in the series, and that holds true even today. The sole focus on Kazuma as the protagonist makes for a more focused adventure than Yakuza 4 and 5, and it’s nice to see how Kazuma builds his reputation as the Dragon of Dojima with this game. I’m also a sucker for betrayal/revenge plots, and the original Yakuza has one of the best in all of video games. So do yourself a favor and pick up Yakuza Kiwami when it releases on August 29th, it’s certainly not a game to miss."], ["NZGamer", "Critic", "90", "Another remake, but a damn good one. The perfect place to begin if you’ve never played Yakuza before."], ["PlayStation Country", "Critic", "90", "Calling Yakuza Kiwami a remaster almost feels unfair. You'd be hard-pressed to recognise it as a PS2 game originally, with the graphical improvements and gameplay additions bringing it on par with the other recent entries in the series. As fans would have come to expect its an intriguing story, with deep, likeable characters, brutal combat and plenty of side stuff to keep you busy."], ["Playstation Universe", "Critic", "90", "Simultaneously a great introduction to the Yakuza series and one of its better entries, Yakuza Kiwami is precisely how you remake a classic."], ["Everyeye.it", "Critic", "90", "Can be considered as a modern training novel: touching; exciting; With a sensitivity and a rare delicacy when he tells the tragic events of a man from whom everything was taken away."], ["DualShockers", "Critic", "90", "Yakuza Kiwami will go down in history as one of the best remakes ever created, for a game that was already great on PS2."], ["Attack of the Fanboy", "Critic", "90", "Yakuza Kiwami represents the pinnacle of the series, with Sega bringing everything it has learned over the years and refining it into a single neat package. The result is a unique and unforgettable experience that far outstrips what was presented in the original entry."], ["Trusted Reviews", "Critic", "90", "Yakuza Kiwami is a dazzling remake of an underappreciated classic, improving upon its source material in so many important ways. At times it can feel dated, but that doesn’t stop Kiwami from proving Yakuza is once again one of the best things on PS4, and perhaps any other platform."], ["Digitally Downloaded", "Critic", "90", "As it turns out, Yakuza Kiwami feels every bit as current as Yakuza 0 from earlier this year, or Yakuza 5 on the PlayStation 3 before it. It’s a magnificent game, in other words."], ["Hardcore Gamer", "Critic", "90", "Yakuza Kiwami remakes the original game in a near-perfect way. Some may be disappointed over the lack of English voice acting, but the use of Japanese with English subtitles greatly increases the authenticity."], ["Hobby Consolas", "Critic", "89", "Twelve years after its original release on PS2, Yakuza Kiwami is still a great adventure set in modern Japan. Some mechanics such as invisible walls or certain fighting elements feel outdated, but the story, setting and minigames are awesome."], ["COGconnected", "Critic", "88", "But even if it can’t quite measure up to Yakuza 0’s near-perfection, Yakuza Kiwami is still a thoroughly enjoyable experience for series veterans and newcomers alike. Whether you’re playing it as a sequel to Yakuza 0, or just want to see the original game in its newly-polished state, you’ll find it is packed with great stories, interesting diversions, and cool surprises – and all of that at $29.99 US. This series just keeps getting better and better."], ["Impulsegamer", "Critic", "86", "Yakuza Kiwami is a worthy remake for the twisty, well-acted story alone and the fact that it is being sold at a cheaper price than current new release games is extra incentive to check it out. Combat is fun, the city feels live and there is so much stuff to do, from the mundane stuff like darts or shooting pool, to the very weird stuff like MesuKing, which is essentially rock paper scissors featuring sexy ladies in skimpy bug costumes. Long time franchise fans and newcomers will find plenty to like with Yakuza Kiwami, even if it falls slightly short of its later entries."], ["Wccftech", "Critic", "86", "Despite Yakuza Kiwami sharing a near perfect reflection of 80's Kamurocho from Yakuza 0, there's still an important story to tell. The city of Kamurocho welcomes all with a wide array of minigames, sidequests, and the most Majima cameos of any Yakuza title to date."], ["GameOver.gr", "Critic", "85", "A great remake packed with additional story content and an improved battle system, which will satisfy fans of the series."], ["GameGrin", "Critic", "85", "Yakuza Kiwami does a whole lot right, while only making a few errors. Other than the control scheme being a bit dated, Yakuza Kiwami comes together as a solid remake of the original title."], ["Game Over Online", "Critic", "85", "All in all, Kiwami is an easy game to recommend to fans of the series and those who have already played Yakuza 0 and loved it. The remakes of the older titles are Sega’s way of ushering in a new generation of fans and, now that the series has proven to do well in the west, bring all of the series’ experiences to a wider audience. Yakuza Kiwami is just as fun, weird, disturbing, hilarious and provocative as the rest of the series’ titles, and is well worth the twenty-five hours of gameplay and thirty dollar price of admission."], ["Digital Chumps", "Critic", "85", "For $29.99, it’s worth the experience, especially if you’re a fan of the original series back in the heyday of Yakuza. Sega did a fantastic job of pulling this older title up into current console expectations. They could have sold this puppy for $49.99 and it still would be worth it. If this is your cup of tea, then you need to get it immediately."], ["PSX-Sense.nl", "Critic", "85", "The story isn't quite as interesting as it used to be and the game's multiplayer mode feels a bit tacked on, but don't let that stop you. Yakuza Kiwami is still very much worth your time and sincerely recommended to both fans of and newcomers to the franchise."], ["LaPS4", "Critic", "85", "Yakuza Kiwami is true remake. Most likely taking advantage of the work made for the latest entries, they took the first game of the franchise, made a visual overhaul and addes enough gameplay mechanics to be far more than just that. Knowing there is a Kiwami 2 in development is also great news, we can't wait to see the Dragon of Kansai in all its glory if the game is on par with Kiwami."], ["The Games Machine", "Critic", "85", "Yakuza Kiwami isn’t that big and deep like the prequel, and it’s not a must-buy if you've played the original title on PS2, but it’s a good game, available for a very fair price. The combat system has been revamped, and the huge amount of secondary missions and minigames are bound to keep everyone entertained for quite a while."], ["Game Informer", "Critic", "85", "The game’s overall scale is still impressively large, but there’s only one main area to explore. Visiting the first entry, enhanced as it is, certainly gave me a greater appreciation for the strides that the series made later. That’s probably not what Sega was hoping for here, but it’s unavoidable considering the close proximity to Yakuza 0’s release."], ["Meristation", "Critic", "85", "Although understandable being just a remake and not a new entry, Yakuza Kiwami lacks the huge amount of content found in recent instalments of the franchise, but it does a great job updating the plot of the first entry in the franchise to later innovations and improvements, as well as current (although a bit dated) graphics."], ["IGN Italia", "Critic", "85", "Some signs of aging are inevitable considering we're 12 years from the original game, but nowadays few remakes are as well done as Yakuza Kiwami."], ["GamesBeat", "Critic", "85", "This newcomer thinks that Yakuza Kiwami is a blast. I can’t speak to how different it is from the first game, but the sheer amount of content and personality makes it worth checking out. Though the fights could get repetitive at times, the combat system kept things interesting on the whole."], ["SpazioGames", "Critic", "85", "If you are a fan of the series or not, Yakuza Kiwami is a title that you must play to (re)discover the origins of Kazuma Kiryu: the legendary Dragon of Dojima."], ["PlayStation LifeStyle", "Critic", "85", "As a remake, Kiwami is a triumphant success. Not only is it leaps and bounds more playable than the PS2 original, the additional scenes help flesh out character motivations. This all makes the story of Kiryu’s rise feel more special, and it’s a perfect continuation for those who recently played Yakuza 0."], ["God is a Geek", "Critic", "85", "The start was always the best, and this extreme edition is a reminder of how fantastic this series has always been."], ["XGN", "Critic", "85", "This is the only title that should be in your PlayStation 4 right now. The best game to play if you dig a good story and nice missions to play. But be sure that you checked Yakuza 0 first."], ["Vandal", "Critic", "83", "Kiwami improves what could be improved and keeps what should be kept. The additions aren't too relevant if you played the original, but it's great to replay it or for newcomers."], ["GamePro Germany", "Critic", "83", "For fans of the series, this game is a small gift and a great opportunity to return. And if you have not yet come to this great game series, Kiwami is a suitable entry."], ["Multiplayer.it", "Critic", "82", "Yakuza Kiwami is a virtually perfect remake, which extensively enhances the elements that characterize the original chapter of the series, enriching them in multiple ways."], ["Edge Magazine", "Critic", "80", "Twelve-year-old fights feel brand new because of the inclusion of Yakuza 0's switchable combat styles. [Issue#311, p.110]"], ["Gamer.nl", "Critic", "80", "Yakuza Kiwami is a great new take on the classic crime game. The story is fascinating and it is hard to let go of this beautifully shapen world."], ["New Game Network", "Critic", "80", "Yakuza Kiwami presents the strongest mechanics in the franchise’s history, as well as refined side missions and lots of fun distractions that create a fantastic reimagining of a great game."], ["Playstation Official Magazine UK", "Critic", "80", "With a world that you'll end up knowing by heart and characters you'll want more of, Kiwami is unique, moving, and serious; everything you love about games. [Oct 2017, p.92]"], ["JeuxActu", "Critic", "80", "Yakuza Kiwami is a very good remake of the first opus of the series that offers vastly improved graphics and an overhauled gameplay allowing more freedom during fights. A rejuvenated PS2 classic."], ["ZTGD", "Critic", "80", "For the most part, Kiwami is a good retelling of the very first game and arguably has the best story out of the entire series. The visual upgrades are nice, and the addition to the modern combat engine is most certainly welcome, but original fans as well as people who jumped into the series later on need to keep in mind this is a remake of a 2005 game that didn’t have as much content as the later entries. Still, I have to recommend this game to both fans of the series as well as people wanting to get into it. It’s a fantastic jumping in point for the story, and while the boss fights are annoying, it tells a fun tale while still being very entertaining gameplay wise, and at the price point of 30 bucks, you really can’t go wrong."], ["Gameblog.fr", "Critic", "80", "Yakuza Kiwami is a perfect example of a remake done right. The news graphics and added content give longtime fans of the series more than enough reasons to dive right back in Kamurocho's seedy underworld. And for new fans and curious gamers, Yakuza Kiwami is the perfect way to discover Kazuma Kiryu's first misadventures."], ["GameSpew", "Critic", "80", "For its budget price, Yakuza Kiwami delivers more than its fair share of violent crime-filled action laden with a weird sense of humour, and I was glued to the screen for every minute of it."], ["Game Revolution", "Critic", "80", "The story kept me up for hours on end, the sub-stories were interesting with hilarious characters and great writing, and the combat felt incredible to master by the end. It can’t be ignored that they had a chance to massively improve the story, but chose to just try and maintain the status quo, but the package is fantastic nonetheless."], ["We Got This Covered", "Critic", "80", "Slip into your suit and ready your fists: Yakuza Kiwami is a fantastic remaster of the game that spawned a franchise, and a timely dose of wackiness before Yakuza 6 drops next year."], ["IGN Spain", "Critic", "80", "Yakuza Kiwami is the perfect game for those who never played a Yakuza before. The new graphics and control are a nice way to enter in the life of Kiryu."], ["3DJuegos", "Critic", "80", "Yakuza Kiwami is a great remake, probably one of the best we've seen in the last years, updating the graphics and gameplay from the original game without losing its essence. But it is also a remake of the more “simple” yakuza entry, lacking the variety of characters, stories, locations and activities from the following games. Nevertheless, it is suitable for continuing the great reception of the recent Yakuza 0 or as a cornerstone to enter the franchise."], ["RPG Site", "Critic", "80", "There’s a ton of content here to make your way through, especially if you take the time to just explore the city streets and indulge in side activities. If you’re a newcomer to the series, this is an excellent jumping on point, and it’s a steal at only $30. So if you only have even a passing interest in the game, just know that there’s no better time to lose yourself in the neon glow of Kamurocho."], ["Eurogamer Italy", "Critic", "80", "Quotation forthcoming."], ["Twinfinite", "Critic", "80", "Kiwami holds a ton of appeal for anyone coming hot off of Yakuza Zero, but there’s ample reason for longtime fans to jump in, and it’s even a fine starting point for new players as well. Despite the slow starting hours, once Kiwami and Kazuma Kiryu grab hold of your attention, they don’t easily let go."], ["Destructoid", "Critic", "80", "Really, you can’t go wrong with Kiwami. I would have liked it if every aspect of the game had been fully redone, but we don’t see remakes like this come along often. I can deal with a few stumbling blocks when the core quality of what makes Yakuza so unique and engaging remains untouched. At least now more people can have a chance to experience this classic, which is the best thing about Kiwami’s existence."], ["USgamer", "Critic", "80", "This is my first Yakuza game, but I found myself completely in love with everything the game had to offer."], ["CGMagazine", "Critic", "80", "Yakuza Kiwami is the best way to experience Yakuza. With Yakuza 6 on the way, those looking to jump into the series would benefit greatly from picking up Yakuza Kiwami. If you’re a fan of Japanese films or gangster movies in general, the plot of Yakuza is a good enough reason to play this game. I can only hope that Yakuza 2 receives the same treatment in the near future."], ["GameSpot", "Critic", "80", "Kiwami does a great job as both a remake of the original Yakuza game and as a sequel to Zero. Despite that combat remains more of a bump in the road than a rewarding pursuit, it's a no-brainer for existing fans of the series, and shouldn't be overlooked by newcomers, even if Zero passed them by. There's nothing else quite like Yakuza, and Kiwami isn't afraid to show it."], ["App Trigger", "Critic", "80", "Yakuza Kiwami represents a solid reimagining of the Kamurocho of old."], ["IGN", "Critic", "79", "Yakuza Kiwami makes great strides in updating the classic original Yakuza game to modern standards. But while it adds better combat, bizarrely charming side quests, and a gorgeous graphical revamp, it also ignores some of the original’s biggest problems in pacing and storytelling. And because of its relatively short length, Yakuza Kiwami’s fun trip through the tangled web of Japan’s criminal underground feels like a prelude to something bigger and better to come."], ["Video Chums", "Critic", "78", "Yakuza Kiwami may not have gameplay as varied as Yakuza 0 but the gripping story, solid combat, and rewarding progression make it a must-play experience for both new and long-time fans looking to either discover or revisit Kiryu's debut adventure."], ["4Players.de", "Critic", "77", "Even with the weaknesses more exposed than originally, this still is a good remake. Kamurocho never looked better and Kiwami tells one of the best stories of the franchise to date. This is a great opportunity to get acquainted with the Yakuza series."], ["CD-Action", "Critic", "75", "Yakuza Kiwami is so much more than just a remake of the first game in the series. Sega rebuilt the original from scratch using a much more powerful engine, with the help of completely new artists, and enriched the script with tons of references to subsequent Yakuza releases. It’s not a perfect game but it does a great job at tying up loose ends from Yakuza Zero. [11/2017, p.50]"], ["Worth Playing", "Critic", "75", "Yakuza Kiwami is a solid remake that has the misfortune of being released in the same year as the predecessor from which it recycles most of its content. Yakuza 0 is just a better game in almost every way. Kiwami's story is plenty of fun, and the writing and side content remains as hilarious as ever. It just feels too familiar. Those looking for more Yakuza will find a lot to like here, but even at a budget price of $30, it's difficult to feel excited by any of it. Give it more time to breathe, and it'll be a fun way to re-experience Yakuza, but anyone who dives in immediately after Yakuza 0 is going to have a very severe case of déjà vu."], ["InsideGamer.nl", "Critic", "75", "Yakuza Kiwami is a great remake, but it is not amazing. Even for a Yakuza game it gets very repetitive and it simply does not have the same quality as the other games. A bit of an anticlimax."], ["RPG Fan", "Critic", "70", "Fun can definitely be had with Kiwami. I know there are people out there who are going to love roaming the streets of Kamurocho to beat up baddies, stopping to take a break only because they passed by an arcade and want a new prize from the claw machine. Unfortunately, from a mechanical perspective, everything about the game seemed completely shallow. In the end, Yakuza Kiwami felt more like a novelty experience than it did a rewarding one."], ["M3", "Critic", "70", "Although Yakuza Kiwami does fall into the same routine as Yakuza 0, the new new sections with Majima are truly exceptional. Nevertheless, it does not change the fact that Kiwami feels like an expansion rather than a sequel."], ["AusGamers", "Critic", "70", "Combat in Yakuza is deep and with RPG-like progression and various fighting styles on offer things improve as the game goes on. It’s a shame then that the more difficult encounters feel a little silly when you need to keep eating and drinking to restore health and slowly chip away at a boss figure’s health bar. For newcomers, and well, anyone really, playing on easy comes recommended. For a game that is about story first, and getting to explore Japan second, having to deal with fighting that can often devolve into frustrating bouts of dodging and toying with the limited mechanics isn’t worth it. And a frustration-free Yakuza Kiwami experience means more time spent at one of the many hostess bars."], ["Slant Magazine", "Critic", "70", "It's hard to not see Yakuza Kiwami like an also-ran in a year where its own polished, forward-thinking prequel has happened, and yet the fact that so much of what makes it unique was there in 2005 shouldn't be overlooked, nor should the fact that it still feels unique in 2017. This is a stripped-down, basic version of that winning formula, but there's no denying it still wins."], ["Metro GameCentral", "Critic", "70", "The original Yakuza has been remade into a sequel to its own prequel, but although it’s perfectly competent it feels outdated compared to the newer entries."], ["Easy Allies", "Critic", "70", "When compared to past Yakuza games, Zero in particular, Yakuza Kiwami simply has less going for it. There's only one playable character, a single city to explore, and fewer activities. However, Kiwami is launching at a heavily discounted price, and when viewed from that perspective, it feels like it has a lot to offer. The story is consistently interesting, the fighting still brutally satisfying, and Majima Everywhere is a clever addition. Yakuza Kiwami may not be the biggest in the series, but it's a solid remake of the game that introduced the Dragon of Dojima."], ["Polygon", "Critic", "70", "Yakuza Kiwami makes it clear just how far the series has come, and just how far it still has to go. It’s keenly designed to bring newly minted Yakuza fans more firmly into the fold by providing all the contemporary comforts they might expect, while also giving longtime fans more to chew on than a shot-for-shot remake ever would have. It’s a patchwork, for better and for worse, and as much as I enjoyed my time with it, there’s no denying that some of those patches are looking more tired than others."], ["GameCritics", "Critic", "65", "Overall, Yakuza Kiwami isn’t a bad game despite several issues that drag it down. No, its real problem is that Yakuza Zero is a significantly superior product in every way that matters. Fans of the original release will likely dig the modernization, but for any newcomers thinking of jumping in, I’d recommend starting with the infinitely better prequel."], ["RPGamer", "Critic", "60", "Yakuza Kiwami is a very modest remaster with very little new content. What is new is swell, but it's nothing groundbreaking or even necessary. It's more like nice little bonuses to a game that hasn't entirely aged well story-wise and graphically. Still, it was nice to come back and see where the series started without all the rough edges of the original PlayStation 2 release. I will say that Kiwami made me love the first Yakuza a touch more than I did when I originally played it years ago. As a crazed fangirl for the series, even though Kiwami is a solid effort, it still doesn't hold a candle to later games in the franchise."], ["Gamer.no", "Critic", "60", "Quotation forthcoming."], ["Push Square", "Critic", "60", "Yakuza Kiwami finds itself in a strange position. A remake that's technically a sequel to a much better game in Yakuza 0, it struggles to offer anything besides another engaging crime-drama storyline. Best described as a kind of expansion, Kiwami really shows its age in terms of narrative structure and gameplay design, but it's still worth playing through if you just can't get enough of Kaz. It goes without saying, however, that series newcomers are much better off starting with the far superior Yakuza 0."], ["Groot650", "User", "10", "The Yakuza games have always popular in Japan but unfortunately, it's wasn't that popular in the west so they released the games a few years later (Yakuza 5 took 3 years to be localised). However, the game is becoming more popular in the west because of the violence and its story."], ["OrochiamruSama", "User", "10", "As A long time yakuza fan,yakuza 0 was the best game ever for me and kiwami is the perfect sequel for it,if you want games with the best story and huge amount of content, yakuza games are for you"], ["17_jrpg", "User", "10", "Yakuza Kiwami returns the first game of the series back to life in a way that is completely rebuilt from ground up for the PS4. This open world action-adventure game with role-playing elements follows the story of Kazuma Kiryu, the Dragon of Dojima, whose life changes because of the incident that occurred in the Dojima Family office. In Kiwami, the original story gets an extension that adds a new depth of story which tells us about friendship, love, respect, loyalty, sacrifice, greed, betrayal and revenge. New additions to the story further explain certain parts of the story that may have been unclear in the original."], ["Gandalf44", "User", "10", "This game is incredible. The Value is excellent. If you love a good story, lots of drama, turns, twists, and plots that rival game of thrones, then you might love this game. Im a developer, and i really, really appreciate what Sega has done with this series. I hope they take this game style and gameplay, and bring it to other genres and themes. If the developer is reading this, you've earned a fan for life!"], ["ultimatesoll", "User", "10", "Latest Yakuza game finally came to the west after it’s localization thanks to Sega. This game is remake of original Yakuza (“Ryu Ga Gotoku” in Japan) game which released in 2005."], ["hasan_oddeyes77", "User", "10", "omg this game is so good i liked the story-characters -music very much and i am so excited to play yakuza 0 thank you Sega for this masterpiece wooooooooow"], ["ShadowPeter", "User", "9", "Ryu ga Gotoku Kiwami (in Japan), better known as Yakuza Kiwami in the West, is a remake of the first Yakuza. It is a game of action and adventure and that has as protagonist the monstrous, invincible, fighting against evil person's and always with the good people, Kazuma Kiryu."], ["Lunala430", "User", "10", "This game is such a underrated masterpiece. Hell the entire series I think if one of gaming best yet it is not very well known at least until the excellent yakuza 0 that got this series some attention in the west and now with kiwami it proves that after all this time that yakuza has still got what makes it so great and has now mastered it. The gameplay is so damn fun and the combat is so chaotic and fun that I never got bored of any of the encounters. The story is still one of the best in the series and now with the kiwami rewrites it is near perfect as their is not a single burning moment but I do think it helps to have played 0 first. All and all we would be here all day if I talked about everything but to Sum it up buy this game cause this series really deserves the love and attention as some other big franchises and if that happens sega may port more of these over to the west."], ["marshallu2018", "User", "8", "This was my first game in the Yakuza series and I now know what I've been missing.  This game is a ton of fun and I'm glad I got it."], ["monokuma888", "User", "10", "This game is great, and I reached this conclusion after a few hours of playing. I've had the game for a few weeks now and I've periodically picked it up here and there. For me, that is how I have gotten the most out of Yakuza Kiwami. I play for a few hours, set it down for a few days, and finally come back to it again. This is my first Yakuza experience and after having gotten more than half way through it, I was prompted to buy Zero because this franchise is amazing. Just an amazing brawler that is extremely underrated. It's ridiculous that it took me this long to get into the series, but now that I am, it is a pleasure to play."], ["scruffy_77", "User", "10", "Just brilliant... the story of these games are brilliant, the game is brilliant and perhaps I should mention it is brilliant. I am just sad I have to wait until March for Yakuza 6. A masterpiece!"], ["HTGamer", "User", "9", "Yakuza Kiwami is a great remaster of a great PS2-era Sega game, made for PS4."], ["Duckzilla3311", "User", "10", "Fantastic remaster of the 1st Yakuza. If your a fan of the Yakuza series this is defo recommended they also announced that Yakuza kiwami 2 is being released in the west which is brilliant news which is a remaster of the 2nd but when I say remaster its actually been rebuilt in the dragon engine. But kiwami is great lots of fights and moves too learn. Also the majima everywhere was a great extra not in the original. As Goro majima is my fave character. :). But there are also tonnes of side quests and things to explore and do in kamarocho which is the fictional version of Tokyo. This is a great rebuild of the 1st game. Can't wait for the second one. :)"], ["badgerryan19", "User", "9", "Yakuza Kiwami returns as the first game in the series worked from the ground up and oh boy is it a blast. Along side Yakuza 0 this is starting to pick up some big momentum towards Yakuza 6. Heck there could be two Yakuza games in my top 10 games of the year so far. Great game. I do feel like 0 is just a tad better though, but besides the point the game has great characters, writing, story ridiculous fun action. Do yourself a favor and get this and Yakuza 0 if you haven't."], ["Shincy", "User", "10", "As many players gave comment how good the main story is, I would like to highlight sub-stories are very entertaining, as funny/weird/bizarre as it sound, many of them are realistic situation in Japan."], ["shiftyman", "User", "9", "Yakuza games are the best, not only do they have great engrossing main stories, main characters you can really get involved with, plus all the crazy side quests and mini games, Yakuza Kiwami is no exception."], ["GamingNinja", "User", "9", "A solid game priced the right way."], ["H1s6n", "User", "10", "If you liked YAKUZA 0 or YAKUZA 1"], ["DrSiko", "User", "6", "Gameplay gets so repetitive it's so boring. Go to point A, fight goons, go to point B, fight Yakuza gang, go to point C, fight more goons."], ["AfroThundah", "User", "2", "Everyone says it's been rebuilt from the ground up but, well, it still plays like a PS2/3 era game, with the same stupid camera and all, don't get me wrong, swinging a reception lounge chair (yes, a 3 seater chair) is stupid and hilarious, but the camera does nothing to help you in fights (I'm dwelling on the terrible camera). And those climax battles, that **** can just leave, seriously. The story is the only reason this doesn't get a 0, it looks a little bit prettier than the original but not enough was done to modernise this to make it a \"remake\", it has to be remade, not given another lick of paint."], ["Zeydlitz", "User", "5", "This game could be almost perfect Yakuza game, but one piece of crap made it pretty mediocre -- it's Climax battles. This stuff SHOULD be removed from games ."], ["tbouniverse", "User", "9", "This is the first Yakuza title I have ever played."], ["RuslanDZE", "User", "8", "After my first game in this series which was Yakuza 0, Ive became very interested at this world. I love story driven games with cool characters so that is exactly my type. I was anticipating Yakuza Kiwami. I picked this game up without a secind thoughts, especially for 30$ is a very decent deal."], ["hazartas", "User", "10", "Do yourself a favor and just buy this game right now. It's a great remake of the original Yakuza on PS2. It's the sequel of Yakuza 0 which is GOTY of 2017. You will love this game!"], ["joaopontesvaz", "User", "8", "Graphics: 8.4 Sound: 8.2 Gameplay: 8.1 Fun/Story: 8.2"], ["Chimes003", "User", "9", "Yakuza Kiwami is the best remake I have seen on the PS4 thus far.  It is a remaster of the original Yakuza game for PS2.  The 2016 remaster can be found with Japanese audio and English subtitles for relatively cheap in America.  The Sega corporation has made a strong showing in the beat 'em up genre that it was known for during the nineties.  The steel book edition features great graphic art on the front and back.  My favorite is the Yakuza style tattoos on the back cover.  The player plays as protagonist Kazuma Kiryu as he brawls anyone standing in his way.  There is strong RPG elements evident in an internal leveling system that improves your four styles of martial arts, strength and health.  As the player enjoys the constant scuffles on the fictional city of Kamurocho the RPG elements really come alive.  The cinematics engrosses the player in the criminal underworld of the real life Yakuza.  There is murder, cover ups, mystery. deception. revenge, honor and loyalty.  The graphics standout on their own.  The player will forget that Yakuza Kiwami is a 10th anniversary remake.  And let's not forget Goro Majima.  He is in every part of the game as the system \"Majima Everywhere\" suggests.  He is difficult to fight, but good for comedic relief.  This is a true next-gen beat 'em up/RPG and if you don't find a steel book copy, you'll be missing out on a great game."], ["egoBorder", "User", "5", "I'm not familiar with the Yakuza series outside this game, so maybe take this with a grain of salt, but Yakuza Kiwami did not make a good first impression.  If, like me, you're new to the series and looking forward to a bit of role-playing in a Tokyo neighborhood, you might be disappointed to find a highly-controlled experience here that simply does not know the meaning of fun."]], "platforms": ["PlayStation 4"], "image_url": "http://static.metacritic.com/images/products/games/7/c09295b0ca0a589e022c610b6d55caee.jpg"}
{"publisher": "Recotechnology S.L.", "genres": ["Action Adventure", "General"], "rating": "E10+", "title": "Yasai Ninja", "release_date": "Jul 21, 2015", "avg_score": "23", "summary": "Yasai Ninja is a hack & slash game set in feudal Japan where Kaoru Tamanegi and Broccoli Joe face the most terrible vegetables. Play in 1 or 2 player mode and finish the adventure.", "reviews": [["Game Rant", "Critic", "30", "Players will never be tested by the game’s combat, but instead by the awkward camera and just how long their patience proves to last. Although there are moments of quality, the title does little to prove its worth against other games of the same ilk."], ["We Got This Covered", "Critic", "30", "Casting vegetables as heroes can't save Yasai Ninja from sluggish combat, terrible audio-visual design and outright broken programming."], ["Brash Games", "Critic", "20", "I hated this game. It’s probably the worst game I’ve played this year… and that’s coming from a girl that played Hatoful Boyfriend. Give me a love story with a pigeon any day over this garbage."], ["Push Square", "Critic", "10", "A good ninja shouldn't be seen or heard, and the same can be said about this game."], ["The_Judge", "User", "1", "This Game Is So Bad Like... You Cant Even Sit Down At The Studio And Bring This Plan Up Without Your Boss Hanging You From A Tree And Sticking **** Up Your Arse"], ["TheLastofMe", "User", "10", "Yasai is such a creative japanese name that gives me boats of laughter and joy. I love being a ninja as I can dodge and assassinate my enemies without being seen and this game can escape the clutches of my competitors. So, when I throw the game outside the window, and it hit someone and that person die, no one would be find who throw it and what was thrown because I am a ninja in the making."]], "platforms": ["PlayStation 4", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/2/6bdf60170f895ce35b586507e38cb4f9.jpg"}
{"publisher": "Microids", "genres": ["Adventure", "Point-and-Click"], "rating": "M", "title": "Yesterday Origins", "release_date": "Nov 17, 2016", "avg_score": "73", "summary": "In Yesterday Origins, the main protagonists John Yesterday and his partner Pauline, immortals who own an antiques store in Paris, travel across the globe through multiple periods. The story takes place across the current and medieval eras, through a series of flashbacks. At the beginning of the game, a young John is imprisoned by the Spanish Inquisition for witchcraft, just prior to the sequence of events that will change his life/lives forever. Although not yet able to resurrect at that point of his life, he has already attracted the attention and fallen foul of Church authorities due to his unusual ability to understand and speak every language he encounters.", "reviews": [["Hobby Consolas", "Critic", "90", "An Adventure for point & click lovers. Yesterday Origins has a great story, full of stellar moments and humor, as well as complicated puzzles."], ["Everyeye.it", "Critic", "80", "Yesterday Origins advances the storyline of its previous chapter, deeply exploring the protagonist's past and building a dark and exciting plot."], ["PSX-Sense.nl", "Critic", "80", "A great story and interesting atmosphere make for a highly entertaining - and at times even creepy - brain twister."], ["Vandal", "Critic", "80", "Yesterday Origins isn't very original, but it's a great adventure that fans of the genre don't want to miss."], ["PlayStation Country", "Critic", "80", "Yesterday Origins updates the point and click genre and manages to tell a great thriller story at the same time. With good presentation, excellent voice acting and well thought out puzzles Yesterday Origins is a game which I can easily recommend."], ["IGN Spain", "Critic", "77", "Yesterday Origins is a interesting point and click adventure but we miss some risks in its development."], ["Worth Playing", "Critic", "75", "Yesterday Origins is a by-the-numbers adventure game that hits all of the marks with reliable accuracy. It doesn't reinvent the wheel, and the puzzles are standard and are occasionally veer difficult for the wrong reasons. The story is elevated by some distinct concepts and strong character writing. It's worth a try just to see how immortals deal with the problem of aging."], ["Wccftech", "Critic", "75", "With an engaging story mixing together thriller and comedy elements with occult themes and plenty of dark humor, as well as some interesting characters, Yesterday Origins is a point and click adventure game that fans of the genre will surely appreciate. With the gameplay formula not straying too far from familiar ground, however, the game developed by Pendulo Studios will hardly appeal to those who don't enjoy this classic genre."], ["4Players.de", "Critic", "71", "I can appreciate the effort, but in the end John Yesterday’s first adventure was better in every aspect. Having said that, the supernatural story with its bizzare dialogue and the clever designed puzzles still deliver a rock solid mystery thriller."], ["IGN Denmark", "Critic", "70", "A well written adventure game that stays true to the format of the 90s. This also means that unless you can appreciate the old gears at work, you'll likely find the point and click formula boring."], ["TheSixthAxis", "Critic", "70", "All round, it’s a solid point and click adventure game that combines that familiar old-school formula with a couple of clever quirks. It has a decent story to boot as well, though there are slight issues with pacing, both in terms of the how the narrative unspools combined with some of the more obtuse puzzles. Together, these create a barrier that will stump players while ultimately holding Yesterday Origins back from greatness."], ["XGN", "Critic", "70", "Yesterday Origins is in its heart a wonderful point-and-click adventurer. With a story that grabs you with its both hands, it drags you down to a wonderful adventure. Unfortunately, an adventure that is manifested by technical problems."], ["God is a Geek", "Critic", "70", "Yesterday Origin is an enjoyable, but at times infuriating, point and click adventure game with a sprawling, compelling plot accompanied by a large amount of satisfying puzzles and a great soundtrack. However, repetitiveness and a sense of labouring the point weigh it down somewhat."], ["IGN Sweden", "Critic", "69", "Yesterday Origins is a nice looking point and click game with lots of puzzles. The story doesn't really come together, though."], ["Areajugones", "Critic", "69", "Yesterday Origins is a great graphic adventure with influences from the old ones and with a very interesting story. However, it has some plot holes and a few technical issues."], ["COGconnected", "Critic", "65", "Yesterday Origins is yet another game to add to the point & click genre that serves up a fairly unique story. It may not be the “must play” point & click adventure game of the year, but it’s one that you can escape in fairly enjoyably."], ["Push Square", "Critic", "60", "Yesterday Origins has a strong cast of characters, an intriguing plot, and beautiful presentation. When you manage to work it all out, the game can be a real joy, but when things go wrong, it can be frustratingly slow and pedantic. Like its narrative, it jumps back in time to remind us of when games were far more frustrating and constrained. It brings back elements of gaming's past that we like, but it also brings back those that we don't. We've come a long way, but if all those troubles feel far away, well Yesterday Origins, to quote The Beetles, makes them look \"as though they're here to stay\"."], ["Digitally Downloaded", "Critic", "60", "It certainly offers a unique story in the realm of video games. Fans of the genre will certainly get a kick out of the game, others may just be intrigued enough by the story to try it out. But will it stand out as a classic in the genre when we're getting so many of them at the moment? Probably not."], ["stardustancient", "User", "0", "The game doesnt work! there is a puzzle where you have to check the base of a cross and when the animation finishes the cursor disappears and your character freezes in place! this is with all patches installed and on PS4"]], "platforms": ["PlayStation 4", "iPhone/iPad", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/7/65c30bfe8d596b82a848ce83f0cf3f94.jpg"}
{"publisher": "NIS America", "genres": ["Action Adventure", "Survival"], "rating": "M", "title": "Yomawari: Midnight Shadows", "release_date": "Oct 24, 2017", "avg_score": "77", "summary": "The follow-up to 2016’s cult horror hit Yomawari: Night Alone, Yomawari: Midnight Shadows introduces two brand-new girls, Yui and Haru, to the night and the spirits who haunt it.", "reviews": [["TheSixthAxis", "Critic", "90", "I long for tense, atmospheric experiences that get me shivering and shaken and Yomawari: Midnight Shadows shook me to my core. It’s a masterful horror game that tops anything else on the Vita, and rivals many other things on the PS4 as it blends detailed sound-design with rich art and a somber narrative to craft a breath-taking horror experience. Some puzzle segments can be obtuse, and the ending lacks the same sense of accomplishment of the first game, but despite all that, Yomawari continues to perfectly define horror."], ["Digitally Downloaded", "Critic", "90", "Telling a horror story this effectively with so few words takes a mastery of the genre that very, very few possess."], ["Destructoid", "Critic", "85", "If you enjoyed Yomawari: Night Alone, you'll love Midnight Shadows. It keeps the creative elements of its predecessor intact while expanding on some of its finer points. If you haven't played Night Alone, you can still jump into Midnight Shadows and experience the same surprises as the original, both scary and cute."], ["DualShockers", "Critic", "85", "Yomawari: Midnight Shadows has everything a horror game needs, engaging story and characters, creepy town, and scary spirits. Most importantly, it shows a significant improvement over what the previous entry in the series offered. Sadly, the game lacks more explorable areas and also a more extensive variety of enemies, who end up overstaying their welcome in the later parts of the game."], ["Meristation", "Critic", "82", "Yomawari Midnight Shadows follows its predecessor in major aspects but is getting better in others like the graphic style and the game's story. The playability keeps on the same level with minor improvements but is interesting to play. Graphically it has a notable upgrade and the atmosphere maintains a good level from the first game, especially in monster design and sound."], ["DarkStation", "Critic", "80", "If you enjoy survival horror games which rely on atmospheric and subtle visuals and audio cues instead of cheap jump-scares, you will definitely love Yomawari: Midnight Shadows. It's an extremely creative game with an adorable outlook and incredibly dark undertones. Prepare to forgive the repetitiveness later in the game, and I can assure that you will have one scary (and cute) survival horror experience."], ["We Got This Covered", "Critic", "80", "Yomawari: Midnight Shadows puts cute girls in a dark soundscape to create a wonderfully unnerving experience."], ["Hardcore Gamer", "Critic", "80", "Yomawari: Midnight Shadows is wonderful, strange, scary, sad, creepy, startling and cute in equal measure. It deftly juggles a large number of emotions from one moment to the next, and if the story progress is frequently interrupted by exploring the town or getting killed while figuring out the next challenge, it never takes too long to get to the next part to be a serious interruption.  If you played Night Alone you can jump right in with no learning curve, but if you missed the first one there’s only a small connecting point between the two games that’s more for fun than any level of necessary continuity. One of the things that took me by surprise with Night Alone is how the game stayed with me after it was done, getting better in memory than it actually was to play thanks to a story that made the rough parts worth fighting through. Yomawari: Midnight Shadows clears those issues away and looks good doing it, effortlessly turning a quirky one-off into one of the best new horror series in a long time."], ["God is a Geek", "Critic", "80", "Yomawari: Midnight Shadows is a worthy successor to one of my favourite horror games and an unforgettable experience that is marred with a few annoyances."], ["PlayStation LifeStyle", "Critic", "80", "Yomawari: Midnight Shadows is a cute-looking survival horror game, with unexpected twists and a surprisingly dark narrative. The same unintuitive control scheme seen before can hinder the experience somewhat, but gamers familiar with those issues from the original Vita release should adapt in no time."], ["GameSpew", "Critic", "80", "In many ways, Midnight Shadows is the definitive Yomawari experience for anyone seeking a slightly fresher take on a survival horror game."], ["RPG Site", "Critic", "80", "There are challenging moments in the game that only make it more aggravating. It really tests your patience especially near the end where you experience a number of trial-and-error moments. However, I can’t say it bothered me as much this time around only because I had already dealt with it previously. On the other hand, it was fascinating being able to observe the fate of two different girls and see the plight from their individual perspectives. The visual and audio design shine brightly in this bleak journey that never breaks from its ambiance and distressing frame of mind. This carries all the way through to the ending which sets a somber mood. So if you’re looking for a frightening adventure that subverts your assumptions, and if you can get around the checkpoint system, the unnerving atmosphere of Yomawari: Midnight Shadows may do you in."], ["IGN Italia", "Critic", "78", "Yomawari: Midnight Shadows will cause you to scream out of fear multiple times."], ["Multiplayer.it", "Critic", "78", "Yomawari: Midnight Shadows tells a new story of two young girls and their strong friendship. Those who already appreciated the previous game can give a chance also to this new adventure."], ["Vandal", "Critic", "77", "It's a great sequel to a very original game. It doesn't offer anything particularly new, but if you liked the first one, make sure you play it."], ["Areajugones", "Critic", "75", "An adventure that should be played by every fan of the survival horror genre. It is not based on gaming cliché and has an amazing 2D style that shows that great games can be created without having too many resources."], ["Eurogamer Italy", "Critic", "70", "A fascinating and dark tale mixed with stealth/survival gameplay elements. With a little bit extra it could have been one of the best horror games of 2017."], ["IGN Spain", "Critic", "70", "Interesting sequel that repeats almost everything that made Yomawari Night Alone great, but with less novelty."], ["Cubed3", "Critic", "70", "Yomawari: Midnight Shadows manages to be pretty scary and goes to show how restraint can be effective in crafting horror."], ["Metro GameCentral", "Critic", "70", "An even better game than the original, whose innocuous visuals hide a tense and unpredictable survival horror of surprising potency."], ["Twinfinite", "Critic", "70", "Yomawari: Midnight Shadows shines a brave light to eschew some genre conventions, but not all. Though the lack of sound and solemn streets are sure to please anyone who loves horror, the abundance of save points makes death inconsequential, removing some terror that the atmosphere instills. Despite that, this is a horror game that is still very much worth your time, if only for a rainy weekend alone in the dark."], ["PlayStation Country", "Critic", "70", "Yomawari: Midnight Shadows is a terrifying game with a claustrophobic and oppressive atmosphere. Whilst the moment to moment gameplay may be repetitive the overall style of the game does more than enough to drag you in. If you're looking for a real fright then this could be the game for you."], ["The Games Machine", "Critic", "65", "Yomawari: Midnight Shadows is a pretty basic horror title, with a creepy and disturbing atmosphere, and an interesting bestiary. The game is not too difficult, the super-deformed art direction is a little bit anticlimactic, but overall it's a good scary ride."], ["Thelastofus1992", "User", "10", "Here is my review about Yomawari Midnight Shadows"], ["SuperkenGaming", "User", "8", "Yomawari Midnight Shadows"], ["BITESCREEN", "User", "7", "Yomawari – Midnight Shadows wirkt mit 2D-Perspektive und dicken Kinderköpfen wie ein harmloses Japano-Rollenspiel der Marke EarthBound. Doch hinter der Knuddelfassade steckt knallharter Survival-Horror – komplett mit waffenlosem Versteckspiel und zermürbender Silent Hill-Atmosphäre. Auf der Suche nach ihrer Freundin Yui schleicht die kleine Haru in tiefster Nacht durch ihr menschenleeres Heimatdorf. Der Blick reicht dabei nicht viel weiter als der Schein ihrer Tachenlampe –  sodass die urplötzlich auftauchenden, eklig bis grotesken Monster den Spieler leicht in den Instakill treiben. Verhindern tut das ein beherzter Sprung in den nächsten Busch oder die heillose Flucht – wenn die Puste nicht vorher ausgeht. Eine ständige Furcht ist die Folge – die zahlreiche Jumpscares, unregelmäßige Speicherpunkte und ein verstörendes Sounddesign noch verstärken. Außerdem manipuliert das Spiel wie einst Eternal Darkness das Fernsehbild – so behindert etwa ein Spinnennetz kurzzeitig die Sicht auf den Screen. Dennoch frustriert Yomawari – Midnight Shadows bei all dem Schrecken nicht – denn gesammelte Items bleiben auch nach dem Tod im Inventar, während eine Schnellreisefunktion die Exploration erleichtert."]], "platforms": ["PlayStation 4", "PC", "PlayStation Vita"], "image_url": "http://static.metacritic.com/images/products/games/4/861ceadc7452b4f63c5f8b4c4fd57fbd.jpg"}
{"publisher": "Merge Games", "genres": ["Action Adventure", "Open-World"], "rating": "E", "title": "Yonder: The Cloud Catcher Chronicles", "release_date": "Jul 18, 2017", "avg_score": "64", "summary": "Yonder shipwrecks players on the vast island of Gemea, a land enshrouded in an evil murk.  By exploring the land, joining forces with the locals and contributing to their community through optional talents like farming, crafting, cooking, fishing and brewing, adventurers can help the island flourish.", "reviews": [["Gaming Age", "Critic", "100", "Obviously, there are some people that probably won’t enjoy Yonder too much. If you want action and adventure, of course, it’ll probably bore you, and if you want a fast-paced story, you’re not going to find that here. But if you’re just looking for a delightful game that allows you to explore to your heart’s contest, Yonder is exactly what you’re looking for."], ["Digitally Downloaded", "Critic", "100", "Yonder is the nicest, and yet most deeply transgressive game we’ve seen in our little section of the art world, for quite some time, if not forever."], ["Playstation Official Magazine Australia", "Critic", "80", "Looks like Zelda, totally isn’t. What you’ve got here is a farming concern which deserves to be spoken in the same breath as Harvest Moon. [September 2017, p71]"], ["Destructoid", "Critic", "80", "Yonder: The Cloud Catcher Chronicles is undoubtedly one of the cutest and most welcoming games that I've played in a long while. Sure, the experience may be slightly marred by a handful of minor faults, but Yonder more than compensates for these issues with its beautifully realised world and its enjoyably lighthearted tone."], ["CGMagazine", "Critic", "80", "If you're tired of shooting guns and swinging swords Yonder offers laid back palate cleansing cuteness in this open-world adventure."], ["Playstation Universe", "Critic", "80", "Yonder Chronicles brings to the industry a game focused more on exploring, developing, and interactions over violence and leveling, and the end product is refreshing. A few things hold it back, but the heart and soul of the entire package is not to be denied on its way to success."], ["Hobby Consolas", "Critic", "79", "Yonder lacks combats, but that it's not a problem when you have a world as beautifully crafted as this is. Match it with addictive (although simple) crafting mechanics, and you have a unique adventure, where joy is found behind every new landscape."], ["COGconnected", "Critic", "78", "Yonder takes many of the things, such as fishing and farming, that usually take a backseat and brings them front and center with rewarding results."], ["NZGamer", "Critic", "75", "Yonder is as calming as it is addictive. I had thought I was happy with the amount I had played, only to come back the next day and complete even more quests. At just shy of $40 it's a little more than I'd want to pay for a game based around exploration, despite how wonderful the world being explored was. That hasn't stopped me from showing the island of Gemea off to all my friends though. Like a kid with the latest set of Pokémon cards, they're not really interested, but I'm going to make sure they know all about Yonder: The Charming and Calming."], ["Wccftech", "Critic", "75", "Despite a few minor hiccups, Yonder offers a beautiful world to explore at your pace. You won't be fighting legions of demons to save the island, but you do collect cats and the likes."], ["Video Chums", "Critic", "72", "Yonder: The Cloud Catcher Chronicles delivers an imaginative and colourful atmosphere that's contained within its own unique fantasy land. It's great fun to explore, learn skills, complete quests, and befriend the residents and the local wildlife. I only wish there was a clearer sense of direction and the ability to traverse this wondrous land more efficiently."], ["DualShockers", "Critic", "70", "Yonder: The Cloud Catcher Chronicles is a charming and visually pleasing experience that will remind you immediately of 3D Legend of Zelda titles, mainly The Wind Waker, in how the towns, island, and citizens are portrayed."], ["IGN Spain", "Critic", "70", "A perfect approach to introduce kids in RPGs and a good choice for those who wish to enjoy a friendly and peaceful game."], ["PSX-Sense.nl", "Critic", "70", "This beautiful adventure transports you to an amazing world filled with a wonderful soundtrack. As far as gameplay is concerned, Yonder never becomes complex, instead opting for a simple, but charming experience. Highly recommended."], ["Areajugones", "Critic", "70", "Prideful Sloth has created a well balanced game with a great artistic style and an amazing OST. Great game for the players that enjoy exploration and adventure."], ["VideoGamer", "Critic", "70", "Despite these niggles, Yonder is obviously a fantastic game for adults to play with their children, and for slightly older children to be allowed to play unsupervised. Even for adults it's surprisingly beautiful, and a soothing breath of anxiety-calming non-violence. But the older you get, the less mileage you might receive from Gemea."], ["GameCritics", "Critic", "70", "In some ways, Yonder reminds of Animal Crossing with a bit of Fantasy Life thrown in, if one squints and tilts their head sideways. All three offer pleasant busywork and pastel colors, and they’re all just the sort of thing if a person’s in the mood for it. However, I strongly suspect that the optimal audience is comprised of kids looking for a game that offers a lot of easily-accomplished Stuff To Do without fear of restarts or penalties. Yonder: The Cloud catcher Chronicles isn’t a great fit for me and I suspect most seasoned players will bow out in a hurry, but I’m going to let my eight-year-old son sit down with it tomorrow, and I imagine I’ll have to pry him off of it with a crowbar."], ["PlayStation LifeStyle", "Critic", "70", "Much like the fauna that inhabits its world, Yonder: The Cloud Catcher Chronicles is a beautifully odd creature. The things it does well it does extremely well, which leaves me baffled at some of the obvious drawbacks that limit its scope and longevity. With that said, I am massively impressed by what such a small team was able to accomplish, and the attractive launch price certainly makes it all the more appealing."], ["Push Square", "Critic", "70", "Yonder: The Cloud Catcher Chronicles is a delightful little game that can appeal to players of all ages and skill levels. The island of Gemea – complete with its atmospheric weather and seasonal cycle – makes for the perfect destination if you're looking for a relaxing virtual vacation."], ["New Game Network", "Critic", "69", "Yonder: The Cloud Catcher Chronicles is an enjoyable enough adventure, but it’s missing a hook to get players invested. The game wants you to get lost in the economy and exploration it offers, but in just performing these menial tasks for their own sake it fails to create any moments where the entire experience is more than a series of distractions."], ["Everyeye.it", "Critic", "68", "Quotation forthcoming."], ["Digital Chumps", "Critic", "65", "Yonder: The Cloud Catcher Chronicles has an earnest heart and an anxious mind. Brilliant landscapes and gorgeous vistas create a waking daydream while economic riddles and perfunctory direction recall the drag of reality. Yonder's strides, despite an admirable form, don't seem to take it anywhere."], ["InsideGamer.nl", "Critic", "65", "Yonder offers a beautiful world and a big heads-up to the bigger franchises of this planet. The fact that only three people developed it, make this game very special. It is too bad the search for Sprites is exhausting, cause otherwise this could have been a pretty awesome game."], ["Meristation", "Critic", "65", "Yonder: The Cloud Catcher Chronicles is a fun, friendly and visually stimulating sandbox with a world that invites you to relax and have fun. But the lack of variety in the chores to do, through simplistic and not very deep mechanics, ultimately affects the game in a negative way."], ["ZTGD", "Critic", "65", "Yonder has some interesting aspects to it, and while they really tried to throw in everything and the kitchen sink into it minus combat, many of them fall flat or shallow. The exploration is the best part of the game by far, and while the other parts of the game may be to shallow for me, others may find enjoyment out of them. Even then, the pacing is well done and players will have a pretty view the entire time. I’d say wait for price drop, but when that happens check it out."], ["God is a Geek", "Critic", "65", "Yonder: The Cloud Catcher Chronicles is a lovely, sedate open world adventure game that inexplicably gates its crafting mechanic behind an obtuse, tiered system that renders it moot."], ["GameSpot", "Critic", "60", "Yonder is beautiful and relaxing, but only up to a certain point. It's great for the first few hours, wandering around and discovering new sights, but the world ultimately leaves you wanting more depth and personality to explore."], ["DarkStation", "Critic", "60", "In the end, Yonder is undeniably a fantastic game to sit back and chill with. If you're looking forward to some exploration, collection, and light building and farming elements, then Yonder is definitely right up your alley. However! There should be a heavy emphasis on \"light\" in the sentence up above! This is not the next Harvest Moon or Stardew Valley. No, this is a game with few puzzles, no combat, and filled to the brim with fetch quests and item collection. Yonder isn't without its charms, to be sure. But deep and engaging game play (and story) definitely isn't one of them."], ["Gameplanet", "Critic", "60", "Yonder: The Cloud Catcher Chronicles offers an amazing world to play in, but an underdeveloped story and menial side-quests offer little to keep players interested."], ["Vandal", "Critic", "60", "This is a title aimed at players who want a peaceful adventure, where exploring is the key. If you're a more experience player looking for something challenging or deep, you might have to look elsewhere."], ["We Got This Covered", "Critic", "60", "Even with its flaws, Yonder: The Cloud Catcher Chronicles manages to create a beautifully peaceful experience."], ["TheSixthAxis", "Critic", "60", "Yonder: The Cloud Catcher Chronicles is a beautiful canvas that needs more detail to make it a masterpiece. Gemea is an enchanting location and the majority of systems in the game function well, but the magic hook is missing. The story isn’t engrossing and the quests just blend into each other for the most part, as do the characters that give them. Gemea is magical, the content not so much."], ["Playstation Official Magazine UK", "Critic", "50", "Simple quests, a lack of tutorials, and little-to-no backstory makes Yonder feel unpolished, in direct contrast to its whimsically charming setting. [Sept 2017, p.84]"], ["Gamer.nl", "Critic", "50", "Yonder offers a beautiful and cutesy world to explore, but there is so little to do, the exploring is over way too soon."], ["Impulsegamer", "Critic", "46", "If gathering resources, exploring, and “go get this for this, or find an item or persons for this” kind of quests are your deal or if you just want a change of pace, Yonder: the Cloud Catcher Chronicles is just for you. More experienced players may find some of the shallowness of the story and game play to be a little off putting. However younger players and those that desire a passive bit of simple gaming away from the loads of violence driven games with no choice but violence in them will have a good time with Yonder: the Cloud Catcher Chronicles. Though I must give this warning… you may smile."], ["Gamer.no", "Critic", "30", "Yonder is a beautiful and cute game that sadly lacks almost every aspect of a good sandbox role-playing game. The quests are tedious, the farming is undercooked, and the constant gathering of resources - without a compelling combat system or a peaceful equivalent - makes for a title that is fun for about half an hour before it grinds itself into forgetfulness."], ["Slant Magazine", "Critic", "30", "Without a way to fail, the game just soldiers on like its fishing minigame: a thing that’s tedious but not at all difficult, and which simply continues until players either succeed or become bored enough to give up."], ["Metro GameCentral", "Critic", "30", "It has admirable intentions, but this misguided role-player proves a quiet life is rarely an entertaining one when it comes to video games."], ["Hardcore Gamer", "Critic", "30", "One cannot comprehend who Yonder: The Cloud Catcher Chronicles is meant to serve. Exploration is a chore based on frame rate issues and less-than-stellar graphics. Questing sucks because there is no real sense of progress or accomplishment. Farming and crafting is similarly pointless as there just isn’t a heck of a lot to do. I will confess to giving up after only a couple of hours in hopes that I was the recipient of Alpha code."], ["NovastreamAU", "User", "9", "Yonder: The Cloud Catcher Chronicles is a hard game to classify. It’s an open world adventure game but one without many of the usual elements. There is no combat or violence, no character progression such as levelling, and very few, if any, puzzles. It has touches of a lot of other games other games: Zelda, Harvest Moon and Animal Crossing to name only a few, but for the most part it’s its own thing. It’s a serene, meditative experience where everything is tied to exploring the world around you. It’s also surprisingly great."], ["AlysonPPD", "User", "10", "Yonder is a relaxing and beautiful game. If you don't like to be relaxed, or you don't like beauty or cute things, then this game isn't for you."], ["ArmymanPants", "User", "8", "Yonder is a game that doesn't add anything new to a game that we have seen before, but it maximizes every element that is involved in a RPG that is quirky, stylistic and above all else, fun. Yonder feels like a mesh between Zelda mixed with VIVA PINATA, and to those of you who dont know, viva pinata was a base building game that involved pinata pets (horrible example i know).  Yonder Isn't a game that stands out as one of the greatest games ever made, but for the price and the entertainment, as well as the content within, it is certainly worth trying it for yourself."], ["KZoneTry2", "User", "9", "I love this game!!!! My daughter loves it too, we play togethor though she doesnt seem too need me at all. Its very relaxed, theres no dangers, its just very nice and adorable"], ["kraenk", "User", "10", "This is an extremely beautiful and relaxing game for all ages. Don't listen to all those douchebags unfairly downrating the game. Hate train galore. It also seems people were having wrong expectations. Watch some let's plays on it, don't believe the haters."], ["sickofthebs", "User", "9", "Yonder should be celebrated for defying current gamer expectations and bringing a unique gaming experience that brought a smile to my face the whole time I played it."], ["compoczar", "User", "4", "Superficial and Empty. The \"No Man's Sky\" of RPG Farming Sims."], ["BananaLuiz", "User", "6", "Good, but it could be better, the graphics are very beautiful and pleasant, and the gameplay is attractive to a certain extent, however the game does not support its mechanics and its history, after a certain time everything is very superficial and tiring, And the gameplay is becoming more and more repetitive, plus a case of untapped potential"]], "platforms": ["PlayStation 4", "PC", "Switch"], "image_url": "http://static.metacritic.com/images/products/games/4/5a9cd49caa5bd9026861700d9154e4e6.jpg"}
{"publisher": "Team 17", "genres": ["Action", "Platformer", "3D"], "rating": "E10+", "title": "Yooka-Laylee", "release_date": "Apr 11, 2017", "avg_score": "68", "summary": "Yooka-Laylee is an all-new 3D platformer from the creative talent behind the Banjo-Kazooie and Donkey Kong Country games. Our new heroes, Yooka (the green bloke with no pants) and Laylee (the wisecracking lady-bat with the big nose) were conceptualised from the ground up for stellar platforming gameplay, created by the same character artist behind the rebooted Donkey Kong family and legendary N64 heroes Banjo and Kazooie. Using an arsenal of special moves like Yookas tongue grapple and Laylees tactical sonar blast, players will explore  and expand  gorgeous 3D worlds drawn up by esteemed environment artist Steven Hurst (Banjo-Kazooie series, Viva Pinata) and through skill discover the plethora of delicious collectibles hidden within.", "reviews": [["Areajugones", "Critic", "90", "Yooka-Laylee is the triumphant return of the true platform games. Playtonic has managed to mix everything good of this genre and turn it into something fresh and wonderful."], ["Power Unlimited", "Critic", "87", "Yooka-Laylee at times feels more like a remake of Banjo-Kazooie than a completely new game, that's how much they are alike. But in this case it is only meant in a positive way. The world needs more games likes this, you know."], ["Hobby Consolas", "Critic", "87", "Yooka-Laylee is a 3D platformer like those we had in the past and a great successor to Banjo-Kazooie. The gameplay is almost the same, just putting a chameleon and a bat in the place of the bear and the bird. The true Rare is now called Playtonic Games."], ["LaPS4", "Critic", "86", "Like turning on your Nintendo 64 or your first PlayStation, time freezes and you're stuck in front of your screen for several hours of gameplay mechanics and charisma that are pure joy and in color. Yooka-Laylee is great in almost every respect, in a trip of typical worlds, backtracking with lots of jumps, trials and minigames. It's lengthy, and takes good advantage of Unity engine. Playtonic has been successful: this game evokes the best of Rare."], ["Wccftech", "Critic", "85", "It might not be as good as your vague memories of the hallowed games of Rare, but Yooka-Laylee has a little bit of that old lovable magic in it. It may be made for children, but there is a little something that can make the old and miserable smile again. That alone is worth it."], ["Video Chums", "Critic", "81", "Minor annoyances aside, Yooka-Laylee is a solid 3D buddy platformer that's full of variety, humour, and a fantastic cast of characters all wrapped in a laid back adventure. Who knew a chameleon and a bat could have so much fun together?"], ["Meristation", "Critic", "80", "Anachronistic both in a good and a bad way, Yooka-Laylee recaptures the charm of the 32-bit era collectathon platformers. It definitely is rough in some places, and the overall design would benefit from a little more polish, but it's also a love letter to a forgotten genre that sets a solid starting point for Playtonic Games."], ["PlayStation Country", "Critic", "80", "Yooka-Laylee is a fun retro styled 3D platformer with the buckets of wit and charm that made Rareware games so much fun to play, but along for the ride is a somewhat combative camera system that occasionally gets in the way. If you can overcome this then Yooka-Laylee is an excellent trip down memory lane for fans of Banjo-Kazooie and similar titles."], ["PSX-Sense.nl", "Critic", "80", "A very enjoyable platformer that leans on old-school gameplay, a colourful universe and a lot of content. You really can't go wrong with this one."], ["IGN Spain", "Critic", "80", "Yooka-Laylee is the perfect tribute to the 90's 3D platforming videogames, a very fun experience for new players and an exciting return of the genre to its roots for the veteran players. Long, fun and very funny, its camera becomes a tougher enemy than Capital B, the game's main villain."], ["Slant Magazine", "Critic", "80", "The game isn’t interested in coasting on nostalgia, but in establishing brand-new memories for the next generation."], ["NZGamer", "Critic", "80", "Colourful characters, and enough adult humour to keep you wondering how this is a G rated game."], ["Game Informer", "Critic", "80", "Yooka-Laylee liberally shatters the fourth wall by acknowledging its own existence as a game. Each time dialogue happened between characters, I eagerly awaited jokes about other games. You even get herded through quiz-style sequences; thankfully, these don't serve as roadblocks as much as they do fun allusions to games like Banjo-Kazooie. I laughed out loud at these silly references on multiple occasions, and some of the fun story moments are just as amusing as the gameplay."], ["PlayStation LifeStyle", "Critic", "80", "Yooka-Laylee is a breath of fresh air. Playtonic Games knows platforming, and knows it well. The incredibly precise reactions needed by players, coupled with the lack of some of the genre’s more modern conveniences may turn some newer/younger gamers off. But for those looking for a deceptively deep collect-a-thon that has an entertaining story and wonderfully-crafted world, look no further. With an asking price of $39.99, this is an easy recommendation for platforming fans."], ["XGN", "Critic", "80", "Yooka-Laylee is a celebration of classic games like Banjo-Kazooie and Donkey Kong. If you have ever played those games you will be the happiest person in the world playing Yooka-Laylee. If not, you might be bothered too much by its flaws."], ["4Players.de", "Critic", "79", "Huge nostalgic jump&run marathon with cleverly integrated abilities and puzzles. But towards the end this old school 3d-platformer lacks fine tuning."], ["GamePro Germany", "Critic", "76", "Yooka-Laylee captures the feeling of Rare platformers in an impressive way, but stumbles over flaws with camera and controls."], ["SpazioGames", "Critic", "75", "Yooka-Laylee is a love letter to 3D platformer of twenty years ago. It is everything a fan of the best RARE works can expect, the real Banjoo-Kazooie spiritual successor. Despite some camera issues and the not so smooth controls, it deserves your attention."], ["GRYOnline.pl", "Critic", "75", "Yooka-Laylee doesn't try to reinvent the wheel. It's an extremely classic 3D platformer yanked out from the Nintendo 64 glory days and as such it doesn't quite fit into today's standards. But it's not a bad game - despite an old soul, Yooka-Laylee can provide lots and lots of fun."], ["Atomix", "Critic", "75", "Yooka-Laylee is a good classic 3D platformer which is better in its first hours and levels when you are discovering the wide array of activities and challenges that you have in this retro colectathon. The rest of the time you can suffer with some weak design decisions to prolong the time required to complete the game."], ["Playstation Official Magazine Australia", "Critic", "70", "Much more fun than it is frustrating, and don’t go in expecting evolution. That said, this is still a quill in the cap for a genre that is slowly making a comeback.  [June 2017, p72]"], ["Playstation Official Magazine UK", "Critic", "70", "By turns infectious and infuriating, this is a glorious throwback for the most part, but its inconsistencies hold it back from greatness. Likeable, but flawed. [May 2017, p.77]"], ["DarkStation", "Critic", "70", "As a whole, Yooka-Laylee is an old-school platformer both marred and bolstered by what it introduces. Tedious distractions abound, but the addition of cute and thought-provoking abilities is impossible not to appreciate. Other tweaks lend a greater sense of adventure than the collect-a-thons of old, but again, there are new problems - like that awful camera - that constantly butt their way in. Ultimately, Yooka-Laylee isn't really a categorical improvement or downgrade from its predecessors in the genre; it's just different. If Playtonic Games can produce a sequel that eliminates the problems and expands upon the strengths, we may yet get a true masterpiece. What we have for now is, at the end of the day, a good game."], ["Gaming Nexus", "Critic", "70", "Yooka-Laylee is gorgeous. It is a delight to behold. But its design and mechanics don't always match up to its ambitions."], ["Gameblog.fr", "Critic", "70", "Yooka-Laylee is a good Banjo-Kazooie-like, packed with a colorfull world, good gameplay and a lot of humor. It doesn't reach the level of its model, but is for sure a nice modern alternative."], ["Vandal", "Critic", "70", "Yooka-Laylee is a good game, but not as good as we expected. Great ideas not so well-executed, with minor issues and big ones, including the controls and level design. Still, this type of game has been disappeared for so long that if you like the genre you will definitely enjoy it."], ["The Digital Fix", "Critic", "70", "Yooka Laylee is a great example of what can be achieved with the 3D platform. It is let down only by its lack of motivating narrative progression, and a tendency to get a little monotonous."], ["IGN Italia", "Critic", "70", "Yooka-Layle offers an interesting take on the classic 3D platform formula. It's a pity that it controls and behaves not as expected from some experienced developers as the Playtonic guys are."], ["Metro GameCentral", "Critic", "70", "It perfectly fulfils its brief of being a new Banjo-Kazooie game in all but name, but Yooka-Laylee’s reliance on nostalgia may struggle to find new fans."], ["Everyeye.it", "Critic", "70", "Yooka-Laylee is fun, but it is rarely brilliant; it's pleasant, but not always memorable; and never reaches or surpasses the glorious masterpieces that inspired the team."], ["Hardcore Gamer", "Critic", "70", "Technical issues aside, there’s little to argue against Yooka-Laylee doing a fine job identifying just what makes 3D platformers such a joy to invest in aesthetically."], ["TheSixthAxis", "Critic", "70", "Of all the potential hurdles to snag on in creating a 3D platformers in the style of the late nineties classics, Playtonic deftly avoids the most egregious ones by far. At its very core, Yooka-Laylee succeeds in reviving a format long forgotten and does so with such vigor and passion. However, players shouldn’t expect it to reinvent the genre."], ["CD-Action", "Critic", "65", "Half of the game is wonderful, the other half is frustrating, as Yooka-Laylee stumbles in some key aspects. The character feels floaty which makes controlling him a bit tricky. Some portions of the world seem designed for a different genre and break the flow that is absolutely crucial to platformers.  And then there’s annoying camera. The first Banjo-Kazooie, which is almost 20 years old, is actually more polished than Yooka-Laylee. [06/2017, p.63]"], ["games(TM)", "Critic", "60", "Competent and charming, if a little disappointing. [Issue#187, p.73]"], ["Games Master UK", "Critic", "60", "A throwback to a decade ago, this is a decent game, but needed longer in development. [May 2017, p.81]"], ["Edge Magazine", "Critic", "60", "This characterful, sprawling throwback might well have been considered a classic two decades ago. But, as its creators have patently discovered, it isn't 1997 anymore. [June 2017, p.86]"], ["App Trigger", "Critic", "60", "Misplaced hype? Nostalgia done poorly? A shinier clone of Banjo-Kazooie? Yooka-Laylee is a prime example of all of these things, serving up fifteen passable hours of entertainment yet not managing to surprise at any point along the way. But while those looking to revisit their youth will likely find the game enjoyable enough, Yooka-Laylee is also a testament to why the book should stay closed on the lessons gaming has already learned."], ["GameOver.gr", "Critic", "60", "It treads in a fine line between spiritual successor and blatant rip-off of Banjo-Kazooie, featuring identical design choices with the Rare classics. Nevertheless, it contains a fulfilling amount of environmental riddles and challenging platforming that are hampered from the complete attachment to the past and a camera that quite simple could be considered as the most nefarious villain of the game."], ["Impulsegamer", "Critic", "60", "Yooka-Laylee seems more targeted towards nostalgic adults than the next generation of young gamers. This makes sense, considering who was responsible for helping Yooka-Laylee become a reality, but it’s also a shame. The 3D platformer seems to have all-but-disappeared and I miss the playful, exploratory joy of these children’s games; I think the current generation is losing something due to their absence. Overall, I enjoyed my time with Yooka-Laylee, but I’m disappointed it chose to be a window into the past rather than a peek into the future."], ["GamesRadar+", "Critic", "60", "Evoking the essence of late-'90s platforming without significantly modernising it, Yooka-Laylee is a game with noble aspirations, grounded by clumsily flawed execution."], ["Digitally Downloaded", "Critic", "60", "The potential was there, and this game has certainly been supported well enough by both Kickstarter and Team-17 that budget shouldn't have been a concern either. The issue is, simply, that Yooka-Laylee proves that nostalgia is a difficult beast to wrestle with for game developers. All that being said, I do hope that Playtonic stick around though, as there is the clear potential and passion for the studio to grow and produce a true great in the genre."], ["Push Square", "Critic", "60", "It's colourful, there are collectibles, and it's got a rotten camera: Yooka-Laylee is a 90s platformer to a tee. Unfortunately, rather than a rose-tinted look at the titles of yore, this game falls into all of the same pitfalls as its predecessors: it's rough around the edges, often annoying, and at times even a chore. And yet for all of its flaws it's still packing the most important ingredient of all: the compulsion to collect everything is strong here – and it'll remain even when you're grinding your teeth."], ["Critical Hit", "Critic", "60", "Yooka-Laylee is a nostalgic trip to the past that ignores all the innovations that came after it. There's an appeal to return to a bygone era of platforming, but it's quickly washed away with long stretches of tedious, boring gameplay, and a sense of wit that thinks it's far smarter than it really is."], ["InsideGamer.nl", "Critic", "60", "Yooka-Laylee feels like an old Rare platformer, including many cool challenges, funny characters and colorful audiovisual design. The design of the levels, though, is a big let down. They are so frustrating that Yooka-Laylee is best played in short sessions."], ["Playstation Universe", "Critic", "60", "Yooka-Laylee shows there’s room for nostalgia-flavored 3D platforming in today’s market by reminding us of the joys of well-built, colorful worlds, and daft, fun characters. Unfortunately, the good work put in by Playtonic to modernise the stagnant genre is hamstrung by glaring technical issues that dull the vibrancy, and cloud over your enjoyment."], ["TrueGaming", "Critic", "55", "Yooka-Laylee is an attempt to revive the soul of Banjo Kazooie. However, it has a myriad of problems that prevent it from becoming the great platformer fans had hoped for."], ["Wired UK", "Critic", "50", "When the original is so readily available, and still so thoroughly playable, Playtonic's recreation of the recipe can't help but fall flat."], ["Trusted Reviews", "Critic", "50", "Yooka-Laylee is a nostalgic old-school adventure, but it’s too retro for its own good. Frustrating game mechanics, annoying boss fights and the complete lack of guidance become infuriating as the game progresses...Hopefully, in Yooka-Laylee 2, Playtonic finds a balance between new and old – because it’s quite clear the magic isn't lost; it just needs a few new tricks."], ["Gamer.no", "Critic", "50", "Yooka-Laylee simply doesn't live up to todays standards. Especially when compared to the well designed games we've been served lately."], ["Eurogamer Italy", "Critic", "50", "A heartfelt homage to Banjo-Kazooie, lacking the grace, technical mastery and playability that made the original a classic."], ["Gamer.nl", "Critic", "50", "Yooka-Laylee tries to be nostalgic, but never really gets to the level of the good old platform games from before. Levels are full of technical difficulties and tend to get boring quickly."], ["IBTimes UK", "Critic", "40", "It's difficult to recommend Yooka-Layee to adults let alone the children this game is aimed at. The unbalanced challenge it presents and the lack of in-game direction is sure to infuriate. You could argue kids of this generation could play the game alongside a YouTube video for help, but why should any game need to be played alongside a video guide? The first three-hours of Yooka-Layee are delightful, but after that the experience quickly sours. Playtonic's ode to platformers past should have been something special, but instead it's a reminder why video games have evolved, and why quality over quantity should be the first decree in every developer's rulebook."], ["VideoGamer", "Critic", "40", "ooka-Laylee would fit right into the late 90s with its vague puzzles, wakka-wakka voices, and confusing levels. Time has moved on since the N64, and while there are a handful of bright spots, this sadly isn't the catalyst for a 3D platformer revival."], ["William91", "User", "9", "I much like many people my age grew up right between the jump from 2D gaming to 3D gaming. Rare in collaboration with Nintendo made the jump into the third dimension with incredible ease. Switching from the Donkey Kong Country series into games like Golden Eye, Donkey Kong 64 and of course Banjo Kazooie. Easily my favorite game as a child growing up (and for most of this blog post will be used as a comparison) it was a huge shock to me when Rare and now Microsoft released a glorified cart racer in the place of Banjo Thriee. So admittedly since the announcement of Yooka Laylee back in 2014 I was watching it like a hawk. So did the former Rare team now Playtonic Games capture the magic of the originals? Here is my review of Yooka Laylee for PS4 (also available on Xbox One, PC and Nintendo Switch sometime in the near future) Full Review here http://wp.me/p8GO4V-i"], ["Arma15", "User", "10", "Honestly I do not understand the other reviews, the game is amazing and really fun, and even if it was developped by a much less budget as banjo it is really fun as banjo."], ["AltruXeno", "User", "7", "Yooka-Laylee is precisely what it promised to be: a 3D platformer for the people who grew up playing 3D platformers.  If you remember Banjo-Kazooie, Donkey Kong 64, and other collectathon games fondly, this game may be for you.  If you've never heard of these games or their ilk, then its probably be best to stay away.  I still regularly play N64 platformers at the behest of my 3 year old son, so I am acutely aware of what this game had to offer, both good and bad... because for better or worse, Yooka-Laylee is true to its origins:"], ["UnsafeMuffins", "User", "10", "This game is everything a fan of classic Rare 3D platformers could dream of. It promised to capture the charm and humor of Banjo-Kazooie while also keeping it fresh and bringing in a new and memorable cast of characters, and it does just that. I've personally had no issues with the game whatsoever, the platforming is smooth and easy while the mini-games can be a bit challenging, it's perfect for fans of the Nintendo 64 and modern gaming alike."], ["ThereIsNoSpoon", "User", "5", "30FPS is horrible for this game, and makes it so much more difficult than it should be.  This is a platformer--it needs to be smooth.  I sold this version and picked up the PC version instead, and it's worlds better.  I don't understand why they couldn't hit 60fps on PS4.  This isn't Uncharted 4.  It just feels laggy all over."], ["SuperkenGaming", "User", "6", "Yooka Laylee"], ["KarmaCharmeleon", "User", "8", "Despite some camera issues and maybe some fps problems in the console versions (of which i've experienced none of the PS4 so far), Yooka-Laylee is truly the \"rarevival\" the developers were going for."], ["TheHumbleGamer", "User", "7", "To start, I'd like to say I was a backer of this game on Kickstarter. I won't disclose how much I backed it for here, but I'll say it was quite a lot. I'd also like to say I honestly don't regret backing this game, even though it turned out not to be as good as I (and many others) expected it to be."], ["Marchbaby", "User", "10", "When Playtonic games says there were going for a Rarevival they were telling the truth. Yooka Laylee feels every bit as amazing as their classic platformers on the N64. The sound effects used for the voices may be off putting for some but for old school fans of rare they are one of the many beautiful touches added to make it feel at home with Rare's best days. The music is fantastic as well and it would fit into Banjo's games no problem at all. Even the visuals have that fun, cartoony look that reminds me of yesteryear."], ["L0rzee", "User", "10", "Banjo Kazooie and Donkey Kong Country 64 (Wich is also a big part of this game. People tend to forget that) are two of my all time favourite Videogames. The time i spent in those games as a kid trying to get every thing their is to get in the game and that time times 10 as an grown up laughing about the wonderful british Humor and apreciate the wonderful music by Brent Kirkhope and David Wise."], ["Roybusa", "User", "9", "Excellent game, it is so old school, I don't understand why people argue because the gameplay or voices, this is why people asked for, an real old school game, maybe this will be the beginning of the new old era of video games"], ["BloodyHellMate", "User", "0", "This is the result of attempting to ride the coattails of former successes from an era that has long since passed. 3D platformers dying off was a natural evolution of gaming; working backwards against that flow was bound to produce mediocre results from the very beginning."], ["roo7788", "User", "5", "El juego se puede resumir basicamente como banjo kazooie 3 para el n64 realmete es un juego de n64 recrearon todo incluso los problemas que tenian los juegos de n64 en especial la camara la cual es molesta y tan eratica que lastima."], ["ByYuxiSs", "User", "8", "In if the game is very similar to a classic like Banjo Kazooie and that enchants to me."], ["rubencube", "User", "10", "Undoubtedly the best platform game since n64, the music is great, it gives off pure magic and beautiful gameplay, the dialogues are very well done and they have that spicy Banjo Kazooie spice, awesome game !!!"], ["Patrick17", "User", "10", "This Game is awesome!!! You have big worlds, find 25 (!!!) pagies in each world, everyone is unique and has ist own challenge. The dialogues are funny!"], ["vgmkyle", "User", "10", "First off this is a platformer, and most people are not good at them? Why? I don't exactly know, but the people rating it low for combat are not very smart."], ["200ft", "User", "4", "This game is nothing like the og. Banjo. This is just a big pile of mess. The first world is awesome, I have to give it that. but the rest are just frustrating ugly stages. Every activity you do for a pagie is so boring: fly through circles, kill a bunch of enemies and fly through circles again. Wait for a discount and then maxbe consider buying."], ["OmegaTigerWoods", "User", "3", "The developers turned the game political, which is never a good sign. On top of that, the game is complete garbage, and devoid of the charm the original Nintendo 64 Rare games had. The levels feel emptier than Tooie, the camera jerks at the worst times and the humor is painfully unfunny."], ["MrReviewerMan", "User", "0", "In hopes of cashing in their nostalgia card after its expiration date; Playtonic released a game that really no one asked for or wanted. Yooka Laylee is a \"love letter\" to a genre of games that got married, started a family and moved on with their lives. It offers nothing new to the genre, but instead aims to cash in on old mechanics and gameplay in hopes that the rose-tinted glasses of gamers today would convince them to spend their hard earned money at such a shameless cash grab title. Everything from visuals to audio is mundane or even ear-splitting as the \"mumbling\" that characters do when they talk aren't in any way close to how tolerable it was in games like Banjo Kazooie. Instead, we just have someone making a bunch of grumbles and grunts and passing that off as kosher when there was no mixing or imagination put into said sound design unlike Rare's earlier titles with sound mixing. Gameplay-wise, it's as fresh as that loaf of bread you left in your pantry for a month past expiration. Sure, you can still toast it to make a hot new sandwich but you're still eating a stale, moldy experience that's way past its due date. Controls are stiff, nearly unresponsive when it comes to platforming (which is a huge deal in these kind of games) and the biggest crime of all is the final boss which is nothing more than a shameless ripoff of another famous collectathon's final boss. To conclude, that's what this game is. Shameless. It takes pride in ripping off older genres and adding nothing to them but instead slapping their \"I made this\" sticker on it and calling it their own. Playtonic, if this is the game you're bringing to the table, I surely hope you're ready to take it back to the kitchen and start over from scratch."], ["fykins", "User", "0", "This game is not worthy of being mentioned in the same sentence as banjo kazooie.  There are just so many reasons not to get this game, just another early access game that turned to trash.  Oh sure they took your money upfront and that's exactly why they don't need to deliver at launch time."], ["RidleayRomero", "User", "9", "It may not be perfect, but it is what we were promised in the Kickstarter campaign. I'm having a lot of fun with the game, despite it's many flaws. I was somehow blown away at that the entire game runs on Unity, maybe it's because I don't see it used that much; only a few games I know of use it. The best part is having fun exploring the environments all set to music by Grant Kirkhope, the only bad thing I can find so far is the Snow Plow transformation (which controls like garbage). With what they learned making this game, hopefully the next game will be more critically friendly."], ["jim109109", "User", "9", "I was fully prepared to give this game a 0 because of the developers' unfair treatment of Jon Tron. But, before doing so, I felt it was in my duty to at least give it a try. Turns out the game is excellent, it's exactly the same as playing Banjo Kazooie, take that how you will. I'm the type of guy who still owns a N64 and plays that game. I ended up deleting my pirated copy and purchasing the game. And giving it a 9. Because it may be my favorite game of the year and that makes up for their PR blunders."], ["Lucius_13", "User", "8", "its worthy of being a successor to Banjo-Kazooie (which I'm a huge fan of I still play the first two games to this day on my N64), The Game is beautiful, Huge and The Characters Are Great (although I think Capital B. isn't as great a villain as Gruntilda Winkybunion) as of writing this review I'm not very far into the game but I'm enjoying it, the controls can be sticky at times and the camera does occasionally bug out but that kind of stuff can be fixed with a patch so I'm not concerned about that."], ["Broseph14", "User", "4", "This is one of the most disappointing games of the year. I heard mixed things but decided to take the plunge anyway. Yooka-Laylee somehow manages to get things wrong that games like Jak and Daxter 1 or even Super Mario 64 did excellently. The level design is is atrocious, everything feels like its just been thrown at a wall and left as is. The controls feel slippery and unresponsive. It is very easy to get lost in even the smallest sections of a level and since most locations lack distinctive landmarks you often end up aimlessly roaming around a level looking for the next mini-game/objective. Speaking of which a lot of the mini-games in this game are horrible. The hoop race is an excellent example of how not to implement variety into 3d collectathon platformers, especially when the controls are as bad as they are. You'd be much better off digging out your old favourite collectathons or re purchasing them instead of wasting your money on this."], ["Letiste-Gaming", "User", "9", "Capturar la esencia de Banjoo y Kazooie era una tarea casi imposible, pero para nuestro asombro lo han conseguido con creces, incluso han refinado la jugabilidad para convertirlo en un mejor título si cabe. Es Banjoo-Kazooie 3 en lo bueno y en lo malo. Lo malo es una cámara que nos juega mas de una mala pasada."], ["PabloDesigns", "User", "9", "It's an amazing 3D Platformer, GORGEOUS Music, Nice graphics for an Indie Game, Great Art Style. oh and i love the humor of this game and the 4th wall braking, but i still missed some innovation in the game and a better camera."], ["metachirrup", "User", "7", "This is pretty much what I wanted from the Kickstarter campaign (I'm a backer) but I feel like there was too much box-ticking and not enough vision and enthusiasm in design. Everything is there but not organised with the enthusiasm I believe they had when creating Banjo-Kazooie. I guess they just weren't inspired by this genre anymore?"], ["bubblegumfuji", "User", "10", "Absolutely unique, beautiful, and a blast to play. Yooka Laylee's gameplay is centered around one simple concept: fun. You'll spend the roughly 30-40 hour quest playfully exploring giant colorful dreamscapes filled with a surprising amount of challenges and a plethora of quirky (and quite needy) characters."], ["Sephiwolf42", "User", "10", "Yooka-Laylee is what it set out to be, a faithful recreation of the N64 era 3D Platformer/Collect-a-thon style games. So many people are giving the game low scores but this is undeserved in my opinion. I believe this is due to player expectation and misconceptions about the game before they headed into the buddy duo title."], ["josh8644", "User", "8", "If you enjoy the classic platformers, you will probably get enjoyment from the game, but don't expect anything innovating. If you're happy to just have a game made in the similar style of old then get it! If you want something new then maybe not."], ["OwtDaft", "User", "8", "Story is very basic with some funny dialogue. The 5 worlds and hub are very well designed and a lot of fun to explore. Some of the mini games and challenges are frustrating but most are fun. One of the mini games was very difficult due to input lag. In the game you have many abilities to help you do everything and the worlds have a variety of game play elements, including an isometric area in one. The Rextro mini games you have to play to get pagies, harm the game more than add to it and the game would of been better had these been easier or scrapped altogether. Even after installing updates I had performance issues which would start to appear after playing the game for a long time. I felt like the ending summed up my feelings for the game perfectly when it crashed during the ending credits. Trying to collect everything is a core aspect of the game play and for me this game was doing that very well until the 4th world in which I am prevented from getting a pagie despite doing everything. This bug killed my enjoyment for the game and left me feeling like I wasted my time with it. I will higher the score once the game fixes this bug in a way that doesn't require me to restart the game from the start to earn the PSN trophy. This bug doesn't appear to effect everyone."], ["ignore78", "User", "8", "This game is not a 6.0 its a 8.0. it is really fun to play and looks great. I can bet that those who thinks this game sucks is a teen. Because they dont understand the old school 3d platforming formula. All of the games was like this when i was young. The best."], ["claytastic", "User", "4", "Yooka-Laylee isn't the worst game ever made, but in comparison to it's spiritual predecessor, Banjo-Kazooie, it's an abomination in need of euthanization. It has a couple of good levels at the start, but after that, its just poor design and missed opportunities all around."], ["dubloon7", "User", "9", "Date: 14 October, 2017"], ["badgerryan19", "User", "4", "With all that money with the Kickstater this is what they come up with? This game I understand is a blast from the past kind of thing, but I should of stayed there. The controls are so unresponsive sometimes and the puzzles are downright idiotic. The glitches are ridiculous but the graphics are nice. And the voices I understand as well that its retro but they get so annoying."], ["SuperDuck23", "User", "8", "For the majority of the time, I had a blast playing Yooka-Laylee. The only problem that soiled the fun were the sudden, albeit occasional, spikes in difficulty that really couldn't have done my blood pressure any good. Frustrating moments aside, this is a welcome and solid return for the collectathon genre."], ["roundtablegamer", "User", "8", "Playtonic & Team 17's debut's their game on the shelves, a kind of game we do not get often in this generation of consoles. Yooka laylee a 3d platformer that gives us a flashback to the 90's to Banjo Kazooie, Mario 64 and Conkers bad fur day; which would make sense because it has been developed by some former employees of the hit company Rare. Does team 17's debut game hold up today or should it have been left in the past? let's find out."], ["majr", "User", "5", "While far away from a bad game, it has its fair share of flaws (mainly the camera). I would love to see a tooie and see if they can fix the issues and maybe cut back on the forth wall breaking a tiny bit."], ["SOLIDSNAKEN64", "User", "6", "As a Banjo-Kazooie fan who has found memories of playing it back on my N64 as a kid. I was really stoked when i found out that the creators of the franchise decided to make a spiritual successor since they couldn't make a squeal.  I do love platformers but this game was just ok to me, the story doesn't really pull you in and make you want to read every dialogue box.  I do like the main characters and there are a lot of memorable NPCs.  The world designs are decent but the main world design was terrible trying to figure out where the next tomb is was more of a challenge then some of the in-world puzzles.  Speaking of puzzles they ranged from really easy to hard, and I can say I enjoyed solving them and exploring the different tombs that you have to unlock by collecting the Gold Pagies.  Environments ranged from really cool looking, detailed and unique to dull and lifeless.  The enemies are more annoying than threatening, they could really use a more verity of enemies as well.   Controls definitely need work and tightened up, camera was atrocious, never pointing in the direction that i need even when im the one directing it.  The final boss is a cheating piece of **** I was about ready to rage quit!  I feel like if platonic decides to create a sequel to YL there is plenty of room to improve on."], ["raineye", "User", "10", "Rare can do yet. Donkey Kong and Banjo Kazooie..and Yooka Laylee!!"], ["FromKanga", "User", "6", "Yooka-Laylee was okay, as a fan of Banjo-Kazooie and Conker's bad fur day, I must say I am dissapointed in this game, it's not as bad as other people said but it's still pretty weak."], ["Atari-Dude", "User", "10", "Yooka-Laylee is a great homage to a genre formally thought dead. When I heard about the idea for this game back in 2015, I knew I had to back it on Kickstarter. I finally beat the game on June 18, 2017, and I loved every moment of it. Since the game is developed by former Rare developers, this game has an amazing feeling of how Rare should have continued had Microsoft not bought them out.  Many reviewers are hating on this game because of the frame rate or camera, but no game is without it's problems. Some people think the worlds are either too big or too small. This doesn't matter in the end, as Yooka-Laylee has an amazing set of characters, plot, and graphics."], ["CanadianYeti", "User", "4", "Yooka’s main goal is to remind players of how great Banjo-Kazooie was back in the day, and I feel it accomplished that with me. In my entire time playing I found I’d much rather be playing Banjo than this worse homage to it."], ["Contempt", "User", "5", "First and foremost this game was released incomplete and the consequences to my experience was dire."], ["gambetta69", "User", "8", "SUCH A GREAT GAME! very fun, more dificult than banjo or Mario 64 and many hours to play (35-45 hours to 100%) just that i want."], ["playstation94", "User", "9", "Although it had its flaws, the overall game play was exactly what I expected and was hoping for. As someone who grew up on Jak&Dexter, Rachet&Clank, even Crash Bandicoot and Spyro The Dragon, Yooka-Laylee makes me feel like a kid again. I have absolutely nothing bad to say about the game, the story, or the graphics, It's what I wanted, what I hoped for, and was not disappointed,"], ["Comfortnumb", "User", "10", "I don't understand what's with all the hate with this game, but having played Banjo-Kazooie as a child, I have to say the developers really gave the fans something special. If i could give this game more than i 10 i would. Reminded me of Banjo-Kazooie, but with a twist. Thanks Team 17 for the good times."]], "platforms": ["PlayStation 4", "PC", "Switch", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/6/92133e987732dbc3dc20c0b4f46892c6.jpg"}
{"publisher": "DotEmu", "genres": ["Role-Playing", "Action RPG"], "rating": "T", "title": "Ys Origin", "release_date": "May 30, 2017", "avg_score": "77", "summary": "700 years before the events of Ys I & II, the land of Ys was on the brink of destruction. Demons came in droves and forced the twin Goddesses who ruled the land to whisk their subjects away from the surface, into the safe embrace of the clouds. The demons were persistent, however, erecting a massive tower in pursuit. The battle that raged upon the ground had begun ascending for a second round up above.", "reviews": [["DualShockers", "Critic", "85", "I appreciate what DotEmu has done with the console port of Ys Origin. A story localized this good deserves to be easily accessed by gamers on as many ports as possible."], ["RPG Fan", "Critic", "82", "Ys Origin is a great place to start if you're new to the series like I am. It offers some replayability and the chance to explore the world of Ys, tempting you to delve into the rest of the series. If you already own the PC version, there's not really any reason to pick up this port, as there are hardly any changes. However, I can safely say this is the perfect time to get into Ys; with Ys VIII releasing sometime this year, and the easy accessibility of the rest of the series both on Steam and PSN, you'd be doing yourself a disservice passing up this solid series."], ["Wccftech", "Critic", "82", "While Ys Origin feels like a relic of the mid-2000's, its fast paced combat still stands the test of time and should satisfy fans waiting for Ys VIII's global release."], ["Playstation Official Magazine UK", "Critic", "80", "A total nostalgia bomb from start to finish, this JRPG has all the spells and whistles - not to mention ornate text boxes and a wonderful original soundtrack. Count me in. [Apr 2017, p.91]"], ["Eurogamer Italy", "Critic", "80", "Ten years on his shoulders and Ys Origin is still one of the most enjoyable action-RPG ever made."], ["PlayStation Country", "Critic", "80", "Ys Origin may be over a decade old by this point but the quality shines through. It plays very well, moves at a fair pace and there’s enough content to keep you busy for a long time."], ["God is a Geek", "Critic", "80", "Ys Origin on PlayStation 4 is a great action RPG that will appeal to anyone looking for a mechanically competent and musically magnificent experience from over a decade ago."], ["Hardcore Gamer", "Critic", "80", "Ys Origin is over a decade old and holds up well despite showing its age. It’s not a lengthy game and a single playthrough will only take roughly ten hours, though if one were to want to see the full story with every character, its brevity makes that much more feasible. Being as this is a dungeon crawler centered around climbing a massive tower, the short length makes it just long enough to feel like it is a complete game without overstaying its welcome. Even on easy, the boss fights won’t hand over a victory without a fight, and the nightmare difficulty will challenge even the most seasoned Ys veteran. While this is a fun game and should be played by all Ys fans, I would be more inclined to recommend it to people who are already fans of the franchise."], ["Video Chums", "Critic", "80", "As a huge fan of Ys ever since the beginning of the franchise, I'm thrilled to be able to enjoy Ys Origin on the big screen. It may not be a perfect entry in the long-running series but it's one that genre fans will definitely find hard to put down."], ["We Got This Covered", "Critic", "80", "Ys Origin is a wonderful action-RPG that's a handy reminder to us all that timeless, scrupulous game design often ages graciously, gracefully and beautifully."], ["Vandal", "Critic", "80", "This is a very accessible but deep RPG, very enjoyable and replayable. Spanish-speaking players will also find texts in their mother tongue, something quite rare for games like this one."], ["Hobby Consolas", "Critic", "76", "Ys Origin is a simple but very enjoyable and replayable Action RPG. If you like this genre and the series, don't miss it."], ["SpazioGames", "Critic", "75", "Ys Origin is a good throwback to a time when action RPG were much simpler than they are today, but also a reminder that simple gameplay can be enjoyable and fun even ten or more hours later. The only downsides are a short length and a lack of variety, but this is nonetheless recommended to Adol Christin fans."], ["RPGamer", "Critic", "70", "Ys Origin is a great gateway into the Ys series, as well as another high-quality entry for those who are already sold on the series. Its streamlined approach offers a perfect combination of being able to showcase what Ys is all about without demanding too much of time commitment. Those looking for an engaging experience of combat and exploration should check it out."], ["Destructoid", "Critic", "70", "If you don't mind the game's port-related problems and weird changes, there's a chance that you could still have a good time with hacking your way through its enemies and bosses – especially if you're down with turning your Sony systems into your Ys machines. If anything, it's important for one to see if they can put up with DotEmu's work before they accept their mission to find the twin Goddesses."], ["Push Square", "Critic", "70", "While things can feel monotonous in places, Ys Origin is a fun ride, and a great introduction to the series for newcomers. Existing fans are sure to enjoy the additional story, though - it's one that only adds to an already rich mythology. Feeling like a fresh escape from the hand-holding that's found in many RPGs these days, Ys Origin is also a welcome challenge that's sure to please those looking to test their skills."], ["GameSpew", "Critic", "70", "Despite its age, Ys Origin is a solid dungeon-crawling RPG adventure to rival the best of current gen games."], ["PlayStation LifeStyle", "Critic", "65", "Ys Origin isn’t a great game, even with the various modes, difficulty settings, and characters that unlock for replayability, simply because it’s straight dungeon crawl with little variety. However, these issues prevent Ys Origin from being as good as it could be, and they certainly make it difficult to recommend the title to newcomers of Ys."], ["Letiste-Gaming", "User", "8", "Por un lado, los fans de la franquicia ya lo habrán adquirido (aunque no se trate de la mejor entrega de la misma, ni mucho menos. Ese honor para mi va a Ys: Oath Of Felgana), los que quieran iniciarse en el género de los Action JRPG se me ocurren pocos lugares mejores donde empezar, y, sencillamente, si te gustan un mínimo los videojuegos te gustara."]], "platforms": ["PlayStation 4", "PC", "PlayStation Vita"], "image_url": "http://static.metacritic.com/images/products/games/0/345351b2425c67692664213a84308d40.jpg"}
{"publisher": "NIS America", "genres": ["Role-Playing", "Action RPG"], "rating": "T", "title": "Ys VIII: Lacrimosa of DANA", "release_date": "Sep 12, 2017", "avg_score": "85", "summary": "Adol awakens shipwrecked and stranded on a cursed island. There, he and the other shipwrecked passengers he rescues form a village to challenge fearsome beasts and mysterious ruins on the isolated island.", "reviews": [["Polygon", "Critic", "95", "Developer Nihon Falcom has always been talented, but this project represents a new high for the studio, a game where each piece comes together and interlocks in a way that feels damn near perfect. Don’t let the obscure name fool you; forgettable story aside, this is one of the best action-RPGs of this generation."], ["DualShockers", "Critic", "95", "The truth is after picking up Ys VIII: Lacrimosa of Dana I simply couldn’t put it down until I finished the story. In the end, I found myself attached to many of the characters that I met along the way and part of me wished that this Ys adventure never had to end."], ["Wccftech", "Critic", "95", "It took years for Falcom to develop the perfect entry in the series, and with Ys VIII: Lacrimosa Of Dana, they finally managed to do so by refining the renewed story focus and gameplay mechanics introduced in Ys Seven without taking away what makes the series so enjoyable. With a well-executed, albeit not really original story, charming cast, fast paced battle system, engaging boss battles, tight challenge level and plenty of side-content, Ys VIII: Lacrimosa Of Dana is without a doubt the best entry in the series and one of the best action role-playing games released this year."], ["GameGrin", "Critic", "90", "If you’ve never played a previous Ys game, like me, this is a great game to experience despite the long history and number in its title. Lasting just over 40 hours for me, this is a relatively easy recommendation for even none JRPG fans who prefer more mechanically driven games."], ["The Digital Fix", "Critic", "90", "Aside from the one or two issues it has Ys VIII is a magnificent game, it's fun to play, with mechanics that suit both casual players while giving more hardcore gamers a challenge. The plot is compelling and the characters memorable, while the music is not only enjoyable but also instills a sense of adventure and nostalgia that serves to endear the whole experience to the player. It’s the perfect starting point for new players while remaining true to the saga’s long legacy."], ["Gamer.no", "Critic", "90", "Ys VIII: Lacrimosa of Dana is at times a somewhat enjoyable game that feels stuck in the past. The dominating storytelling however, is brought down by a stiff and unnatural translation"], ["GameSpace", "Critic", "90", "I often found myself torn between pushing the main story forward and doing all the side activities, but the real tell was I just really enjoyed spending time in the game no matter what I was doing. The graphics, music, and game mechanics all work well together to provide many hours of delightful and fun entertainment."], ["RPGamer", "Critic", "90", "Ys VIII puts players back in the shoes of Adol as he sets off on his new adventure. It brings a first class, action-packed and responsive combat system Falcom fans expect, and keeps a high-energy pace throughout the adventure. It also surprises fans with an increased focus on story that pays off with a generally engaging narrative with great pacing, and a cast of simple but varied characters that will keep players interested. Though it doesn't match the technical prowess of other games with a similar visual style, it nevertheless manages to create a highly immersive world and engaging exploration through a wide array of different and interesting environments, a strong soundtrack, and Metroidvania-inspired exploration."], ["ZTGD", "Critic", "90", "Ys VIII: Lacrimosa of Dana is easily the most ambitious entry in series to date, with an expansive world map and a greater emphasis on storytelling. It carries the proud tradition of a skillfully satisfying and lightning fast combat engine, paired with a soundtrack that could only have been composed by the legends at Team JDK. It makes a strong case, not only as one of the best Ys games ever made, but also as a contender for game of the year."], ["We Got This Covered", "Critic", "90", "Despite the rough visuals and occasional storytelling misstep, Ys VIII: Lacrimosa of Dana delivers some of the best music and combat of any RPG out there."], ["Destructoid", "Critic", "90", "Ys VIII: Lacrimosa of DANA has its share of flaws but its very satisfying combat more than makes up for it while the fun exploration and good story kept me going through all of it. Ys fans will love this one, and those new to the series are sure to get some enjoyment with the solid fast paced action that might turn them into fans as well. This is definitely a game I would like to have with me to play if I ever get shipwrecked on a deserted island."], ["God is a Geek", "Critic", "90", "Ys VIII is a fantastic new action RPG from Falcom that is great for getting into the excellent Ys franchise and one that has a ton of quality content and sublime combat."], ["Vandal", "Critic", "88", "Ys VIII is a great adventure, with a solid combat, OST and exploration system. It's not perfect, but if you like action RPGs you shouldn't miss it."], ["4Players.de", "Critic", "87", "The visuals are a little outdated but that can’t take away much from the rest of this gem, that."], ["The Games Machine", "Critic", "87", "Despite some technical issues, Lacrimosa of Dana is a solid game, full of things to do and friendly enough to capture the interest even of those who aren't JRPG enthusiasts."], ["GameOver.gr", "Critic", "85", "A great JRPG which will satisfy friends of the genre as it offers an interesting story, well-written characters, satisfying challenge and a great battle system."], ["SpazioGames", "Critic", "85", "Ys VIII is on of the best episodes (if not the best) of the franchise created by Falcom. A frantic combat system, a huge map and an enjoyable exploration make it a great adventure, not to be missed by any PS4 role playing fan."], ["Areajugones", "Critic", "85", "A must-buy game for the JRPG genre fans that only needs improvements in its story to be almost perfect. The best gameplay mechanics of this saga and one of the big Japanese titles of 2017."], ["Everyeye.it", "Critic", "85", "We did not expect Lacrimosa of Dana to be so deep, hectic, and fun."], ["App Trigger", "Critic", "85", "Ys VIII abandons the sprawling, dramatic settings of other JRPGs for a restrained world and cast, then gives us every reason to fall in love with both. From combat to story to exploration to sound, Ys VIII offers subtle, but refreshing distinctions from the usual genre fare."], ["Hobby Consolas", "Critic", "84", "There is no doubt that Ys VIII: Lacrimosa of DANA is one of the best deliveries of the saga. Despite its small flaws and shortcomings as not being translated into Spanish, it's an ARPG with a scent of Kingdom Hearts and one of the best games of the genre to date."], ["Game Informer", "Critic", "83", "Ys VIII gets its hooks in you with its progression loop; you're always making new discoveries and locating new materials to craft something better. Nihon Falcom also does its best to inject variety when it can, from battles that involve your entire village to Dana learning different fighting styles throughout the game. With a wealth of content to pursue, you always have something to do, even if it's merely fishing or cooking. On top that, Ys VIII has a lot of memorable battle moments; I only wish the story and characters held the same allure."], ["Video Chums", "Critic", "83", "Ys VIII: Lacrimosa of Dana provides more than enough thrilling action RPG gameplay to satisfy fans' appetites. Even though some of the magic is gone, there's no denying that this is one memorable entry in the series."], ["COGconnected", "Critic", "82", "Ys VIII: Lacrimosa of DANA is a heartwarming and interesting journey with fantastic characters and a balanced combat system."], ["RPG Fan", "Critic", "82", "I admit my expectations were perhaps a little high for Ys VIII, particularly because I'm such a fan of this series and this developer. Its weak writing is a grievous misstep, one that stunts the emotional impact of its narrative and characterization by imparting a generic, been-there-done-that tone that is uncharacteristically underwhelming for this series. Those frustrations are mitigated by the joy of discovery, in combing Seiren Isle's nooks and crannies for gorgeous vistas and missing castaways; it's when the action grinds to a halt in service of tedious dialogue that I feel my most keen frustration with Ys VIII."], ["Impulsegamer", "Critic", "80", "While obviously not without its flaws, Ys VIII: Lacrimosa of Dana is one of the stronger, albeit more obscure, JRPG offerings to hit the PS4 this year."], ["Easy Allies", "Critic", "80", "While the narrative doesn't especially resonate, the rest of the game very much succeeds. In other RPGs, extraneous features and side activities feel like they exist merely to tick off expected boxes, but in Ys VIII, they serve a much more significant purpose. There's a cohesiveness to everything that makes the individual components stronger than they would be by themselves. Ys VIII ends up being so enjoyable because of how thoughtfully most of its pieces are considered and implemented."], ["GameSpot", "Critic", "80", "But even when it falters, it’s hard to hate Ys VIII for long. The feel of fighting your way through a big, beautiful island of untamed wilderness to save a group of people brought together by circumstance while uncovering an ancient mystery is an absolute delight, and will compel you to keep exploring for hours on end. Whether you’re a longtime fan or a newcomer to the exploits of Adol Christin, you’ll find a lot to enjoy in the exotic world of Ys VIII."], ["Meristation", "Critic", "80", "Lacrimosa of Dana is, probably, one of the best entries in the Ys series. It's fun to play, there's a lot to discover and, overall, is a really satisfying experience. The story has much room for improvement and graphics are not at their best, but that's probably the only two negative aspects of an overall excellent game."], ["PlayStation LifeStyle", "Critic", "80", "It may take a bit longer for newcomers than long-time fans to take the bait, but once you’re reeled in, you will be hooked. You’ll need to be hooked, because even with a crit-path strategy for completion, it will easily take over 40 hours to get through the mystery of the Isle of Seiren. Fortunately, any action-RPG fan, even those who disliked the Ys series in the past, will find plenty to lure them in and keep them on the line."], ["Playstation Universe", "Critic", "80", "VIII Lacrimosa of Dana is an addicting action JRPG that features great combat and a narrative worth exploring."], ["PlayStation Country", "Critic", "80", "Ys VIII: Lacrimosa of DANA is such a well made game. The controls for combat are top notch and all the systems in place for things like fishing, crafting and exploring make this a very easy game to lose hours to."], ["IGN Italia", "Critic", "80", "Featuring an undeniable retro charm, Ys VIII: Lacrimosa of Dana certainly doesn't stand out for the graphics. On the other hand, the gameplay is fun, frenetic and framed by a pleasing and multifaceted narrative. A title strongly recommended to old-school RPG action fans."], ["RPG Site", "Critic", "80", "Ys VIII: Lacrimosa of Dana is an outstanding RPG that will easily capture the hearts of players. There is so much packed into Adol Christin’s biggest adventure yet. Thanks to the success of the Trails series, Ys VIII’s storytelling received a remarkable improvement over its predecessors. It’s not flawless, but that shouldn’t stop RPG players from missing out on the best Ys game in many years."], ["TheSixthAxis", "Critic", "80", "Ys VIII is, without a doubt, a huge step for the franchise. In stripping away a lot of the usual narrative tropes the series is usually known for, Nihon Falcom have put a fresh spin on the franchise that puts characters and small moments over grand adventures and vast mysteries. Tied together by a fast-paced combat system and great music, the negatives of Lacrimosa of Dana are far outweighed by the positives, and this is a game that any JRPG fan would be a fool to sleep on."], ["Hardcore Gamer", "Critic", "80", "Ys VIII: Lacrimosa of Dana doesn’t deviate far from what Ys games are known for, it just takes what they do and expands on them. The story isn’t Shakespearean, but it’s more developed and interesting than what was shown in previous titles, and while the characters are still trope-based, they have more depth than seen in previous entries and this is on top of improvements in graphics and music composition. Ys VIII: Lacrimosa of Dana shows the series maturing a bit but without deviating too far from what made us fans in the first place."], ["Push Square", "Critic", "80", "Ys VIII: Lacrimosa of Dana is an exhilarating adventure with plenty of secrets to uncover and a wonderous island for you to explore. If you're a fan of the series or are even just a fan of RPGs in general, then Lacrimosa of Dana is an easy title to recommend. Its fast paced combat system and intriguing storyline will keep you hooked throughout."], ["GamePro Germany", "Critic", "79", "Extremely well playable anniversary of the Ys series with brisk action, which however has some serious dramaturgical weaknesses."], ["Eurogamer Italy", "Critic", "70", "Fun and entertaining for those who love the series. Ys haters won't find something to change their mind."], ["nobilki", "User", "10", "this is my first ys game i play."], ["Jaywa", "User", "10", "First impressions were less then I expected. I thought the graphics weren't all that good and seemed a bit childish. HOWEVER after a few hours I realised I was very wrong. This game was absolutely incredible. It kind of reminded me of the epic book The Mysterious island by Jules Verne. The building of the township was a nice extra to feel like you're building towards something. The scenery was great. The story was amazing and I genuinely loved every minute. The only things that I would have liked is a bit better voice acting and more of it as a good portion is text. However the game is absolutely stunning and truly a game to remember. Must play"], ["Gamingking007", "User", "10", "Amazing RPG! iF youre a fan of the ys saga then this is a must! Endless vistas of beauty and an amazing storyline that keeps you hooked at all times!!!"], ["Leon_Magnus03", "User", "10", "YS Lacrimosa of Dana it is a really marvelous game, that was really worth the wait. Your story is nice, with a lot of mysteries, and the main dish is that amazing battle system, it's very fast, so you don't get bored. Play it on the \"Inferno\" mode, is way more difficult than any Dark Souls style games."], ["xBroken2", "User", "9", "A game that had potential to be so much more better. Don't get me wrong, I don't dislike the game, I really enjoyed the gameplay itself, but the story, it was lacking, it could had been so much better. Throughout the game the story progress is VERY SLOW, making the game story feel dull and boring, we're only given small hints of the story after every few camping while exploring the island, the story is very slow pace and finally starts showing some promising signs around 50% into the game(after you find Dana). But even after finding her the story progress was still slow. The game could had been so much better if Dana was introduced more early in the game about 20-30% in would be great and made the story a lot better in ways. With the way how Dana's past story will effect the future they could had worked on in a lot better and made more story out of it. Only problem I had with the game was the story, it could had been more interesting and fun, but overall it was a really fun game to play. Out of all the other YS I played (Ark of Nap, seven, Oath in Felghana, Memories of Celceta), YS VIII story was my least fav. The graphic and gameplay was outstanding, oh and the last boss background was truly beautiful. Would had been a perfect 10 if they just made the story work out better."], ["Tsareena", "User", "10", "Everything about this is a 10/10. Gameplay was perfect, Story was perfect, Graphics were perfect. One thing about action RPG's is that they can easily feel one-note with the gameplay but ys viii really did that with the battle system. The ending also got me in my feelings. Major +"], ["somedude14", "User", "7", "The only aspect this game really nails as far as the Ys formula goes is the music.  The combat is more like Dynasty Warriors and the deeper crafting aspect kind of bungles things."], ["PiePieper", "User", "1", "Yaaawwwnnn just another JRPG. Lazy design, lazy sound, lazy story. Writing I feel is something we've read a thousand times already. Just pass, save your money. No worth your time."], ["danpc", "User", "10", "I absolutelylove this game."], ["chad_pattan", "User", "8", "Finished the game yesterday.  I have played every Ys game to date at this point."], ["AsaZimbabwe", "User", "6", "clearly made for Vita.. pleasant enough, decent polish, but hard to feel inspired by it.. clean, colorful graphics; respectable but plain, uninspired art direction.. semi-interesting story.. semi-engaging combat, leveling & loot system.. generic everything else.. awkward maps, occasionally vague objectives, un-inspiring characters, slow start that doesn't pick up much steam.. extremely weak use of changing a letter from Greek, to Roman to Africa for establishing location & cultural background.. bored within a few days.. not bad, just over it"], ["v4vendetta", "User", "10", "I have spent half of my life playing AAA games but never expected a Nintendo Style old School AAA rpg. Such a refreshing game !! Amazing game mechanics I must say."], ["NexusTsunami", "User", "10", "Ein absolut geniales Spiel!! Nihon Falcom beweist einfach mal wieder, dass ein gutes Spiel nicht durch überragende Grafik (obwohl sie da mit Ys 8 durchaus vorangeschritten sind) oder viel Bombast punkten muss - sondern durch Konsistenz. Die Entwickler bleiben sich ihrem Wesen treu - eine sich langsam entwickelte aber fesselnde Story, ein geniales Kampfsystem, übergragende"], ["dadez1984", "User", "9", "Simply amazing."], ["jpacor", "User", "8", "Ys VIII is one of the best actions RPGs on the PS4, an absolute gem. The gameplay is great, with fast paced and fluid combat, which really shines during boss battles. These battles are very fast paced and can be very difficult, requiring great timing with reaction speeds, attacking and dodging, but are very satisfying and rewarding. The system requires you to use different types of weapons to defeat different types of enemies, requiring strategy to defeat larger groups of enemies, especially later in the game."], ["Vadrael", "User", "9", "While the Graphic isnt the strongest point in the game it still got a lot of good stuff that makes up for it. The World is Big and there is a lot of stuff to do like side quests and collectables."], ["BlueKetsueki", "User", "9", "This game slipped under my radar i nearly didn't buy it not being a fan of YS games or hack and slash RPG games, i had some spare money so i thought why not and i am glad i did was expecting an average game with it being a beefed up ps vita port to the PS4 but can honestly say one the best RPG's i have played for a while core game play here is fantastic and i read some reviews before buying the game saying the story was bad,  i really disagree the story was super weak to start but it really gets going mid way through the game and to be honest is easily on par with most big budget RPG story's just lacks the graphics and shine of course. I will say in summary this game will not be for everyone but for hardcore RPG fans this is a must buy hidden gem of 2017 just don't let the weak  opening 20 mins of the game but you off."], ["vinnysoft", "User", "10", "First Ys game I've played. This game has a beautiful history with every character being charismatic it's own way... The controls also have great responsiveness, making a smoothing gameplay. JRPG fans must play it for sure!"], ["justishar", "User", "10", "This is a really great game.  The difficult name does it no favors and probably limits the number of people who will ever play it, but if you get past this, you're in for a treat.  The gameplay is a lot of fun and the fighting is very fluid and not clunky at all.  This was my first Ys game and I played through with the difficulty on Hard, and I found this gave a pretty good balance of difficulty where the game was challenging but seldom frustrating.  If I could go back in time and advise myself on the difficulty setting before starting the game, I might say to try the next level of difficulty just to get the extra challenge from it, but Hard mode was definitely very well balanced as far as giving the style of gameplay that it claims to.  There are many innovative ways of keeping up the challenge level as the game progresses and the fighting never really feels burdensome, which is quite a feat.  The music is amazing and really adds to the experience.  This is not a Triple A game, but it hangs with the best of them, as I put this game on the same level as games like Persona 5 and The Witcher 3, and in fact this game wins out over both in certain areas.  If I had to list areas for improvement, there could certainly be more time given to character development, as many the characters can be a bit one dimensional, and their stories could be a bit more interesting.  However, overall, the game still works well with the amount of character development provided and is an absolute blast to play, so I give it a 9.5 out of 10."], ["Kaledis", "User", "10", "Coming from someone who plays a lot of games but never can stick to a single one for more than I few hours. I have currently put over 36 hours into this game and I am nowhere near finished with it."]], "platforms": ["PlayStation 4", "PlayStation Vita"], "image_url": "http://static.metacritic.com/images/products/games/0/7fc099300d15e28498d615e204aa78a5.jpg"}
{"publisher": "Konami", "genres": ["Strategy", "Turn-Based", "Card Battle"], "rating": "E10+", "title": "Yu-Gi-Oh! Legacy of the Duelist", "release_date": "Jul 31, 2015", "avg_score": "75", "summary": "Enter the Duelist Simulator to take your place among the finest Duelists ever in Yu-Gi-Oh! Legacy of the Duelist! Players from around the world have been invited to take part in an elite Dueling program that simulates the best Duels across all of Yu-Gi-Oh! history.", "reviews": [["PSNStores", "Critic", "80", "If you are a hardcore fan, or someone who is interested in becoming one, this is the game to buy."], ["Playstation Universe", "Critic", "80", "Yu-Gi-Oh! Legacy of the Duelist is a great TCG offering that comes recommended to newcomers and fans of the series alike."], ["Push Square", "Critic", "80", "Yu-Gi-Oh! Legacy of the Duelist is the ultimate version of arguably one of the best card duelling games on the planet."], ["Digitally Downloaded", "Critic", "60", "Konami would do well in scouting out a new development team to handle the next Yu-Gi-Oh! game. With the last couple being workmanlike but unremarkable efforts, it's difficult to shake the feeling that without an overhaul the star of this particular CCG is only going to fade further. And that would be a pity, because the core card game remains one of the most strategic that we've ever seen."], ["reaidstar", "User", "8", "This game is probably the most well executed titles in the Yu-Gi-Oh! series."], ["ACHATOO", "User", "10", "This game is just good but lacks of voice acting. Legacy of the Duelist is probably the most satisfying Yu-Gi-Oh video game I've ever played. I played the GBA games back when those were big, and this game is much more detailed (and has over 6,000 cards to collect). You also get to relive the duels of all five generations of the Yu-Gi-Oh TV series (Duel Monsters, GX, 5D's, Zexal, and a little bit of Arc-V). But I don't really care about any of those except for the original Duel Monsters series, since that was the one I grew up with. It covers a decent amount of that show, but not as much as I had hoped (the Noah arc isn't there at all, and I think there's a bunch of other stuff missing too). That said, most of the battles you care about are there from the beginning of the show up through the Battle City season. You can either use the story deck or your own custom deck for each duel, and you can even play as the opposing side if you want (giving you a chance to use Pegasus' deck against Yugi, rather than the other way around)."], ["Archangelkain", "User", "8", "If you are looking for a straight good Yu-gi-oh game, then this is the one to get. It has online play, a good story mode, with interesting match ups, and is very worth the $20 price tag. Very nostalgic, for those of us who stopped playing a while ago, and really fun. Also, you can play sealed and draft formats, which is a first for me in yugioh video games. Basically, if you want to get off yugioh pro or duel network to a place where not everyone has every card in existence, and there's a bit more polish, then this is worth it."], ["latinochico", "User", "9", "Do you enjoy playing yugioh? or perhaps enjoyed playing in the past?  if the answer is yes then you should definitely  pick this game up.I have 50 plus of gameplay I finished the campaign and playing multiplayer  online at the moment which is solid by the way.  I would also highly recommend this game to new people that want to get into yugioh cards"], ["FutureDiary805", "User", "8", "I grew up on Yu-Gi-Oh when I was a child. I was 10 years old when the show and cards had released. I had fell in love at first sight and continued to play for 3 years. I had quit for about 6 years and then came back and the love is still there, even though many of the mechanics had changed. I do not like how the way 5ds turned out. But anyway, the game itself is great and has from what I believe all of the cards minus some new ones. The minor complaint I do have is the lack of the new arc not being included, it is nice that the cards are there though. A few of the great adds are the reverse duels which add quite a lot of replayability and the challenge modes. There is also a lack of tag duels in the game which bothers me because they were in the last one. I might be able to understand that they removed it because people wouldn't play the other modes added but tag duels was a big thing. It is still a great game none the less. I would have given it a 9 if it had a tag-duel mode."], ["Rad_McBad", "User", "5", "This game is decent at best. Hardly any of the monsters receive 3D-models, the first player doesn't get to draw a card, and some trap cards which are supposed to stop magic spells don't actually stop them. I think Yu-Gi-Oh could have a much better game if they created a story for it, made sure the rules were correct, and had 3D-models for every card in the game, at least monsters if not all."], ["Cruzi", "User", "8", "It's a solid Yu-Gi-Oh! game and as someone who only played the original card game back in the days, the game offers neat little tutorials that introduce you to the new cards and mechanics that have been added over the years. I had a blast playing through the campaign of the OG Yu-Gi-Oh! series and it was a throw back in the past, being able to play with the same decks as used in the anime serie was really exciting."], ["lamashu", "User", "9", "El juego perfecto para duelistas de yugi, sin historia extensa y aburrida simplemente las campañas de cada serie y listo, el juego te motiva a ganar y obtener puntos para desbloquear mazos lo cual hace que quieras jugar y jugar y jugar, y siempre vuelve esa nostalgia de la niñez cuando juegas con cartas clasicas, muy bueno la verdad. Es ideal para probar mazos y combinaciones de cartas que a uno se le ocurran, los desafios de duelista estan muy bien ya que la IA pesee muy buenos mazos que rapidamente quieres armar y poder usar (aqui todo consiste en prueba y error, probar y sacar cartas como en la vida real). El problema que le veo es el de no poder desbloquear cartas a gusto (cuando ganas o compras el pack de cartas las que te vienen son al azar) por lo que gastas muchisimas horas jugando para obtener una carta que quieres y termina siendo muy frustante. No me gusta para nada el hecho de no incluir la campaña del arco 5 de yugioh aunque almenos hay cartas pendulo por lo que no es tan terrible. Excelente juego si lo que se quiere es revivir la infancia y eres fanatico de yugioh."], ["salamanca", "User", "7", "Growing up, I played the original Yu-Gi-Oh! card game with just about anyone I could find. My brothers, my friends, and even my dad (who didn't have any idea what he was doing)."], ["dylan323i", "User", "6", "Overall this game is rather fun albeit cheese! But there were some issues I saw with it."], ["Longoria92", "User", "4", "online mode is so umbalanced but apart that game is ok if you are a fan in my case I regreat I was expenting more 3d atacks not only on important monster like blue eyes dragon and it take a long timw to get good cards is a good game but not enought for me or for being in ps4 it is a vita game or a wii game not quality in graphics or sound"], ["Phoxly", "User", "0", "The largest and most fulfilling feature in Yu-Gi-Oh of the last generation on the PS3 and Xbox 360 was Tag Dueling."], ["josesueiro", "User", "8", "in Yu-Gi-Oh! Legacy of the Duelist! Players from around the world have been invited to take part in an elite Dueling program that simulates the best Duels across all of Yu-Gi-Oh! history. Replay actual events in the Yu-Gi-Oh! timeline, from the original Yu-Gi-Oh! series up to Yu-Gi-Oh! ZEXAL, featuring the storylines, characters, and Decks in a brand new Story Campaign. Duelists will also Duel against characters from the newest generation of the Yu-Gi-Oh! TV series."], ["Ace_", "User", "1", "No tag battles."], ["XxJoseManuelxX", "User", "8", "in Yu-Gi-Oh! Legacy of the Duelist! Players from around the world have been invited to take part in an elite Dueling program that simulates the best Duels across all of Yu-Gi-Oh! history. Replay actual events in the Yu-Gi-Oh! timeline, from the original Yu-Gi-Oh! series up to Yu-Gi-Oh! ZEXAL, featuring the storylines, characters, and Decks in a brand new Story Campaign. Duelists will also Duel against characters from the newest generation of the Yu-Gi-Oh! TV series."], ["Joshybhoy4699", "User", "10", "Love this game, really impressed by it, you can make so many decks, and love the storyline (just wished it was free lol)"]], "platforms": ["PlayStation 4", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/0/3789b6812a3bc60c9edbd914a6b7283f.jpg"}
