{"publisher": "Zen Studios", "genres": ["Action", "Miscellaneous", "Parlor", "Pinball"], "rating": "E10+", "title": "ZEN Pinball 2", "release_date": "Dec 24, 2013", "avg_score": "82", "summary": "Zen Pinball 2 is full of exciting Wii U GamePad features such as controlling the plunger on the touch screen, rotating camera views, accessing information via the dot matrix, and Free View control by tilting the Wii U GamePad. Additional features include:", "reviews": [["ZTGD", "Critic", "95", "If you enjoy pinball in any shape or form, Zen Pinball 2 is a must download."], ["Destructoid", "Critic", "95", "Zen Pinball is a must-have anywhere you can grab it, and Zen Pinball 2 specifically on PlayStation 4 is equally just as desirable -- if not more-so."], ["Gamers' Temple", "Critic", "90", "From Soho down to Brighton, it's the best videogame version of pinball you'll find."], ["Playstation Universe", "Critic", "90", "A word of warning though: unless you really understand pinball and the strategy behind it and what all the individual lights, holes, ramps and bumpers mean on each table you won’t get the best out of Zen Pinball 2."], ["Gamestyle", "Critic", "90", "Zen Pinball 2 is the game for the more casual fan, but pinball enthusiasts will also have a great time, despite the physics not quite being 100% realistic. The buttery smooth 60fps in 1080p also does wonders for the experience and this is the best version of a Zen made pinball game yet."], ["IGN Italia", "Critic", "80", "There's no added benefit to the PS4 version. It's just the same game with the same tables we've come to adore on PS3, but that doesn't stop it from being a  very good game."], ["Vandal", "Critic", "80", "The great pinball simulator we already know arrives on PS4 letting us download all the tables we've already purchased on PS3 and PS Vita versions. There's no new additions, but the experience is as good and addictive as it is on other platforms."], ["COGconnected", "Critic", "75", "As it stands, the game is a fun romp, but only if you can get past the differences from real pinball psychologically."], ["SpazioGames", "Critic", "70", "Solid, fun, free and cross-buy. There's really no reason not to download Zen Pinball 2 on PS4. The table included free - Sorcerer's Lair - is of excellent quality and will entertain a lot. If you have some friends to share the charts, in addition, the value of this product rises dramatically."], ["Push Square", "Critic", "70", "After its enjoyable outings on previous platforms, Zen Pinball 2 has arrived on the PS4 in good form. Assuming that you can get past the inflexible purchasing options and cut through the sometimes overwhelming digital gloss, you’ll find a flipping fun game with an addictive core at its steel-coated centre."], ["Eurogamer Italy", "Critic", "70", "Zen Pinball 2 for PlayStation 4 is a solid pinball game like the PS3 and Vita versions, but unfortunately there’s a small delay with flippers and DualShock 4 controls. Owners of PS3/Vita versions can automatically download tables purchased in the past at no extra cost, which is nice since Pinball Arcade doesn’t allow you to do that."], ["DarkStation", "Critic", "60", "It is not a bad experience, but it is probably not the one that should be at the top of your wish list."], ["ivansword", "User", "9", "Also known as Pinball FX2, it arrives on PS4 with the ability to bring up to a reported 20 tables with it.  Running at 60 FPS, the action is as smooth as should be expected, details are gorgeous, and the game is more responsive than it has ever been.  Owning all the tables on nearly every available platform, I can say this gives my high end gaming PC a run for the money while playing the Steam versions.  3d capabilities have not been tested yet; however, if they are as solid as they were on PS3 (aside from some minor convergence issues) the tables should display marvelously given a quality display.  Ignore complaints of being charged with tables... is this not the trend anymore?  Zen has followed this model for years, and this should be expected as such.  Certainly you will get a table for free, but they provide quality demos of each table for individuals to make their own decisions and pay for the ones the choose.  Beyond that, the tables are loosely inspired by real world tables, and carry some elements of love from their reality based counterparts, though they may not be recognizable to a younger generation.  The physics are getting better, but this is more of a fantasy simulation pinball.  If you are expecting anything more, than look to Pinball Arcade, a worthy mention replicating real tables.  Zen has managed to produce Pinball tables that have great rule sets, awesome challenges, and offer hours of fun, depth, skill development, and will rank you on leaderboards.  Seriously, Zen tables run about $3.00 a table.  In my experience, that is $3.00 of happiness.  Not all tables are winners, that's why they offer demos, but there's bound to be a table that everyone who claims to be a pinball fan can enjoy.  Why are you still reading...?   Give Zen a whirl, and try a table or two.  At the end of the day, you will have likely spent more money on your lunch, coffee, or some App on a phone you may hardly use.  Obviously I am a fan; however, I am a fan because the tables are worth the time.  Few games have the ability to earn my time, and like all good things... Zen will keep you coming back if you let it."], ["Superdooper", "User", "0", "This game lures you in with a freebie price tag but you have to buy tables to play it.  There is one free table.  After that you need to buy packs in order to play.  Developers are figuring out freemium games of this nature are more profitable than just making it cheap and offering a small variety with in game purchases for those that want more."], ["keithianw", "User", "9", "I think this is a solid game, one of the better pinballs games with very good sound effects. Also, which many reviews forget to point out, in 3D it looks awesome if you have a good 3D set. My glasses are very light so wearing them doesn't bother me. Highly recommend if you like Pinball."], ["PogaYoga", "User", "5", "My favorite aspect of this pinball game is that you can toggle the slow motion effects and flipper sensitivity that works to your playstyle. It's a worthwhile game if you're into pinball or really bored and just browsing the shop for something that might stand out. It's a solid pinball game, nothing more, nothing less."], ["Batfinkskinner", "User", "6", "Good for a few games to pass the time but not the worlds most amazing experience.  Nice visuals and sound but the fun minigames and action scenes are few and far between."], ["Psvitalife", "User", "10", "Avengers Assemble once again!, as your favorite heroes return to the tables for yet another pinball classic!"], ["taroko", "User", "0", "They charge $10 for each and every terrible licensed level... Star Wars $10, Hello Kitty $10, Dora the Explorer $10. They are just scamming obsessive fans."], ["rukastar", "User", "9", "I'm really not a pinball fan, but I think this is one of the only \"great\" PS4 titles at the moment so far. Of course as the Star Wars fan I am, I was compelled to buy two of the $10 dlc packs, which see constant play from my friends and I as we set out to get the trophies and set higher scores!!"], ["hunter328", "User", "10", "Zen Pinball 2 should win Game of the Year every single year.  Each year they release around 10 or so new tables and even the worst of them is still great fun.  Whether you play on PS4, PS3, or Vita, the game is great, and one purchase covers all three platforms. Zen Pinball 2 is the one game that keeps my PS Vita from gathering dust.  Having 60+ awesome pinball tables to play whenever and wherever you want is heaven. A must buy for pinball fans and a game that could easily turn non-pinball fans into pinball wizards."], ["robdot", "User", "8", "I don't see it mentioned anywhere, but this does play in 3d, which looks awesome. I only have played the free sorcerers lair table, but. It seems pretty cool for what it is, I just wanted to put the 3d thing out there, I don't see it advertised anywhere .."], ["Lime_4444", "User", "9", "I found this to be a very good pinball game! Love the oldscool pinball games also but this makes it interesting with the new version and lots to watch while playing!"], ["Gisherjohn24", "User", "10", "I'm not seeing the lag that people are speaking of in this game, perhaps was patched since the initial reviews went out. Either way, I can honestly say this is the most amazing pinball games I've ever played. Seems to look, and play smoother than the ps3 and 360 version counterparts. It's a true addiction for any self righteous pinball fan. The Star Wars boards are absolutely fantastic and have a few new exclusive tables for next gen. The Sorcerers board is probably the best, you need to get this game now. Most tables are 2.49 each."], ["ColtDiesel", "User", "10", "Really great game. It's a 3D game that is extremely fun to play. The unrealistic elements that are not seen in a true cabinet like Pinball arcade separates it from other great pinball games (I really enjoy pinball arcade as well). I hate that 3D is a \"fad\" because it greatly enhances immersion. The tie fighter table is my favorite, with Iron Man in a close second."], ["Ignius", "User", "9", "Very fun pinball game, one of the best I've played.  The animations are well done on the tables, I also like the option to play in 3d.  Fun and addictive game."], ["ravenclaw77", "User", "9", "At the time of writing, the average user score is 7.0  One person gave it a zero and the only thing they didn't like was the pricing, which I find totally unfair for a reviewer to do. The game is 'free' but you only get 1 table. You can demo every table before buying, and they're under $3 each. If you're a pinball fan, this is a fantastic value for many many hours of gaming."], ["kelman66", "User", "10", "Fantastic pinball game.  Yes its fantasy pinball and they do things you cant do in real pinball but the tables are wicked fun. Of course you have to pay for tables but they are cheap at around 2.50. Can easily burn that in a real pinball game in about 5 minutes.  BUT if you own it on PS3 you can download your tables free.  A few new ones to purchase if you want as well."], ["MAD_GAMER_210", "User", "8", "Great pinball game, fun to pass the time and many tables to choose from.i like it , my kids like it and table packs aren't expensive. Great visuals and effects...."], ["tsakiym", "User", "7", "I do not have to say anything more. But i need to write one hundred and fifty characters. i think my score can describe it............................"], ["Nel", "User", "5", "A \"Free\" to play game which includes almost no free game content. The game reminds me of many other classical pinball games. Would have been better as a game which you could have bought and got the full content."]], "platforms": ["PlayStation 4", "PlayStation 3", "PlayStation Vita", "Wii U"], "image_url": "http://static.metacritic.com/images/products/games/8/43e3ce316493d2b368ca6e96520b336d.jpg"}
{"publisher": "Zen Studios", "genres": ["Action", "Pinball"], "rating": "N/A", "title": "ZEN Pinball 2: Aliens Vs. Pinball", "release_date": "Apr 26, 2016", "avg_score": "84", "summary": "Survive Xenomorph encounters in three thrilling pinball tables inspired by the ALIEN franchise.", "reviews": [["ZTGD", "Critic", "90", "These are some really well made pinball tables wrapped around one of the best horror/sci-fi franchises ever created."], ["We Got This Covered", "Critic", "90", "Zen Studios has a knack for creating licensed pinball tables. With this outing, they've managed to capture the feel of Alien while also making three fun pinball tables that will keep you playing for months to come."], ["Digitally Downloaded", "Critic", "90", "These tables are so beautifully designed with all kinds of challenging scoring opportunities."], ["High-Def Digest", "Critic", "90", "Fans of 'Aliens,' myself included, should be pleased when they see Ripley and co in action in a pinball setting. It certainly makes me think of the heyday of licensed pinball tables."], ["GameCritics", "Critic", "85", "While I’d say that the Aliens vs. Pinball pack delivers great value for money overall, the Aliens table all by itself is an absolute knockout. For fans of Aliens or of Zen Pinball 2, picking this one is the definition of a no-brainer."], ["Gaming Age", "Critic", "83", "If you're a fan of the Alien franchise and pinball, this is a must buy."], ["Brash Games", "Critic", "80", "It manages to encompass some of my favourite movies with one of my most beloved genres. Not only does it do it well but it also adds a few new interesting features which I look forward to seeing in any future titles they do."], ["DarkStation", "Critic", "80", "Like the majority of tables they release, the Aliens Pinball Pack is an overall positive for pinball fans. It does a great job of capturing the essence of the licensed properties, and Zen Studios goes above and beyond with the actual Aliens table by using the voices from the movie itself."], ["Destructoid", "Critic", "80", "Aliens vs. Pinball is great, both as a novelty and as a serious set of tables. Whether you're just a fan of Aliens stuff and like the idea of a fun way to kill a few minutes here and there, or the kind of fanatic that will obsess over a table, playing over and over again to complete all the objectives and set a massive score, you can't go wrong."], ["COGconnected", "Critic", "75", "Tables are designed well, being easy enough for casual pinball players but challenging at the same time to satisfy those who have played pinball games. It does tend to lean more towards the easier side, but not by much. Easy to play, creepy tone, and addictive gameplay all combine in this set, making it the perfect way to get your pinball fix and celebrate Alien Day."], ["AchieveAddicts", "User", "8", "The Good"]], "platforms": ["PlayStation 4", "iPhone/iPad", "PlayStation 3", "PlayStation Vita"], "image_url": "http://static.metacritic.com/images/products/games/7/86b2f39311c40f86cbf6cc40659a69cf.jpg"}
{"publisher": "Zen Studios", "genres": ["Action", "Pinball"], "rating": "N/A", "title": "ZEN Pinball 2: Ant-Man Pinball", "release_date": "Jul 15, 2015", "avg_score": "81", "summary": "N/A", "reviews": [["Gaming Nexus", "Critic", "85", "Despite having a bit of a learning curve, Ant-Man has quickly become one of my favorite tables that Zen has produced. It really ties in well with the Ant-Man character and world without having to retell the events of the film."], ["ZTGD", "Critic", "85", "While still not driving it out of the park like they did with Wild West Rampage and Venom, Ant-Man is a solid table that I suggest pinball fans pick up. It has some unique things going for it, and stands out more than the last Marvel table, Age of Ultron."], ["Gaming Age", "Critic", "83", "There's plenty to do, a great mix between easy and very difficult shots, and solid visual effects. It's a creative table. It requires plenty of play before giving up the big scores, and the journey is a pleasure – can't ask for much more than that."], ["Softpedia", "Critic", "80", "The new Ant-Man table for Zen Pinball shows that the development team at Zen Studios can deliver great work when it is dealing with the intellectual property of other companies and Marvel seems to have made a particularly good partner."], ["DarkStation", "Critic", "70", "I would recommend this content to any fans of pinball or Ant-Man."]], "platforms": ["PlayStation 4", "PlayStation 3", "PlayStation Vita"], "image_url": "http://static.metacritic.com/images/products/games/98w-game.jpg"}
{"publisher": "Zen Studios", "genres": ["Action", "Pinball"], "rating": "N/A", "title": "ZEN Pinball 2: Balls of Glory", "release_date": "Oct 20, 2015", "avg_score": "78", "summary": "Balls of Glory combines four hit animated TV show properties: FAMILY GUY, AMERICAN DAD!, BOB’S BURGERS, and ARCHER, representing one epic pinball experience and features voice talent and sound effects from each hit TV show.", "reviews": [["Gaming Age", "Critic", "91", "Zen Studios continues to knock out new properties while keeping up the high level of quality that we all expect from their tables. With the exception of my annoyances with the Archer table, playing some of my favorite shows in pinball form was great fun."], ["ZTGD", "Critic", "90", "All in all, this is a pretty great pack that has some really well done tables in it. There are a few hiccups with the Archer table, and while it wasn’t my cup of tea, people have different tastes in pinball tables. Even then, there is a lot to have in the Balls of Glory pack. Zen Pinball players should pick this up without a doubt. More pinball is always a good thing and Zen knows how to make some fun tables."], ["Gaming Nexus", "Critic", "85", "While the visual style of the cell-shaded tables took a little getting used to, the overall pinball experience proved to be fantastic. Fans of these shows will definitely enjoy seeing how Zen has adapted them to the pinball world, especially those who love Family Guy and Bob’s Burgers."], ["DarkStation", "Critic", "80", "That leaves the package, as a whole, as entirely worth it, and another set of great additions to Zen’s ever growing library."], ["Softpedia", "Critic", "80", "Zen Pinball 2 - Balls of Glory is a solid collection of tables for Zen Pinball 2 that can deliver tens of hours of gameplay for a gamer who is a fan of all the featured television animated series included."], ["COGconnected", "Critic", "75", "If you are a fan of these shows, you owe it to yourself to pick up this pack. If you are a pinball fan and a fan of these shows, it’s pretty much a no-brainer."], ["GamingTrend", "Critic", "75", "Pinball is pinball, but Zen Pinball 2 always tries their best to make an interesting product and has succeeded again with the Balls of Glory pack."], ["Brash Games", "Critic", "70", "Zen Pinball has an amazing sense of physics for the most part, only let down by overactive bumpers."], ["Digitally Downloaded", "Critic", "60", "This particular package is limited in appeal to only the most committed fans of each series. The kinds of fans that could watch the same episode of Family Guy, American Dad, Archer or Bob’s Burgers over and over again and not actually become bored with it."], ["cambodia36", "User", "8", "I really, really wanted to like Archer, but the Archer table is the weakest of the 4. No rhyme or reason to the skillshot, rule set seems complicated, and the setup of the table is weak. Aforementioned skillshot is more luck than skill, Archer's car placed near the front of the play field largely gets in the way. Only 1 upper playfield flipper adds little, mini games are dull."]], "platforms": ["PlayStation 4", "iPhone/iPad", "PlayStation 3", "PlayStation Vita"], "image_url": "http://static.metacritic.com/images/products/games/3/631df36ee16683cf37d8893e0b7f920e.jpg"}
{"publisher": "Zen Studios", "genres": ["Action", "Pinball"], "rating": "N/A", "title": "Zen Pinball 2: Bethesda Pinball", "release_date": "Dec  6, 2016", "avg_score": "79", "summary": "N/A", "reviews": [["DarkStation", "Critic", "100", "Individually, the three tables on offer in the Bethesda Pinball Pack are all entertaining, with DOOM easily topping the pack with sheer attitude and atmosphere. Together as a pack, these tables represent the strongest outing of pinball that Zen has had since the Ball of Glory pack earlier this year, with this one coming in higher overall because there’s no American Dad table holding it back. Recommending this one is a complete no-brainer. Now excuse me, I have a Nightmare run to get back too, cause these demons aren’t going to kill themselves."], ["ZTGD", "Critic", "95", "Any fan of pinball will have a great time with these and even some fans of RPG will get a little out of them. It really is an interesting bunch of tables that any Zen Pinball fan should add to their library."], ["CD-Action", "Critic", "90", "Bethesda Pinball is a great package as three tables are completely different from each other in terms of atmosphere, gameplay design and appearance. The important part is that they don’t just capitalize on sentiment but are great on their own merits. [02/2017, p.40]"], ["GamingTrend", "Critic", "85", "Bethesda Pinball is an impressive collection of pinball experiences based on Bethesda’s A-List hits Skyrim, Fallout, and Doom. Surprisingly complex and dynamic, these tables do a great job of capturing the feel of the game they represent while staying true to the classic pinball dynamic. Visually pleasing, challenging, and highly replayable, these tables are a perfect addition to your Zen Pinball 2 collection."], ["GameGrin", "Critic", "70", "Bethesda Pinball offers an enjoyable amount of content for lovers of the studio's franchises and fans of the classic arcade game."], ["GameCritics", "Critic", "70", "As a trio, the Bethesda Pinball pack is a solid collection. DOOM alone is worth the price of admission, and Fallout 4 is a great-looking table with a few unnecessary mechanics. Skyrim isn’t bad, just a little overcomplicated and a bit too slow for my taste, although I daresay fans of the source material will get a kick out of it. Overall, Zen Studios continues to give pinball fans a great way to continue to experience the game they in a new, yet pleasantly retro ways. Real-life pinball machines might be hard to find, but the game remains alive and well… in digital form at least."], ["COGconnected", "Critic", "70", "This is a pack for pinball enthusiasts who also love Bethesda games. That might not seem like a hug leap but it creates a dilemma: it isn’t good enough to convert fans of either camp to the other. The tables are fun, but so are many others."], ["Destructoid", "Critic", "70", "The Bethesda Pinball pack is an odd proposition. The tables are spectacular looking and all the little touches and gameplay twists are ambitious and creative in a way I really enjoy thinking about. But, both the Skyrim and Fallout tables are held back by small annoyances and wonky design choices that just make them less fun to play than they should be."], ["High-Def Digest", "Critic", "70", "'Bethesda Pinball' is easily Zen Studios' most ambitious project yet. They really went all out making sure each table feels like the game it's based upon, but that leads to mixed results when it comes to digital pinball. 'DOOM' is the real standout addition, with the two role-playing game tables getting too overly complicated. While it may not pull off every idea it attempted, I'm glad that Zen Studios isn't afraid to take risks, and that's exactly why this is still a pinball pack that is worth checking out even if it's not the developer's best adaptation."], ["hunter328", "User", "10", "This set of three tables, Skyrim, Doom, and Fallout, is one of the best that Zen has ever released, and since they rarely release any tables that aren't terrific fun, that's saying something.  All three offer different gameplay styles, from Doom's fast and hectic action, to Fallout's more calculated, strategic approach, to Skyrim, the real gem of the set, which manages to meld an RPG with a pinball table and create something with the best aspects of both."]], "platforms": ["PlayStation 4", "iPhone/iPad", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/6/b2aa8ff5eff32a717147fd4bd452679b.jpg"}
{"publisher": "Zen Studios", "genres": ["Action", "Pinball"], "rating": "N/A", "title": "ZEN Pinball 2: Iron & Steel Pack", "release_date": "Feb 25, 2015", "avg_score": "82", "summary": "The Iron & Steel Pack, an exciting new pinball two-pack featuring a table based on the CastleStorm franchise as well as a Western-inspired table dubbed Wild West Rampage.", "reviews": [["ZTGD", "Critic", "90", "If you’re into pinball, particularly ZEN Pinball, the Iron and Steel pack is yet another great addition to an already solid library."], ["Gaming Nexus", "Critic", "85", "Both tables in the Iron & Steel Pack, at first glance, fall back on overly generic themes, but Wild West Rampage tells the more interesting story with its genre's tropes, but CastleStorm makes you earn its love."], ["Atomix", "Critic", "80", "Storytelling through a pinball table is not easy, fortunately there are developers like Zen Studios that give us stories and messages in this format. The Iron & Steel Pack is full of classic pinball fun with the freedom of the developer that this time is not limited by a license."], ["Digitally Downloaded", "Critic", "80", "If you're new to Zen Pinball 2, then this DLC pack won't be the most appealing, as it is more likely that the Star Wars and Marvel themed tables will be more attractive. But, once you've got all of those, these two tables do add even more value to the package."], ["GameCritics", "Critic", "75", "While they're certainly a strange pair, I'm glad Zen combined these two tables into a single five-dollar package. While I quite probably would have paid three dollars for CastleStorm, I doubt I ever would have taken a chance on a complete unknown for the same price. Maybe their plan was to convince people to throw a little extra money at a dud by attaching it to something with brand recognition, but in the end, the unknown was the real gem."]], "platforms": ["PlayStation 4", "PlayStation 3", "PlayStation Vita"], "image_url": "http://static.metacritic.com/images/products/games/6/9290d01562ab25c62612e9b55b788e10.jpg"}
{"publisher": "Zen Studios", "genres": ["Action", "Pinball"], "rating": "N/A", "title": "ZEN Pinball 2: Marvel's Avengers: Age of Ultron", "release_date": "Apr 22, 2015", "avg_score": "65", "summary": "Inspired by Marvel's Avengers: Age of Ultron, the epic follow-up to the biggest Super Hero movie of all time, this table will let you experience when Tony Stark jumpstarts a dormant peacekeeping program and things go awry for Earths Mightiest Heroes, including Iron Man, Captain America, Thor, The Incredible Hulk, Black Widow and Hawkeye, as they are put to the ultimate test as they battle to save the planet from destruction at the hands of the villainous Ultron.", "reviews": [["ZTGD", "Critic", "80", "It is well worth the three bucks, but when I compare this to the other tables Zen Pinball has released recently, it just feels slightly lackluster. Nevertheless, fans of the Zen Pinball franchise should look into Age of Ultron. It’s not bad, just not a big standout from the other tables released on the platform."], ["COGconnected", "Critic", "79", "If there is one annoying characteristic… it is the complexity of combinations you have to pull off."], ["Atomix", "Critic", "75", "Packed with different difficult levels, tons of fan service, interesting minigames and explosive multi-ball modes, Avengers: Age of Ultron Pinball is a perfect companion for those who enjoyed the movie and a nice addition to the broad catalogue of Zen Pinball 2."], ["Gaming Nexus", "Critic", "74", "Marvel’s Avengers–Age of Ultron looks like a 10-car pileup glued together with overly looping dialogue and a few forgivable missteps. Even without prior existing knowledge of these superheroes' thoughts and motivations, it’s still a challenging table with subtle rewards."], ["GameCritics", "Critic", "50", "Fans of the blockbuster might enjoy the set dressing applied to this pinball table, but those looking for a solid pinball board underneath the veneer might be left wanting."], ["Gaming Age", "Critic", "50", "On the positive side, I did like the idea of a two-ball multiball prelude to open the table up with, where you help Iron Man construct the Ultron A.I. It’s also somewhat neat to see it built as an optional thing, even though I’m not sure I fully understand why you would want to skip it. Also, if you manage to get the four-ball multiball for the final event, it’s so chaotic that you can’t help but smile at the mess, even if getting to this point is more frustrating and boring than it’s worth."], ["GamingTrend", "Critic", "45", "Zen Pinball 2’s Age of Ultron table doesn’t offer enough fan service to appease any level of Avengers fan, and there aren’t enough interesting mechanics to excite a virtual pinball fan."]], "platforms": ["PlayStation 4", "PlayStation 3", "PlayStation Vita"], "image_url": "http://static.metacritic.com/images/products/games/98w-game.jpg"}
{"publisher": "Zen Studios", "genres": ["Action", "Pinball"], "rating": "E10+", "title": "ZEN Pinball 2: Portal Pinball", "release_date": "May 26, 2015", "avg_score": "83", "summary": "Zen Studios, in collaboration with Aperture Laboratories and Valve, is proud to present the Aperture Science Heuristic Portal  Pinball Device, proving that persistent experimentation is not only the hallmark of good science for the benefit of mankind, but also incalculably fun!", "reviews": [["GameCritics", "Critic", "90", "The Portal add-on to Zen Pinball 2 is another excellent addition to the already-strong lineup of tables available, and having played most of the selections on offer, I'd say this one ranks right near the top. For anyone who loves Portal, pinball, or both, this is an absolute no-brainer."], ["COGconnected", "Critic", "90", "Zen Pinball 2: Portal Pinball is a marvellous experience which makes you want to pull out the Portal games and play them all over again."], ["ZTGD", "Critic", "90", "Zen Studios has done a great job with this table that both pinball and Portal fans can enjoy."], ["Softpedia", "Critic", "90", "In a nutshell, it's a great table for newbies and pinball wizards alike, that can offer tons of fun even to those who are not particularly crazy about flipping metal balls around, but are into Portal."], ["Gaming Nexus", "Critic", "80", "Portal Pinball is definitely an excellent addition to the Zen Pinball 2 lineup, but that is based purely on its solid pinball mechanics and roots. The Portal aspect comes across as nothing more than cosmetic, which seems like a lost opportunity."], ["Hardcore Gamer", "Critic", "80", "With tons of references and entertaining gameplay, Portal Portal is a great new table. It’s a little thin on content and will require the purchase of either Zen Pinball 2 or Pinball FX2 to play it, however, so it’s an investment that those coming only for the Portal aspect might need to rationalize."], ["GamingTrend", "Critic", "75", "It’s not quite a triumph, but Zen Pinball 2’s Portal table is a stand out in the series’ expansive table list. While there may not be enough meat here to thrill Portal fans with a passing fancy for virtual pinball, it’s definitely a solid choice for anyone who has enjoyed Zen Pinball 2’s other games."], ["DarkStation", "Critic", "70", "A decent enough addition for those collecting Zen Pinball 2: Portal tables though it is a slightly empty homage to Aperture Science."], ["taroko", "User", "0", "They charge $10 for each and every terrible licensed level... Star Wars $10, Hello Kitty $10, Dora the Explorer $10. They are just scamming obsessive fans."], ["Bulbotrax", "User", "0", "very poor game... no inspiration at all... very loosy gameplay ideas... \"level\" design is lazy... according to me, the zen studio is making fun of us.... do not waste your time and money in this."], ["Siddhartha19", "User", "8", "Excellent Pinball table, if you are expecting it to be Portal you are in for a bad time, Pinball tables are usually more of a homage. Pinball is puzzle like, its very tough, in fact much tougher than Portal, for 3$ you get a game with far more replay value."]], "platforms": ["PlayStation 4", "PlayStation 3", "PlayStation Vita"], "image_url": "http://static.metacritic.com/images/products/games/3/f6ce35cc79f9c37e84d1e3e9b6931c40.jpg"}
{"publisher": "Zen Studios", "genres": ["Action", "Miscellaneous", "Parlor", "Pinball"], "rating": "E10+", "title": "ZEN Pinball 2: South Park: Super-Sweet Pinball", "release_date": "Oct 14, 2014", "avg_score": "84", "summary": "Join Stan, Kyle, Cartman, Kenny, and Butters in two pinball tables inspired by everyones favorite mountain town, South Park! Meet characters from the TV show, like Wendy, Timmy, Jimmy, Mr. Hankey, and even ManBearPig (super cereal, you guys) and relive great moments from episodes of the show, including the Sarcastaball and Imaginationland. So, come on down to South Park and see if you cant unwind!", "reviews": [["IGN Italia", "Critic", "95", "It's the best South Park pinball ever. What else do you need?"], ["GameCritics", "Critic", "90", "Nothing else needs to be said—Zen Pinball 2 owners should buy South Park Pinball. South Park fans must buy this table pack."], ["Gameblog.fr", "Critic", "90", "The whole spirit of South Park in two magnificent flippers. Essential for fans of one or the other."], ["ZTGD", "Critic", "90", "If you’re looking for even more pinball in your life, these are some good ones to add to the collection, just keep in mind, you may want to turn the volume down unless you enjoy being annoyed."], ["Softpedia", "Critic", "85", "Zen Studios seems to have an almost uncanny ability to understand what makes big franchises tick and appeal to large numbers of gamers, and then take the concepts and create impressive tables based around them."], ["PlayStation LifeStyle", "Critic", "85", "If you’re a fan of the series and enjoy pinball, buy it."], ["Gaming Age", "Critic", "83", "The only gripes I would have to say I have with South Park Pinball is as follows: A) there only 2 tables, and I’m not sure if it was a decision based on popularity or what, but it would have been nice to have at least one more to choose from in this universe. B) South Park is an undoubtedly politically incorrect game full of dirty words and don’t go there humor, and these two tables are very PG to say the least."], ["Push Square", "Critic", "80", "Much of its appeal may go missing on those that aren't in love with the source material, but everyone else should give this a look."], ["Gaming Nexus", "Critic", "80", "Fans of the long-running TV series will get a kick out of the cameos and inside jokes, but everybody else will be left scratching their heads."], ["Level7.nu", "Critic", "80", "The South Park add-on is yet another great addition to the Zen Pinball\r\nplatform. The main table is filled with memorable lines, classic\r\ncharacters and fun missions that South Park fans will love. The second\r\ntable is a bit low on content, but it’s still entertaining and good\r\nfor newcomers. It’s a shame that the table don’t include more of the\r\nseries offensive humor, but it’s a small complaint on an otherwise\r\nexcellent package."], ["CalmDownTom", "Critic", "80", "Unless you’re a fan of the South Park universe, you’re probably not going to be able to dive into this game. For me, although it’s a ton of fun and bright and cheery – after a while the potty humour and same quips and jokes became somewhat wearisome."], ["XGN", "Critic", "80", "Zen Studios has adapted the series and put it inside two pinball machines. They are very entertaining but very chaotic at times. Especially the sounds are chaotic and annoy easily. Worth buying."], ["DarkStation", "Critic", "70", "Zen Pinball’s South Park offering isn’t perfect but it will serve as a lovely addition to its already robust catalog of tables."], ["Dietryde", "User", "0", "I wish ZEN would get its hands out of my pockets. There is always an additional cost to play."], ["taroko", "User", "0", "They charge $10 for each and every terrible licensed level... Star Wars $10, Hello Kitty $10, Dora the Explorer $10. They are just scamming obsessive fans."], ["FriedConsole", "User", "5", "Have you ever wanted to play mediocre pinball while that annoying guy from school who would just would say random SouthPark catchphrases was in the room?  You should play Zen Pinball SouthPark.  The Butters table doesn't even have that many expressions so it will make you hate Butters forever.  Glad I got this super cheap in a flash sale."]], "platforms": ["PlayStation 4", "PlayStation 3", "PlayStation Vita"], "image_url": "http://static.metacritic.com/images/products/games/6/0a21524a42f6077ca4bd5b330dd7faa5.jpg"}
{"publisher": "Zen Studios", "genres": ["Action", "Pinball"], "rating": "N/A", "title": "ZEN Pinball 2: Star Wars Rebels", "release_date": "Apr 28, 2015", "avg_score": "88", "summary": "N/A", "reviews": [["Gaming Age", "Critic", "100", "Overall, Star Wars Rebels is easily one of my favorite Zen Pinball tables to date. It’s accessible for just about anyone, it showcases its theme quite well, and it’s really hard to stop playing."], ["Gaming Nexus", "Critic", "90", "The Rebels table is easily my favorite Star Wars table from Zen Studios to date. It’s simple design is deceiving, as the mission variety and experiences provide some great challenges and do a great job of introducing the world of Star Wars Rebels."], ["ZTGD", "Critic", "90", "Star Wars: Rebels is another great table for the Zen Pinball platform. It’s easy to play and understand, and offers up a fast paced, high scoring track that really shines in some parts. Zen Pinball players should definitely give this table a shot, especially if you felt a little let down by the Age of Ultron table."], ["Atomix", "Critic", "80", "Star Wars Rebes Pinball is not only a nice tribute to the popular franchise and its animated series; it offers one of the most accessible virtual pinball machines on the entire catalogue of Zen Pinball with fun missions and curious skill shots. It’s easy to start for beginners and challenging for veterans."], ["Softpedia", "Critic", "80", "It has plenty of high-speed and high-stakes action, it moves pretty fast at times, but it also gives you the time to plan your next move between objectives, and to select the ones you feel most familiar with."], ["CoNn3r_B", "User", "0", "I don't know who keeps making these Zen Pinball games but I wish they would stop. Star Wars is a Franchise about Lightsabers and cool battles with the force and blasters and Disney uses it to make a pinball game. I'll let that sink in for a second."]], "platforms": ["PlayStation 4"], "image_url": "http://static.metacritic.com/images/products/games/1/e24b3634bd337b90d970abda263b6728.jpg"}
{"publisher": "Zen Studios", "genres": ["Action", "Miscellaneous", "Parlor", "Pinball"], "rating": "E10+", "title": "ZEN Pinball 2: The Walking Dead", "release_date": "Aug 26, 2014", "avg_score": "83", "summary": "The Walking Dead Pinball table playfield is a tour of the most iconic locations from the game, including the St. John’s Dairy Farm, Travelier Motel, Bell Tower, Train & Level Crossing, RV and more. Original lines and award winning voice actors from the game, including Dave Fennoy and Melissa Hutchison.", "reviews": [["Gaming Nexus", "Critic", "95", "Easily one of the best tables that Zen has produced to date. Every aspect of this table captures the essence and spirit of Tell Tale’s adventures. This is a must buy for fans of Zen’s pinball platforms."], ["Playstation Universe", "Critic", "90", "The Walking Dead table does its job at including the survival and morale-driven themes of the console game and delivers yet another expertly produced addition to the addictive virtual pinball simulator."], ["Softpedia", "Critic", "85", "This is a good way for fans of The Walking Dead to get past the fact that the second season is ending and to pass the time until 2015, when a new episodic game series will be launched."], ["DarkStation", "Critic", "80", "Anyone who has played the first Telltale game or has watched the series owes it to themselves to give this table a shot."], ["GameCritics", "Critic", "80", "I may not be ready to write an in-depth technical analysis on every inch of the Walking Dead board, but it strikes me as a well-designed table that knows its subject inside and out, and it gives fans of Lee, Clementine, and the rest a whole new context within which to play."], ["Gameblog.fr", "Critic", "80", "As a pinball table, The Walking Dead is as good than the original adventure games by Telltale."], ["Level7.nu", "Critic", "70", "The zombie filled Walking Dead series works surprisingly well as a\r\npinball table. The presentation is actually so good it might send\r\nshills down your spine. Another well-made table from Zen Studios,\r\nalthough the art and details on the table make it a bit cluttered."], ["EveMary", "User", "9", "This is one of my favorites. I guess it's not necessary to explain the basics of a pinball table. If you have a TV which is 3D - capable you will experience great fun. But even without it's great for a cheap price. I rated this with 9 points."], ["taroko", "User", "0", "They charge $10 for each and every terrible licensed level... Star Wars $10, Hello Kitty $10, Dora the Explorer $10. They are just scamming obsessive fans."]], "platforms": ["PlayStation 4", "PC", "PlayStation 3", "PlayStation Vita", "Wii U"], "image_url": "http://static.metacritic.com/images/products/games/8/9a603415b1f8f930a3506da46416cb50.jpg"}
{"publisher": "PQube", "genres": ["Role-Playing", "Action RPG"], "rating": "M", "title": "Zenith", "release_date": "Sep 20, 2016", "avg_score": "46", "summary": "Zenith is an action RPG that combines that feel of the golden era RPG games with a generous dose of humor and parody. Adventuring, exploring ruins, accidentally unleashing the apocalypse, saving the world… you’ve done it all, and so has Argus. And, frankly, he’s a bit fed up with the whole thing. He used to be a wizard, which was fine and all, but he’s in his 30s now, and he wants to settle down and get some peace and quiet.", "reviews": [["GameGrin", "Critic", "70", "Zenith is a game that everyone should give a go. It's charming, funny and just well made in general. Don't let the classic RPG setting fool you, Zenith is one for the books."], ["Vandal", "Critic", "70", "Zenith gets the Diablo concept and spices it up with a story full of humor. It feels a little bit outdated, but it's very entertaining nonetheless."], ["IGN Spain", "Critic", "65", "A fun game due its jokes, but not the most polished one. Zenith can be considered ugly, his AI dumb and the graphics aren't great... And even with that, it still entertains."], ["Hobby Consolas", "Critic", "60", "Zenith has a particular sense of humour, but everything fails with its control, combat and game mechanics."], ["Digitally Downloaded", "Critic", "50", "Zenith’s gameplay issues don’t stop it from being a very workable system in a very entertaining genre. If it was devoid of its plot (or, better yet, with a more interesting narrative), I’d actually be arguing that it’s an enjoyable little game. However, the relentlessly juvenile attempts at humour never let up, and I didn’t laugh once. I think that says all that needs to be said about Zenith’s fundamental issues."], ["Playstation Universe", "Critic", "50", "I personally enjoyed Zenith, the story and writing kept me going though all the various issues it presented. The amount of bugs, glitches, and technical performance issues just can’t be overlooked, especially for a casual gamer."], ["Areajugones", "Critic", "45", "This videogame is practically broken on PlayStation 4 and its story relies only on a very dull humor. Its graphics are too old to be featured in a game of this generation."], ["TheSixthAxis", "Critic", "40", "You are never at risk of encountering anything unexpected when playing Zenith, but cutscenes are unpredictable and quite intelligently written (and even well directed at times), so they are genuinely entertaining. But the game is an action RPG by the numbers, and it gives the distinct impression that it is a vehicle for delivering the comedy. This would be fine, but that vehicle would need to be enjoyable and on this one, the wheels have fallen off."], ["PlayStation Country", "Critic", "40", "Zenith isn’t that good and that’s a real shame because on the face of it, things looked promising. The trouble is that the comedy falls flat at every turn and the role-playing elements are so light they’re practically non-existant. Had the developers focused more on gameplay and less on jokes, we might be onto something. Comedy isn’t easy in games and Zenith is exhibit A in the case of how to bad things can get. All is not lost though. The developers have created a functional product and after some more QA testing could have had a fairly average game. I do hope this is a stepping stone onto greater things for them. Don’t believe the reviews giving it zeroes and ones but certainly don’t be fooled into thinking this is anything special either."], ["COGconnected", "Critic", "40", "While the humour seems to be the centre of the game, Zenith has some major fundamental flaws that make it less fun to play and all the more frustrating. If you like the story, the writing and the humour, it might be worth your time. If you need fluid controls and care about the combat and game mechanics, then absolutely not."], ["The Jimquisition", "Critic", "10", "Zenith isn’t just badly made – it’s appalling. A boorish, cynical failure of a comedy game broken in ways I’ve never before seen. The fact it somehow – everso rarely – manages to show a glimmer of wit under all the misery only worsens the deal, highlighting how this could have perhaps been something decent before it was run through whatever thresher led to it becoming the mangled carcass it is...There is no cure for the disease this game carries. The kindest thing to do is take it out back and put a bullet between its glazed, gormless eyes."], ["GrumpyReviewer", "User", "2", "I am so grateful that I got this for 4 bucks... back in the day, when the price was 19 I almost bought it. And still I feel sad that I spent 4 bucks on it."]], "platforms": ["PlayStation 4", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/9/279ac01966cdda84dcc4fdd5f4cac40e.jpg"}
{"publisher": "Aksys Games", "genres": ["Miscellaneous", "Compilation"], "rating": "M", "title": "Zero Escape: The Nonary Games", "release_date": "Mar 24, 2017", "avg_score": "87", "summary": "Two Nonary Games, two sets of nine unwilling participants kidnapped to an unfamiliar location. One set trapped on a sinking boat with nine hours to escape, the other locked in a facility and forced to either trust or betray each other. If they break the rules or fail to escape… they’ll die.", "reviews": [["Playstation Universe", "Critic", "90", "Developer Spike Chunsoft knocks it out of the park with The Nonary Games. The puzzles in both 999 and Virtue’s Last Reward are challenging and rewarding, but it’s their stories that really make you stop and think while trying to figure it all out."], ["ZTGD", "Critic", "90", "The Nonary Games is a fantastic bundle with games that are both fun to play and very entertaining in the story department. Any fan of puzzles games and visual novels should pick this bundle up without a doubt. Even people looking for a great story should give this a look. It has the makings of a good “starter” visual novel. I can’t suggest it enough. Now, if you’ll excuse me, I need to go play Zero Time Dilemma."], ["Digitally Downloaded", "Critic", "90", "I like games that are able to explore serious ideas in an entertaining and subtle fashion. If you weren’t aware of the academic weight that drives the two titles in The Nonary Games, you wouldn’t be missing anything. It’s not essential to understand how game theory works, how it explains human behaviour, and why that’s all relevant to the deeper themes that 999 and Virtue’s Last Reward explore. If you want to take it, simply, as a cracking series of visual novels with sublime puzzle design, you can do that. But, if you’re like me and do take game narratives seriously, then these two are right up there with the best in the industry, and sticking them together into a single package makes them completely essential."], ["We Got This Covered", "Critic", "90", "Those who haven't yet experienced either 999 or VLR are in for a real treat. Both games were already excellent in their previous incarnations, but The Nonary Games bundles two definitive editions together in one simple, appealing package."], ["GamingTrend", "Critic", "90", "Zero Escape: The Nonary Games is the best way for you to play two of the most frequently overlooked visual novels out there. The additions to Nine Hours, Nine Persons, Nine Doors bring new life to a underrated gem, and Virtue’s Last Reward is still as close to perfect as it was when it was first released. If you want to experience two of the best stories from the last generation of handhelds, this is the best way to do so."], ["GameCritics", "Critic", "85", "This is a fantastic presentation of two top-notch virtual novels. My only major quibble is that player is never made aware of how important it is to play the two games in the correct order. It’s not enough to see a couple of endings in 999 – if players don’t make it to the true ending before moving on to VLR, it will be casually spoiled in the most off-handed way imaginable. Beyond that, very little goes wrong here, and I’d say that this one of the best visual novel experiences I’ve had."], ["Multiplayer.it", "Critic", "85", "It's definitely a great collection, and a must have for visual novel and adventure aficionados. The lack of Zero Time Dilemma in the package, unfortunately, makes it hard for newcomers to understand the whole Uchikoshi epic, and is an unfortunate choice in an otherwise amazing return."], ["PlayStation LifeStyle", "Critic", "85", "Zero Escape: The Nonary Games fixes some major issues with 999: Nine Hours, Nine Persons, Nine Doors, but doesn’t go all the way in updating it for current consoles."], ["Wccftech", "Critic", "83", "The Nonary Games contains two of the best-known escape room games (except for perhaps Crimson Room) together in a timeless package. The updates to 999 make it the most definitive version to date, although Virtue's Last Reward feels just the same as it did the first time around."], ["Push Square", "Critic", "80", "For newcomers, Zero Escape: The Nonary Games is an essential purchase. You've got two excellent games that tell a wild and wonderful story that will stay with you for a very long time, and combine that with the engaging puzzles and you've got a recipe for a quality experience. For returning fans, it's a tougher sell: your purchase mostly balances on the enhancements of the PS4 edition, in which case we can only confidently recommend the package if you're looking to do a play though of the improved Nine Hours, Nine Persons, Nine Doors."], ["Darthtux", "User", "10", "To those who love mystery/puzzle games I think this is the main attraction for Zero Escape"], ["Letiste-Gaming", "User", "9", "En conclusión, estamos ante un grandísimo recopilatorio."], ["setuis", "User", "10", "Master piece"], ["ace1325", "User", "10", "i did really not care for V.novel games before i tried this one   and damn i got me hooked on the genre"], ["K30twitch", "User", "9", "To find games like this on the PS4 is a bit of rarity, apart from some indie titles, visual novels or graphic adventures aren't easy to come across."]], "platforms": ["PlayStation 4", "PC", "PlayStation Vita"], "image_url": "http://static.metacritic.com/images/products/games/5/2076b7b23b28ef6d3bfc3a181d585df7.jpg"}
{"publisher": "Aksys Games", "genres": ["Adventure", "Visual Novel"], "rating": "M", "title": "Zero Escape: Zero Time Dilemma", "release_date": "Aug 18, 2017", "avg_score": "80", "summary": "Zero Time Dilemma is the third entry in the acclaimed Zero Escape series. The mysterious Zero traps 9 participants within an underground shelter, dividing them equally between 3 wards that are connected to an elevator shaft in the middle. The only way out  passing through a locked X-Door to access the elevator. Six passwords are required to unlock the door, and each password is revealed only after a participant dies. Zeros Decision Game will offer teams the opportunity to kill other participants through a variety of means to obtain the necessary passwords so they may escape", "reviews": [["ZTGD", "Critic", "90", "Zero Time Dilemma is a nice bow on top of the Zero Escape trilogy, and one that I think many will enjoy if they liked the previous games. It can get a bit complicated both in puzzles and in story, but the mystery and discovery that is involved is what really brings the player back to the game. This one has it in spades. There’s a few choice decisions here and there that made me scratch my head, but those were few and far between, and never took away from the overall experience. This is a must have for fans of the series, and only if you have fully played through the first two games. When you do that, you’ll enjoy your time with Zero Time Dilemma."], ["Digital Chumps", "Critic", "85", "Zero Time Dilemma is a great game and a must-play for those that escaped 999 and VLR. Like many third acts in trilogies across all kinds of media, it’s not as strong as the first or second act, but it’s still solid and I recommend it."], ["Playstation Universe", "Critic", "85", "After completing Zero Time Dilemma all I want to do is go back through all three games with the knowledge I’ve gained through the series, and see how far back everything is foreshadowed and set up. This isn’t just an impressive game in its own right, but a fantastic trilogy that should be experienced by anyone looking for a good sci-fi puzzle thriller."], ["GameSpew", "Critic", "80", "For the most part, Zero Time Dilemma is a challenging, fantastical ride. Its puzzles are perfectly pitched, and while it may take you a while to wrap your head around the game’s story, you’ll delight in slowly piecing together its winding narrative."], ["God is a Geek", "Critic", "80", "Zero Time Dilemma is a great but flawed end to the Zero Escape trilogy with a very good PS4 port."], ["PlayStation LifeStyle", "Critic", "75", "While it’s arguably the weakest in the trilogy, Zero Time Dilemma is still a must for fans that need to know what’ll happen at the end of Junpei and Akane’s journey, and is still a great game in its own right."], ["Video Chums", "Critic", "71", "Fans of escape rooms and puzzle-solving games that don't mind a more adult and dark tone will have a lot of fun with Zero Time Dilemma. It may have dated graphics and sound but that shouldn't stop you from playing it through to see all of its endings."], ["Digitally Downloaded", "Critic", "70", "It lacks the charm and wit of Danganronpa, but Zero Time Dilemma, like its prequels, is still valuable, smart, and stimulating. Its presentation really badly hurts it, but once you push past that distaste, what you’re left with is an intense, engaging and intelligent narrative with some thoughtful and well-designed puzzle rooms to sort through."], ["Tellus12", "User", "9", "Incredible finale to the trilogy. I can't see what people are moaning about with this one, even after having completed them all. It has it's faults for sure, shoddy cutscene graphics and mechanics, crashes occasionally. But the story, length, atmosphere, in game-graphics and sheer effort that has gone into its production after being written off as never bound to happen, all add to the value that this game brings to the fans. The final conclusion was actually very well thought out and people who are claiming that it 'doesn't tie everything up' perhaps didn't understand it due to its complexity. I can't recommend this series enough, but do yourself a favour, play the first one first!"]], "platforms": ["PlayStation 4", "3DS", "PC", "PlayStation Vita"], "image_url": "http://static.metacritic.com/images/products/games/8/23763160e8d82cdadc77c8d3d486eaf4.jpg"}
{"publisher": "Milkstone Studios", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "rating": "T", "title": "Ziggurat", "release_date": "Apr 21, 2015", "avg_score": "80", "summary": "Dungeon-Crawling First Person Shooting at its finest! Fast-paced combat! Dozens of perks, spells and enemies! Level ups! Random Dungeons! Traps! Badass bosses! Carrots! Ziggurat is the best combination of First Person Shooter and Rogue-LITE you have ever seen. Become a neophyte sorcerer, and get ready for your rite of passage: Enter the labyrinth and face dangerous challenges to prove your worth and become a powerful wizard! The game focuses on fast-paced first person shooting, with an old-school vibe, and updated handling and game mechanics. Dungeon crawling and RPG/Roguelike elements are added into the mix, resulting in a fun, challenging and varied game, with lots of content to discover. Fight almighty bosses, get through rooms filled with traps, and treasures that may help you in your journey... Each game is a whole new experience!", "reviews": [["Gaming Nexus", "Critic", "95", "Ziggurat is Milkstone Studios' first game of this scope, and I both hope and believe it will be their breakout game. It is everything a roguelike game should be, and so much more."], ["Areajugones", "Critic", "85", "Ziggurat is undoubtedly one of the best roguelike of Spanish scene, and probably one of the best in the world, thanks to the fun, addictive and immersive experience that the game offers. We miss a cooperative mode, but it is a fun game that can be replayed and won’t allow us to stop playing."], ["PlayStation LifeStyle", "Critic", "85", "For only $15, Ziggurat is a pretty amazing game. It looks beautiful, offers a great deal of replay value, and features wizards in a badass way."], ["Push Square", "Critic", "80", "There's no school like old-school, and Ziggurat serves as a reminder that there's still fun to be had in 2015 with what's essentially an 'arena' shooter."], ["USgamer", "Critic", "80", "An enjoyable, randomly generated FPS romp that's surprisingly addictive. Despite being priced perhaps a little high, and occasionally exhibiting some slowdown and minor glitches, Ziggurat offers many hours of potential entertainment for those willing to take up its considerable challenge."], ["The Games Machine", "Critic", "75", "Ziggurat is a very funny old school FPS arena, but in its chest beats the heart of a roguelike game. Every run is different from the other, and when you will meet the dark reaper the game will start over again from the beginning. If you liked The Binding of Isaac and also love the frenetic gameplay of DOOM this game is made for you."], ["IGN Italia", "Critic", "75", "An old school fantasy first person shooter like we rarely see. It can get repetitive on the long run, but genre lovers should try it."], ["GameSpot", "Critic", "70", "Ziggurat can be completed in just over an hour, but it's unlikely you will stop there. The game is challenging, engaging, and a whole lot of fun, despite its problems."], ["FriedConsole", "User", "8", "After playing Tower of Guns a few weeks ago, I thought to myself there is a good concept here but it needs to be deeper and less flawed.  Luckily Ziggurat arrived at $15 to Playstation 4 to my surprising delight.  A high fantasy first person shooter rougelike with aesthetics harkening back to Hexen, Ziggurat adds refinements such as deeper RPG elements, interesting aesthetics and enemies, and better shooting to the formula."], ["MostCruel", "User", "8", "I think this game is fantastic. It's not by any means a story based game or an rpg where you can micromanage stats but as it is, it works. Arcade style fps at it's finest. Very easy for anyone to just pick up and play but can get much harder the higher the difficulty and lots of things to unlock to keep you playing. Characters of different classes, varied magical artifacts and a countless amount of perks. The graphics are quite good for what it is and the sound is about as good."], ["Dionysus777", "User", "6", "Processing data, calculating vectors, setting ratio enhancement. Resulting information. 6.7435921301 i say isay i says. Its a fun rogue lite 1st person magic shooter bonanza!!! However, it lacks any depth whatsoever and is completely mindless. Good for completionists whom are catatonic and ready 2 go 2 bed."], ["Kaprawiec", "User", "7", "Nice mix between old hexen/heretic and roguelike games."], ["RockStarGamers", "User", "7", "A fun dungeon crawler that mixes old-school bullet hell shooter mechanics with modern procedural generation, all wrapped up in Warcraft style graphics."]], "platforms": ["PlayStation 4", "PC", "Wii U", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/3/4f117c446103bd266e2930778ae60745.jpg"}
{"publisher": "Ubisoft", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "rating": "M", "title": "Zombi", "release_date": "Aug 18, 2015", "avg_score": "71", "summary": "ZombiU thrusts players in the middle of London circa 2012, where an outbreak has infected the population, destroying their humanity and turning them into mindless monsters preying on the flesh of the few remaining survivors. This fear-fueled first-person shooter invites takes all the horror, chaos and tension found in the best of the horror genre and adds original interactive elements, including a unique death mechanic that puts players in the body of a different survivor each time they die, allowing them to track and take down their old, infected characters, recover  their equipment and see if they can stay alive just a little bit longer this time.", "reviews": [["The Digital Fix", "Critic", "80", "Zombi defies the Wii U gamepad's supposed limitations and reanimates into its own impressive beast."], ["Gamer.nl", "Critic", "80", "Graphically speaking, Zombi is dated, but the gist of the game is modern. Zombi gives you that urgency to survive and it deserves the name survival horror more than the recent Resident Evil games. The system of being a new character every time you get killed is amazing, but it is unfortunate that the combat is not always that much fun."], ["Telegraph", "Critic", "80", "It's all highly unsettling, and the most important things about the game -- its mood of fumbling desperation, its clapped-out London settings, its focus on exhaustion and disempowerment -- remain startlingly unchanged after the transition in platform and the stripping of the Wii U's clever propwork."], ["Push Square", "Critic", "80", "Zombi has transitioned to the PS4 rather well: the fear-inducing aspects of the second screen are re-created well enough to achieve similar scares, the loading times are greatly improved, and – three years later – it's still a unique survival title that never compromises its horror for action."], ["VideoGamer", "Critic", "80", "Hopefully somewhere inside Ubisoft there's a team working on a proper sequel to Zombi(U), but for now this is a reasonably priced port that is definitely recommended to anyone who doesn't own a Wii U. Given the lack of meaningful changes for the better, the original game still delivers the best experience, even if the new-gen game looks and performs marginally better."], ["God is a Geek", "Critic", "80", "A few extra bells and whistles would have been appreciated, and the lack of any form of multiplayer beyond leaderboard participation is a definite misstep. Your horror itch might be better scratched by the likes of Outlast and The Evil Within, but Zombi still delivers a solid, immersive experience even without the GamePad wizardry."], ["PSX Extreme", "Critic", "78", "Zombi is a game that might seem too ponderous and frustrating for many. But for those who appreciate a challenging atmosphere that tasks you with marshalling your fears and taking a studious approach to survival, it’s a definite must-try."], ["Critical Hit", "Critic", "77", "Zombi loses a little of its charm in its transition from Wii U to other systems, but not enough to detract from it being a great survival horror game. ZombiU has managed what few games in its genre have; it's a real survival horror, with the emphasis on survival - and it's both tense and terrifying."], ["Hobby Consolas", "Critic", "76", "We don´t miss the use of Wii U gamepad in this Zombi U version for PS4, Xbox One and PC. It mixes survival and horror elements with perfect balance, although graphical elements (details and design) seem outdated."], ["Playstation Universe", "Critic", "75", "A rather basic port instead of a revised version of an underrated gem it needed to be, Zombi still manages to hold up well three years on thanks to the way it makes great use of its location, subject matter and atmosphere to create an unnerving modern survival horror."], ["LaPS4", "Critic", "75", "Ubisoft has done a good job with Zombi. Keeping in mind that it is actually a three-year-old game, the game offers a good experience that any living dead fan will enjoy."], ["GamesVillage.it", "Critic", "73", "The porting of ZombiU on other platforms is decent, and the new control system is well implemented; the game is still good, with its great atmosphere and a nice mix of survival elements. The graphics, though, are almost identical to the original, and that's not a compliment."], ["games(TM)", "Critic", "70", "So compelling are the first seven or so hours that the filthy tricks of the finale can't even sour them. [Issue#166, p.96]"], ["Playstation Official Magazine Australia", "Critic", "70", "On a technical level, sadly, Zombi disappoints. That said, Zombi is saved by an evocative world and a few innovative features that make it feel newer. [December 2015, p71]"], ["Playstation Official Magazine UK", "Critic", "70", "Below-par visuals and production obscure, but don't fully diminish, vibrant design and fresh ideas. [Nov 2015, p.99]"], ["PSX-Sense.nl", "Critic", "70", "Challenging gameplay and a moody atmosphere make for an intriguing experience, though clunky controls and disappointing graphics keep it from reaching the heights its concept deserves."], ["GameSpot", "Critic", "70", "Zombi manages to set itself apart, with its deliberate pacing, desolate atmosphere, and focus on survival. It might not be a Crown Jewel, but this undead romp through London is an interesting change of pace."], ["XGN", "Critic", "70", "Zombi is still a sweet game, which surely gives you a hell of a scary time. This version misses a few features like the multplayer mode and Ubisoft didn't really brush it up graphically. Still Zombi is a game worth playing."], ["Gameblog.fr", "Critic", "70", "Quotation forthcoming."], ["Vandal", "Critic", "70", "Zombi is still a pretty good survival horror game, but Ubisoft hasn't worked too hard on this version. If you cannot play it on Wii U, and you like horror games, it's a game you should try."], ["Metro GameCentral", "Critic", "70", "One of the best survival horrors of recent years, that functions almost as well as the Wii U version. creating a mature-rated adventure that is as ruthlessly difficult as it is engrossing."], ["Game Over Online", "Critic", "68", "The idea of a zombie-apocalypse “Metroidvania” set in what used to be a modern city is an excellent hook for a game, but Zombi is too busy showing off Wii-U features that aren’t there anymore to fulfill that premise."], ["IGN Spain", "Critic", "68", "Zombi is a nice game. Not extraordinary, not exceptional, but it entertains. We have missed the Wii U Game Pad."], ["SpazioGames", "Critic", "65", "This port can't really hit the same high notes of the original on WiiU, and from a technical standpoint it's definitely not the best around. At least the price tag is low."], ["3DJuegos", "Critic", "65", "Far from Wii U and its GamePad, Zombi losses its most obvious original appeal."], ["Digitally Downloaded", "Critic", "60", "Losing the online integration hurts, and because of this the Wii U version is the superior one by a significant margin, despite looking inferior."], ["CGMagazine", "Critic", "60", "Zombi’s unique take on survival horror isn’t enough to compensate for an otherwise bland experience."], ["PlayStation LifeStyle", "Critic", "60", "The Dead Island series provides for more challenge, a better story, and a whole lot more content at around the same price. So unless you’re bored with other zombie games, you can wait for a sale."], ["GamesRadar+", "Critic", "50", "Zombi is hardly a deluxe version of ZombiU, with numerous bugs and few graphical improvements. It's still a good survival game, but feels outdated and misses the Wii U Game Pad."], ["AlberKratos", "User", "7", "I was interested in this game since it was released in WiiU and it was a good surprise to know that it was been released again in PS4. I saw reviews and videos in youtube so I knew what the game would give to me: a clasical zombie survival game, nothing more, nothing less. If you want something more in this game, this is not your game, but as a zombi horror game it´s pretty decent. The sounds are pretty good and creates a good atmosphere that makes possible to be scared, even if the graphics are just ok. The gameplay it´s...well, not very good but this is a good thing, you are a normal person, not a hero or something like that, fighting should be something hard and you should avoid this. This being said, the game doesn´t offer many more option than fighting because you can´t hide. As said before, the graphics are just ok... its a old, WiiU game, you can´t expect more at this cost."], ["lolosaurus", "User", "9", "i love the survival the survival elements of this game! Not the best graphics but one thing is for sure this game is very hard! On my first playthrough in the end i couldnt finish it because i couldnt use c4 and i had to start the campain all over."], ["yekibolan", "User", "5", "El concepto del juego es mas que interesante, y en si es un gran juego, pero no para esta consola, parece que han querido hacer un port barato para la PS4, realmente si quieres disfrutar de este titulo y tienes una wii u, juégalo en esa plataforma, ya que en este sistema no hay ninguna mejora gráfica (en algunos momentos da la sensación de todo lo contrario), y además tiene bastantes bugs que incluso harán que no puedas continuar y tendrás que reiniciar la partida. Una pena la verdad."], ["gmilly88", "User", "7", "As someone who purchased this game for $20 on the ps store and have beat this game 3 times and platinum'd it as well, I believe my opinion on this game holds some weight. With that said, this game is a decent/good but not close to great game. What this game does right is the feel of it. What I mean by that is, it's silent, it's dark and the sound and background noise make it a tense experience. Mix that with the fact that the infected are difficult to kill and can pop out around any corner, this is quite a suspense filled game. The story itself is pretty decent as well, but your character is basically a meaningless John doe opposed to controlling a character with his own path and story. What makes this game good as well is the strategic approach you must take to every mission, and the scarcity of weapon ammunition. You can choose to bring a ton of flares and mines to destroy zombie hordes quickly, or you could hack zombies one by one repeatedly or waste ammunition on them. You have safe houses to unlock as well as shortcuts to unlock to escape to safe houses quickly. Through out your playthrough you learn the ability to lock pick, upgrade your scanner/pad so you can scan/hack secured doors, use your scanner to spot infected, doors, and survival tools, etc.. plenty of good to this game especially the fact that if you are killed by the infected, you respawn in your safe house as a new character and have the option to move on in the story and find new inventory or go back to where you died, kill your zombified old self and get your equipment back. Now.. With all that I pointed out, I gave this game a 7 due in large part to graphics and hand to hand combat as a whole. Graphics are definitely not next gen and are very dated, and killing even the average infected can take 10 hits to the head when it should take 3 at most.. what makes it worse is that even firearms can be underpowered, as I've had moments where I shot an infected in the head 3 times and it kept coming. Only way to kill infected efficiently is to stock up on explosives, flares and shotgun ammo. This game is not the greatest game, but it certainly isn't bad at all. Combat and graphics aren't very good but the tense atmosphere, dim lighting, and overall sound and feel of this game is definitely survival/horror that has been missing in gaming over the years. This game is a 7 for me.. for $20 on the ps store, this is a game you can't go wrong with.. and though I pointed out that graphics and combat are negatives, if you're a gamer (like myself) it won't kill your experience with it."], ["Meredithe", "User", "9", "Very good value for money for this portage on next gen console. No addition but the price is fair and the core experience is still really fun. Play it in the dark ;)"], ["AymEven", "User", "10", "I was interested in ZombiU since its orginal launch but never had the opportunity to play it. Glad I'm finally able to enjoy it on new gen ! Great survival game, kinda scary ! :p"], ["LordAlex", "User", "10", "Nice port at a decent price: approved! This game is one of the purest forms of actual survival horror to date: I take my time with every room I enter, every street I walk through, and search for anything that could help. Any gamer who enjoys overcoming strategic challenges will find it addictive!"], ["JayLightBar", "User", "6", "I would have to say, ZombiU was one of the few reasons I had ever even given the WiiU a slight looking, but now that it's out for other consoles, I've finally had my go at it... and, it's a pretty fair game. Now what most people I could imagine are so twisted up about and butthurt over is the fact this is a slow passed, survival horror game with action elements, and the simple fact that it's 'Not scary' makes it not horror. In my eyes, horror doesn't need to be scary, simply suspenseful. And Zombi did that for me. Many moments I spent in this game had me backed into a corner, low on health, and surrounded by the dead. The story is interesting, but nothing special. Visuals are clunky but reasonable for a 20 dollar release. I had a few bugs throughout my playthrough as well, and it really over all felt a bit flat in the end. But, Zombi is a decent game. Pretty good in my eyes, but something you'll need a taste for to enjoy it."], ["voiders", "User", "8", "Here and youtube have so much nintendo fanboys angry. WTF?"], ["TheQuietGamer", "User", "9", "It's nice to see that more people are going to get a chance to check out this former Wii U exclusive (called ZombiU). It's a real treat for hardcore zombie fans. While the title's often frustrating issues are still present, it's good ideas still shine through to make for an excellent experience for zombie fanatics. Mix in some new additions and you've got a port that manages to narrowly outshine it's Wii U counterpart."], ["FallenHades", "User", "3", "Played it on the WiiU, way better than on Xbox One and Playstation4. The gamepad's map, camera when scanning and touch screen made it more interesting to play. Its kinda dull on everything else"], ["tsakiym", "User", "4", "u can win the game with your first melee weapon.i nether felt the horror or the challenge about this game. good game for wiiU and bat for the rest consoles. i never felt rewarded about anything"], ["PaulVeto", "User", "3", "The original ZombiU could hardly be called a good game but the experience it provided was quite solid. That's exactly what the problem with this port is - it lacks all the unique features the Wii U version had. It was the Wii U GamePad usage that made the game, at the very least, memorable, and none of those stunning abilities it gave the player are present in this shallow, budget port."], ["Fabos", "User", "10", "Just a good game, finally available on something else than wii U. Wans't able to play it then, so it's good value for money at 20$ for more than 10 hours of play apparently !"], ["LucasCGamer", "User", "6", "Um jogo que te prende do começo ao fim, os graficos são bonitos, atmosfera de terror ótima, level design de qualidade, história peca realmente mas de resto o jogo é incrível, realmente vale a pena ainda mais pelo preço."], ["SeanGamerDays", "User", "9", "At first, you know you want this game. But, it's on WiiU (and you don't like WiiU). Well don't worry, because Ubisoft did right this time, by bringing Zombi to PC/PS4/X1, & it gets f**king better, bloody, brutal, & ZOMBI! But you might also need to know, that every Ubisoft game still have a glitch, so don't get too crazy, 'kay?"], ["juzzzy74", "User", "1", "i have purchased this online and when i try to get the second book for the doc i have a barricade in the way of the gate i need to go thru does anyone know why or is there a fault in the game"], ["DaveAus", "User", "3", "The emotion and sadness over a character death is taken away EVERY TIME by a big \"Sign into Network\" coming on screen. Really Ubisoft? You push out a budget single player game with no online content, and then pressure us to sign in at a moment you should be trying to keep immersion?"], ["Inf1inite", "User", "6", "The game was good on the U, but i can't see it get into the correct gen consoles,  the game try to be a hardcore game, but every hardcore gamer see it as a casual game. worth full price? not at all, worth on sale? yea, maybe, if you into this kind of games, if not, just skip to another game."], ["Unlimitedpowa2", "User", "5", "This game was free for PS+ members. So I said to myself, why not give it a try? I never expected a good game, but it just fails on so many levels."], ["SwitSwat", "User", "4", "I have a WiiU, though this title never really interested me. Seeing as it was free for PS Plus members (April 2016), I said, why not? After playing quite a bit of it, I'm glad that I never bought it.It's not a downright terrible game, but many of its sections are very boring, gameplay-wise and also environment-wise. If anything, I might keep playing it just to get the platinum trophy. Otherwise, there really isn't any replay value or any reason to buy it at full price for that matter."], ["qiwichupa", "User", "8", "Very good entertained game. Looks like compilation of gameplay elements from another games like Metroid Prime, Dead Island, Resident Evil, even Assassin's Creed etc. etc. But it looks like something solid and joyful, if you will try to play with no death (even on normal), and in night time and in headphones. Nice story and characters, good atmosphere,  very rare scarejumps. 8/10"], ["SuperkenGaming", "User", "6", "Zombi"], ["juancmontoya2", "User", "9", "Very solid game, the original WiiU version had some extra gimmicks but that isn't needed to enjoy the game. The game holds up by itself as very atmospheric, dying isn't game over it just gives you a new person to play as. Very interesting game, it shouldn't be compared as an inferior version to the WiiU on the sole basis of some gimmicks."], ["slartibartfasts", "User", "8", "This was the only game worth buying the Wii U for and it's translated quite well to the PS4."], ["PhilosophyRex", "User", "6", "Un diseño artístico muy bueno....es prácticamente lo único bueno que tiene. El guión carece de interés, el inventario aunque mínimo (porque apenas hay recursos) es lioso acceder cuando quieres a los objetos, el sistema de apuntado de armas es horroroso y gráficamente es muy justito. Y el mapeado laberíntico no ayuda a meterte en la ambientación, si querían que explorásemos que hubieran dado más motivos aparte de el de perderte."], ["Nel", "User", "6", "It had a potential to be great game, but due to several bugs, and guns being rendered to be pretty much useless, the upgrading system being completely useless, I can't say that is that great. The game isn't very scary, but if you see past the flaws it is a semi-good survival type of game"], ["Henvak", "User", "4", "Me esperaba mas, y termine borrando el juego casi al final de la trama. Gráficamente no es malo, pero el combate es bastante monótono y aburrido, la historia es malilla y tener que reunir 7 trozos de cartas para llegar al final me parece absurdo la historia, aparte decían que era un mundo abierto y de mundo abierto no tiene nada, son 8 o 9 zonas que vas transportarte desde unas alcantarillas a otras. Sinceramente no lo recomiendo. (Por lo menos para PS4)"], ["raccoondaddy", "User", "8", "I picked this up on sale on the PSN, well after the Wii release.  This was a sort of a blind buy for me.  And I gotta admit, it was a nice departure from the shoot first, run later approach to zombie games.  The mood and setting is a little bland, yet kind of cool sometimes.  There were certainly a few jump scare moments in the game.  In fact, there did seem to be a few too many, lol.  But honestly, those moments did scare me on a number of times.  Which made this a more terrifying experience.  Along with the limited inventory and constant need to scav for things.   I'd say this was a good experience to me and that's all that should matter in a game, right?!"], ["CoreGamer1408", "User", "5", "Atmospheric survival game that didn't capitalize on it's greater potential. Looks dated and cheaply made, but still had some fun intially with it for all it's technical flaws and limitations in game play."]], "platforms": ["PlayStation 4", "PC", "Wii U", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/2/2b5d57da03d3c04708549ce5e988421b.jpg"}
{"publisher": "Rebellion", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "rating": "M", "title": "Zombie Army Trilogy", "release_date": "Mar  3, 2015", "avg_score": "62", "summary": "In the dying embers of World War II, Hitler has unleashed one final, unholy gamble – a legion of undead super soldiers that threatens to swallow up the whole of Europe. Fight alone or team up to save humanity from the zombie menace in this apocalyptic third-person shooter.", "reviews": [["XGN", "Critic", "85", "Zombie Army Trilogy is a true paradise for snipers. You can enjoy the game alone, but it is way more fun when played in co-op. With fifteen challenging missions and a Horde mode you can enjoy this for hours."], ["PSX-Sense.nl", "Critic", "75", "It's repetitive, but lengthy and a lot of fun in co-op. It won't win any prices or anything, but as far as brainless shooters go, you can't do much better than this."], ["Playstation Universe", "Critic", "75", "Love zombies, hate Nazis? Zombie Army Trilogy is an impressive three game package that needs to be played co-operatively to get the most out of it. It can be a bit of a slog, but good enemy variety and level variety keeps it challenging and fun."], ["GameCritics", "Critic", "70", "One of the better co-op shooter experiences available on current generation consoles, and the slower pacing and shambling foes give it a character unlike anything else out there."], ["Playstation Official Magazine Australia", "Critic", "70", "Zombie Army Trilogy is a real treat until it gets bogged down in repetition. Best served with a side of friends. [May 2015, p78]"], ["Playstation Official Magazine UK", "Critic", "70", "Without any upgrade path and thus little reason to invest in a character, your fun with Zombie Army Trilogy will ultimately be short-lived. [May 2015, p.94]"], ["Gamer.no", "Critic", "70", "At its core, this is just a reskinned version of Sniper Elite, but Zombie Army Trilogy manages to be so much more than that, with enemies that are fun to shoot, inventive level design and great cooperative play."], ["Eurogamer Italy", "Critic", "70", "Looking for an enjoyable TPS with lots of action and hordes of (zombie) enemies to kill? Look no further, as Zombie Army Trilogy is the perfect game for a quick and careless session of blasting everything that moves. Unfortunately, though, there’s not much more than that."], ["God is a Geek", "Critic", "70", "A fun novelty buddy shooter that offers a pure enough experience but lacks real substance and character."], ["Destructoid", "Critic", "70", "If you can get past the cheap-feeling engine and have three buddies on hand, you'll have a lot of fun with Zombie Army Elite. It's a blast to overcome particularly tough sections with a team, and hitting an on-point shot from 50 feet away can provide quite the rush."], ["Hobby Consolas", "Critic", "70", "Zombie killing is quite simple in this Sniper Elite \"spin off\". It´s fun, but level design is very limited and technical aspects need some improvement."], ["TheSixthAxis", "Critic", "70", "Zombie Army Trilogy knows what it wants to be, a straightforward zombie sniping game that lacks any real pretensions or delusions of grandeur. Parts of the trilogy are showing their age and difficulty spikes can sap away the fun, but steel yourself for a challenge, get some mates together and there’s plenty to like about it."], ["IGN Spain", "Critic", "65", "Mediocre in every aspect, but so funny for its own zombie-killer premise. The new Horde mode is the most valuable addition to this compilation, especially if played 4 players co-op."], ["LaPS4", "Critic", "62", "Zombie Army Trilogy is an odd game. It is as terrible as enjoyable. The co-op mode options give some fun into a game that could have taken a way better step into the next-gen."], ["Atomix", "Critic", "60", "Zombie Army Trilogy is a decent third person shooter that works most of the time, but it lacks of new ideas or concepts. If you want to have a good time with a friend, you should give it a chance."], ["games(TM)", "Critic", "60", "Diversity in the playable cast doesn't equal diversity in gameplay, though. [Issue#160, p.104]"], ["3DJuegos", "Critic", "60", "Zombie Army Trilogy is as brainless as its main antagonists. And the new content included it’s not a sequel indeed, is just a few more maps to kill zombies again."], ["Digital Spy", "Critic", "60", "While there's good fun to be had in co-op mode, and players who like their shooters chock full of zombies won't be disappointed, this feels likes a somewhat limited package on the whole."], ["Gamer.nl", "Critic", "60", "Outdated graphics, exploding heads and nazi zombies; this co-op zombie shooter is a straightforward game without any distractions. One sniper and three friends equal shallow entertainment in this game."], ["Push Square", "Critic", "60", "Zombie Army Trilogy is an enjoyable co-operative shooter that's a lot of fun when played with others. Unfortunately, it runs out of steam all too quickly, giving you a severe dose of déjà-vu once you realise that you're playing very similar encounters, with only the backdrop changing."], ["PSX Extreme", "Critic", "56", "Zombie Army Trilogy is familiar and fun for a short spell. The third game is a good deal better than the first two but for the most part, it’s a ho-hum action blast-fest that doesn’t have enough “oomph” behind it."], ["Metro GameCentral", "Critic", "50", "Exactly as simplistic and one note as the name implies, but if you want to shoot undead Nazis with your friends then you can’t say the game doesn’t deliver."], ["PlayStation LifeStyle", "Critic", "45", "Zombie Army Trilogy may only be a patch or two away from being a decent co-op affair, but in its current state it is a mess of a game."], ["Gamestyle", "Critic", "40", "When there’s no more room in hell, you’ll be forced to sit on earth playing this game for eternity."], ["JeuxActu", "Critic", "40", "Zombie Army Trilogy is not a good shooter and is not a good cooperation game either. Gameplay is dull and repetitive, level design is ridiculous and the result is far from being on a par with such a reference as Left 4 Dead."], ["NZGamer", "Critic", "30", "Zombie Army Trilogy feels exactly like what you think it is – a collection of DLC packages. With a bare-bones frame propping it up, the game is an emaciated experience with an overly ambitious price tag attempting to tie it all together."], ["Justmatt101", "User", "9", "Oh for crying out loud....the bulk of these published reviews just flat out stink and miss the point.  Glad I picked this up.  Fantastic horror-themed WWII sniper / 3rd person shooter game."], ["ESJBond007", "User", "9", "I have never played the Nazi Zombie Army series for the PC nor have I really played the Sniper Elite series which it is based upon. So this was my first dip in to the franchise."], ["Dog4life", "User", "8", "It's a great spin off from Sniper Elite 2, with improved graphics, over the top gore and great 4 player coop fun."], ["Sgtkeebler", "User", "10", "Omg this is such an amazing zombie WW2 shooter. The reviews don't do this game justice because you know anyone who has really played this game, like youtube lets play people, and just other gamers in general you know that this Is a highly recommended game. If your a fan of COD zombies then you will be a huge fan of this series. This is my first time playing it and so many of my friends from youtube told me I must buy this game so here I am. I saw the bad reviews and I thought wait a minute this game is amazing. Sometimes it can be kind of hard because you have zombie snipers shooting at you then regular ground zombies running after you. The best part about this game is you must land a head shot to kill the zombies. Not none of this garbage where if you land a shot anywhere it kills them, no headshots only!! I highly recommend this game to anyone who is looking for a great zombie game. I bought it at 50$ and I thought it was money well spent."], ["dallasnda614", "User", "10", "Super fun with friends and endless hours of fun i love the game and hope rebellion releases another zombie army title. It does a great job of making players work together. Just a great shooter"], ["XXReview39", "User", "10", "Zombie army trilogy is for all zombie fans who look forward to play amazing coop  on the campaign mode or the horde mode. Both modes are extremely fun , it becomes even better when you play with 4 friends and share awesome zombie decapitating moments ! normal zombies are somewhat awesome to kill but the bosses are a big challenge when you are in tight situations. This game is fun , its story is fun , coop is amazing and i would recommend people to buy it if you love zombies!"], ["MakgSnake", "User", "9", "What can I say, I love zombies and I LOVE it when a company takes a popular idea and capitalize on it. Zombie Army Trilogy has more of World At War Nazi Zombie feel to it. It is more of a real take on zombie apocalypse than the one in Call of Duty. Zombies don't really get faster as you go up the wave on Horde mode but they do get more difficult with different variations of zombies coming at you. There is A LOT of content in this game. The story mode alone have basically 15 levels of 4 player Co-Op fun with excellent 70's exploitation music in the background. 5 additional HORDE mode maps and you've got yourself hours and hours of zombie killing fun with your buddies."], ["johnbman11", "User", "9", "I saw a random video of this a few months back and totally forgot about it. Then BAM! the PSN shows this as a new game for only $39.99. Did a little research (gameplay/feedback), and made the purchase. This is a surprisingly fun game! It plays surprisingly smooth and is a lot of fun with co-op. I'd definitely recommend it! They're ported games so the graphics aren't anything to write home about but they are still pretty good seeing as how they came from the PC platform."], ["Fastback69Stang", "User", "10", "This is easily one of the coolest games I have played in a long, long time from a purely fun and atmospheric standpoint. It just has this amazing vibe. Evil Dead Nazis would be a good way to describe it. Expect the unexpected in a high action horror game with incredible atmosphere. Think Sniper Elite and Return to Castle Wolfenstein crossed with something like Evil Dead. It is totally it's own animal. The game has co op and Horde Mode ."], ["Jamezlap", "User", "10", "This is a really good game wthat is specially for Co-op. The game is fun and challenging you really need to be close to your teammates because there's hundreds of zombies trying to kill you at once! Not only that but also the type of zombies are really unique, every zombie has something special where you need to do different tactics to win. Story mode is more like a left 4 dead type (which is fun) and horde is even better because you can stay hours and hours with your team surviving and killing zombies. The game art design is beautiful and you can really appreciate this with the 60 FPS. This game is one good Zombie survival game. 10/10"], ["WORDSof1K", "User", "9", "This game is awesome! Let me be serious for a moment though and say that this game brings some great things to the table. Is it worth $50? Yes. You get three decent long campaigns with a for sure replay value. The Horde mode is just delicious fun and gets very challenging. The addition of the bullet cam from sniper elite series, yes I know this game is tied into the series, makes every shot feel like an amazing experience."], ["Thegodfatherson", "User", "7", "Rebellion's LEFT 4 DEAD clone, makes for fun but in limited amounts. ZAT is just Sniper Elite V2, but with nazi zombies and co-op multiplayer. The graphics are gorgeous, Trilogy shows out the next gen consoles, with a dark tone. It looks better than Sniper Elite 3 on the PS4. Rebellion shoves the exact same gameplay in Zombie Army Trilogy, but adds some extras to it. The multiplayer is to DIE for, it recreates the fun we had in L4D by multiply that with nazi zombies and crazy fun game modes. But, the same tedious shooting and ideas are shoved into this package, and for a 60 dollar price tag, it doesn't fully realize the great potental Rebellion ignores ever so often. But it is a damn fun game, and one that I will be getting back to soon. Without the washed out ideas, Zombie Army Trilogy would be a game that changes co-op multiplayer forever."], ["kenmil", "User", "4", "Too lazy to develop new maps and make this a real game, the developers have just continued on from Sniper Elite, complete with the familiar glitches. This game is repetitious and ridiculously difficult in patches, but only through the sheer weight of numbers that come at you. Nothing clever, original or really entertaining in this, and the levels of gore are just over the top."], ["ericjover", "User", "10", "I own Nazi Zombie 1 and 2 on PC, and getting the entire trilogy on PS4 was a no brainer since many of my friends are on console.   The Zombie Army Trilogy quenched my thirst for zombie annihilation after being let down by CoD:AW Havoc zombie mode and all the other piss poor zombie shooters in the market."], ["Bigbabysweetz", "User", "8", "This game is great! I Takes what COD does with zombies and gave it a more dark and disturbing feel too it. What is really the cherry on the top are the kill cams in this game. Making a fantastic shot slows down time and you can see your well placed shot pierce the organs of zombies. Might sound weird but once you watch a quick video of it you will know what im talking about.  Its a Co-OP game, and a ABSOLUTE blast to play with friends and just kinda hangout and make jokes. Only thing that is wrong is there is not a active community. Might get repetitive fast and for 50 dollars might not be worth it. i would buy the game again and happy with the purchase."], ["RETROBOTER", "User", "7", "Graphic: 7/10"], ["ZombieHunter93", "User", "9", "This is easily one of the most enjoyable Zombie games I have played in a long time. In a market that has become increasingly saturated over the years, mostly due to the ongoing popularity of Call of Duty's Zombie modes, it is refreshing to play something that feels so balls out ridiculous and designed purely for enjoyment. There are no deep metaphors about the state of the human race, no morally ambiguous choices to make, just waves and waves of Zombie scum to obliterate in any means you deem fit. Don't get me wrong, there is definitely a place for a deeper exploration of the Zombie theme in gaming, but it's just so refreshing to see something deviate so whole heartedly from that and pull it off without just seeming like a stupid cash in."], ["akus_1985", "User", "8", "My favorite aspect of Zombie Army Trilogy (ZAT) is the soundtrack. While many contemporary games either downplay or misuse music, ZAT nearly always uses music to its full advantage to create a unique atmosphere, that sounds and feels like it was ripped straight out of an 80's horror film in the style of John Carpenter. This game truly separates itself from its contemporaries with its incredible vibe, and horror-themed motif. There are around 12 stages and they are rather long and feel varied enough to not get stale. Despite the level you choose, you'll always be shooting, blowing up, and kicking an incredible amount of zombies. And, as repetitive as that sounds, it really isn't because ZAT offers a healthy amount of strategy while slaying the undead. Well placed trip wires, mounted guns, and explosive canisters can be utilized at the right moments to destroy multiple zombies at one time, and the difficulty can be adjusted for a more arcade based or realistic experience while sniping. Turning up the zombie count is amusing as well, albeit it usually makes the game impossible if turned up too high. The weaponry feels varied enough as far as I'm concerned. You'll most likely find a combination you like, and stick with it. The character selection is ample, but they play exactly the same as far as I can tell. They are only different cosmetically. The graphics aren't anything special, but they get the job done. The game shines, or doesn't actually, when it uses shadows and light contrast to its advantage. Seeing the silhouettes of zombies slowly approaching you hundreds of feet away in a subway that is harshly lit is an amazing sight. Similarly, witnessing shadows of a horde engulf a nearby hallway, builds incredible tension, and works astoundingly well when accompanied with the fore-mentioned soundtrack. Despite the tantalizing atmosphere, the game does have some occasional frame rate drops (more so in multiplayer) that detract from the overall experience. Thankfully, the technical issues aren't persistent enough to spoil an otherwise enjoyable experience. If this game flew under your radar when it was released, and you are a fan of retro-horror, do yourself and buy this unique game. I don't even typically like shooters all that much, especially the Call of Duty franchise, but this is a very different experience. ZAT is certainly an anomaly, and its a shame it won't be played by most gamers, because it's a great game that breathes some fresh air into a stale genre"]], "platforms": ["PlayStation 4", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/1/72d5e592ee926223cb5db12eb3133f96.jpg"}
{"publisher": "Zoink!", "genres": ["Action", "Beat-'Em-Up", "2D"], "rating": "T", "title": "Zombie Vikings", "release_date": "Sep  1, 2015", "avg_score": "64", "summary": "Loki just snatched Odin's last magic eye right out of his eye-socket and hastly gangled off with it. Thor and the gods are too busy partying, so blind as a bat, Odin makes a desperate move. He raises four of the most fearsome Zombie Vikings out of Norse soil - Gunborg, Seagurd, Hedgy and Caw-kaa! A putrid posse sent on a mission through the most epicness of worlds to retrieve The Eye and make peace with their rotten pasts.", "reviews": [["PSNStores", "Critic", "90", "Overall, Zombie Vikings produces a humorous adventure in the same narrative style as Zoink’s smash hit Stick it to the Man, therefore Zombie Vikings is just as highly recommended as Stick it to the Man for players who appreciate action, adventure and platform genres, especially when fused with comedy."], ["Multiplayer.it", "Critic", "80", "Packed with lots of funny gags and a unique, beautiful art style, Zombie Vikings is a solid action game."], ["ZTGD", "Critic", "80", "I’m a huge zombie fan and have been for years. I never thought I’d get to see a game combine these two elements together to include an extremely humorous tale."], ["We Got This Covered", "Critic", "80", "The occasional groan-worthy joke and technical hiccup may turn some off, but underneath those issues, Zombie Vikings is a mechanically solid and visually vibrant throwback brawler."], ["TheSixthAxis", "Critic", "80", "Zombie Vikings is a fun beat ’em up that has some excellent moments of humour, with distinct feeling playable characters and a moderate level of difficulty. While the single-player alone is good, the multiplayer is where Zombie Vikings truly stands out. Zoink Games have shown once again why it is a studio worth keeping an eye on."], ["Playstation Universe", "Critic", "80", "A gloriously funny and unabashedly enjoyable side-scrolling hack em’ up, Zombie Vikings is great fun with friends but falls just short of true excellence on account of some glaring visual flaws."], ["CD-Action", "Critic", "70", "A fun beat ‘em up wonderfully devoid of any deeper meaning. It’s one of those games you’ll forget about very quickly, but you’ll be playing it with a big smile. [11/2015, p.42]"], ["Everyeye.it", "Critic", "70", "It's primarily a multiplayer experience, and that's where it really shines: played by yourself, it won't show enough lasting appeal."], ["DarkZero", "Critic", "70", "Zombie Vikings is most definitely one of the best indie games I’ve played through 2015, and I would highly recommend it. It’s a vast improvement on what was a similar-looking yet exemplary game in it’s own right, and it makes me excited for what Zoink have in stall in the future."], ["PlayStation LifeStyle", "Critic", "70", "If you have friends to play with then Zombie Vikings will be a fun way to spend a couple days with them. Otherwise, it’s a brawler with a lot of heart, but not enough variety."], ["3DJuegos", "Critic", "70", "Not the best beat 'em up we have played, but definitely one of the most humorous we have seen."], ["God is a Geek", "Critic", "65", "A fun, but unremarkable beat-em-up, best enjoyed with a group of friends."], ["Digitally Downloaded", "Critic", "60", "Zombie Vikings is basic brawler, but it's a basic brawler done right, and is quite funny in the process. And, really, that's all most people are looking for from this genre. There are far better examples out there of it, but as a Sunday afternoon killer, this one is nonetheless almost as worthy as Thor himself."], ["Push Square", "Critic", "60", "Zombie Vikings is a charmingly designed beat-'em-up, but it's ultimately a fairly shallow one. It's fine for a multiplayer laugh, and even single player has its moments thanks to the humorous plot, but it's only likely to amuse you once, before you leave it on your hard drive waiting to rot."], ["Brash Games", "Critic", "60", "A fairly fun game that’s loads more fun with friends. It’s nothing really ground breaking though."], ["DarkStation", "Critic", "50", "Unfortunately the game also has some design issues, repetition and a solid lack of good jokes."], ["Vandal", "Critic", "50", "Zombie Vikings is fun when played with friends, but it's unfinished. Maybe a few extra weeks or month could've changed our opinion, but now is in serious need of updating and patching."], ["Gaming Age", "Critic", "42", "Even with a full squad of undead at the current price point of $19.99 it's still a questionable purchase. If you want your Beat 'em up thirst quenched, I would stick to a classic like something from the Streets of Rage series or something more modern like Castle Crashers."], ["Destructoid", "Critic", "25", "Overstays its welcome and starts to get rather monotonous around halfway through."], ["juliosith", "User", "10", "Hilarious and very fun game. I was missing a good coop coach brawler (you can play online as well) Castle Crasher style. Not very complex but fun enough to keep you entertained for  hours. Characters are very unique and the dialogues are priceless. If you like to have some fun with your friends go for it."], ["imageform", "User", "10", "The premise for Zombie Vikings is great - Loki steals Odin's one good eye and takes off, only to be chased by undead Vikings (you) that Odin summons up for the hunt."], ["Forgotten", "User", "8", "Funny back story and the game keeps this wacko-style throughout. 2D brawler with an element of 3D movement with a stylistic art regarding characters and environment. Easy to start and get into with friends, hilarious attacks and laid back progression. If you're familiar with the Norse mythology you'll also find bits and pieces that makes you chuckle. Very good game, minus 2 points because of buggy UI where the health bars can disappear after an in-game shop visit and that when the screen zoom out during battles, it can be hard to focus on your own character. But you'll get through it by button-mashing anyway."], ["Bastrix", "User", "6", "The art is superb, the scripts are fun and entertaining but the final gameplay not so much. It has some great elements there but I just find it the handling slow, sluggish and in the end annoying. It's a shame cos it could of made a superb classic 2D button masher with fun dialogs and great characters and there are not many of those on PS4."], ["ablaise82", "User", "7", "Besides the game not telling you that only 1 character can reflect, which make a certain portion very annoying, this is a great game. Good art, fun CO OP, funny dialogue, and a decent amount of play time."], ["destinyfan1", "User", "7", "Zombie vikings  if you  even think about that title you think about a b- movie . But its not, zombie vikings is a very fun game"]], "platforms": ["PlayStation 4", "PC", "Xbox One"], "image_url": "http://static.metacritic.com/images/products/games/1/e3cab4481e7a46c14eb466cbaa11a92a.jpg"}
{"publisher": "UFO Interactive", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "rating": "E", "title": "Zotrix", "release_date": "Dec  8, 2015", "avg_score": "57", "summary": "A twin-stick space shooter that combines the retro look and feel of 80’s and 90’s arcade games with modern gameplay elements, customization, and depth. [UFO Interactive]", "reviews": [["4Players.de", "Critic", "76", "When it comes to dualstick shooters you don’t have to ask me twice. Nonetheless Zotrix isn’t love at first sight. But if you get used to the quirky arcady feel à la Galaga where positioning is as important as reflexes you might develop an interesting friendship."], ["COGconnected", "Critic", "70", "While the retro graphics are a tad unsophisticated, Zotrix has a catchy techno soundtrack, which gives the game a lively feel. While there are definite drawbacks that come in the form of difficult controls, repetitious levels and an uneventful story, if you are a fan of classic arcade shooters, you will definitely enjoy the simplicity of this game."], ["GameCrate", "Critic", "63", "Zotrix could've been a spectacular homage to old-school shooters had the developers focused on tighter controls and a simpler menu interface. As it stands, though, it's deeply flawed, though some players will find mileage out of it due to its vast offerings and spectacular soundtrack. Give it a try before you buy if you can, just to see if the test drive is worth it."], ["Playstation Universe", "Critic", "60", "Fun to play with plenty of replay value, Zotrix sounds the part but the clunky interface and non-nonsensical controls prove to be frustrating."], ["Push Square", "Critic", "50", "Zotrix is a decent if unambitious twin-stick shooter with smooth, fluid controls that are well suited to pick up and play sessions. A steep difficulty curve means that you will need patience, while the awful UI makes it a challenge to navigate the title's menus. We'd recommend this if you're desperate for an arcade-inspired blaster, but otherwise leave it in a galaxy far, far away."], ["Hardcore Gamer", "Critic", "40", "While the mechanics are enticing, it’s far from standing out as an otherwise satisfying experience."], ["Brash Games", "Critic", "40", "Zotrix is a bit of a rough ride that turns to cinders under scrutiny."], ["PSNStores", "Critic", "40", "Some enjoyment can be found in Zotrix, if you can get past all of the technical issues that plague the game. However if that doesn’t ruin the experience, the menu interface sure will. It can ruin all enjoyment of the game."], ["FriedConsole", "User", "4", "This game tries to be interesting with by being a shootem-up that you can mine resources and customize your ship.  Fails terribly in execution. Worst menus I have ever seen.  Every mission is the same.  Boring.  Nope."], ["Nel", "User", "3", "Game has several interesting plots, and the story mode is intriguing, but  it is an absolute lagg fest. The controls are way beyond horrible, and makes navigating the menus a nightmare."]], "platforms": ["PlayStation 4", "PC"], "image_url": "http://static.metacritic.com/images/products/games/0/e6ebdc17c9416af769503e9b1d69bb3c.jpg"}
